{
  "ARCH-1200": {
    "subj": "ARCH",
    "crse": "1200",
    "name": "Beginners Architecture Career Discovery Program",
    "description": "Two-week introduction to architecture for rising high school juniors and seniors includes morning programs and introductory lectures in history and theory of architecture, computing and simulation, freehand and extreme drawing, building ecologies, building conservation, and construction systems. There will be field trips and career counseling. Afternoons will have individually critiqued (tutored) design studios, group and individual projects, reviews, and public presentation. Acts as an opportunity for career discovery to decide whether a design education in architecture is appropriate. Summer term annually. Dates TBA. 9:00 am - 4:00 pm."
  },
  "ARCH-1210": {
    "subj": "ARCH",
    "crse": "1210",
    "name": "Advanced Architecture Career Discovery Program",
    "description": "Similar structure as the Beginners program. The Advanced program will continue to cultivate design foundations explored in the Beginners course. Dates: TBA. 9:00 am - 4:00 pm."
  },
  "ARCH-2150": {
    "subj": "ARCH",
    "crse": "2150",
    "name": "The Ethos of Architecture",
    "description": "This course will examine the spectrum of architectural phenomena and ideas without a specific chronology using examples ranging from antiquity to the contemporary world in western and non-western civilizations and produced in both vernacular and disciplinary cultures. An essential part of this course is to stimulate students' curiosity about architecture and the larger world and introduce them to key issues of architecture regarding space, form, critique, technology, aesthetics, societal and cultural contexts, etc. Particular emphasis will be given to the emergence of modernism in architecture. Crucial to the goals of this course is to encourage students to pursue and develop their own unique vision and voice in architecture throughout their education and practice. Fundamental to this process is making students aware of the necessity to challenge their own subjectivities, biases, and presuppositions."
  },
  "ARCH-2160": {
    "subj": "ARCH",
    "crse": "2160",
    "name": "Architectural Media",
    "description": "This course continues the inquiry begun in ARCH 2150 The Ethos of Architecture and focuses especially on the implications that various media and means of representation have on the breadth of concerns within the history, theory, and critical practices of architecture and especially the generation of architecture."
  },
  "ARCH-2330": {
    "subj": "ARCH",
    "crse": "2330",
    "name": "Structures 1",
    "description": "Introduction to Structures introduces the student of Architecture to the principles of structural mechanics and their application to basic architectural structures comprised primarily of wood. The fundamentals of statics are presented in order to gain an understanding of the way in which external forces produce internal stresses in individual members and, in essence, flow through the building system to be resolved at the foundation level. The principles of strength of materials are studied to understand how particular structural materials and configurations manage to resist these forces without unacceptable distortions, or even failure. Wood structural properties are studied in all their complexity as a means to internalize the more theoretical topics broached. Through in-class presentations, reading, homework and project work, computer lab, field trips, and case studies, the student will be aided in developing this intuitive (while practical) understanding. It is recognized that intuitions of building technologies are not acquired quickly but result from much study, observation, and practice. Introduction to Structures makes use of the several approaches above to ensure that the beginning student is provided with a broad, solid base for future structural investigations. WebCT will be used to expand the student's access to course materials and allow for a measure of distance learning. Sustainability: The following notions are introduced as important attributes of sustainable structures and construction: durability and service life and life cycle cost."
  },
  "ARCH-2350": {
    "subj": "ARCH",
    "crse": "2350",
    "name": "Construction Systems",
    "description": "Construction Systems centers on the development of a technical knowledge of, sensibility to, and intuition for the process by which an architectural design is realized in built form. The interdependence among building materials, acoustic qualities, enclosure systems, interior, finish, and other systems is investigated, with an emphasis on the broader architectural design endeavor. Drawing as a means of understanding forms the basis for a semester-long project to be done in small groups. Case studies will center on concepts and systems that have not yet found their way into mainstream practice. The course approach will involve in-class presentations, project work, field trips, and case studies. WebCT will be used to expand the student's access to course materials and allow for a measure of distance learning. Sustainability: The notion that design intentions can be nullified through incorrect construction is stressed. The importance of proper detailing, construction, and maintenance to accomplish lasting and efficient enclosures is highlighted. Skills to diagnose and treat incorrect construction are developed."
  },
  "ARCH-2360": {
    "subj": "ARCH",
    "crse": "2360",
    "name": "Environmental and Ecological Systems",
    "description": "An exploration of the fundamental principles of human physiology, thermal and luminous comfort, and indoor quality. Emphasis is on bioclimatic and psychrometric climate analysis and its relationship to architectural design, understanding the energy exchange between body in space, the natural meaning of enclosures, and nonstructural materials and systems. The focus is on passive heating, cooling, and daylighting systems and their design. Exercises include vital sign analysis of existing spaces (thermal, air, luminous), forming hypotheses of building performance, using scientific instrumentation, tenant survey techniques, and physical modeling and simulation techniques related to daylighting and shading techniques."
  },
  "ARCH-2370": {
    "subj": "ARCH",
    "crse": "2370",
    "name": "Energy, Comfort, and Ecology",
    "description": "This course addresses fundamental principles relating the environmental context to human needs and comfort. Topics include the principles of thermodynamics at the architectural scale, optimization versus variability, principles of building sites and orientations, psychometrics, and human comfort, and an introduction to energy modeling. This course is required of all students in the B.Arch. degree program."
  },
  "ARCH-2510": {
    "subj": "ARCH",
    "crse": "2510",
    "name": "Materials and Design",
    "description": "This course establishes an understanding of the most common materials, their properties and resulting uses, and the implications of their uses in the larger context of material life cycles. The structural makeup of metals, ceramics, polymers, and composite materials is discovered and their resulting properties, costs, and life cycle consequences are clarified. An understanding of basic mechanical properties is established hands on by conducting tension, compression, and 3-point bending tests (mse-lab). Physical performance of material constructs as synergy between form and material properties is further illustrated. Experiments are conducted that introduce such major concepts as structural loading, properties of sections, and resulting system performance. Sustainability: The concept of life cycles is introduced; material and energy flows are tracked throughout the entire material life cycle. This will be accomplished alongside introducing major material groupings (metals, polymers, ceramics, and composites). Students come to realize that environmental concerns are directly related to structural composition and material availability. Consequences of resource extraction, distribution, manipulation, use, and disposal, reuse or recycle are addressed at both local and global scales. Selected field trips to materials extraction, processing, manufacturing, disposal, and recycling facilities are aimed to give physical meaning to the concept of life cycle."
  },
  "ARCH-2520": {
    "subj": "ARCH",
    "crse": "2520",
    "name": "Digital Constructs 1",
    "description": "This course will examine and teach methods of representation and the communication of design concepts. Skills taught will enable students to produce two-dimensional and three-dimensional digital models, as well as drawings from multiple perspectives. Students will understand virtual environments as they pertain to model making, drawing, scale, and materiality. Students will be introduced to digital modeling and graphic design softwares. This course is offered in the fall semester and is required of all first-year architecture undergraduates in the B.Arch. program. Coordination of the relationship of course content to Architectural Design Studio 1 will be between the Digital Constructs 1 faculty instructor and the first-year architectural design studio coordinator and faculty."
  },
  "ARCH-2530": {
    "subj": "ARCH",
    "crse": "2530",
    "name": "Digital Constructs 2",
    "description": "This course builds upon topics covered in Digital Constructs 1 by focusing upon contemporary means of producing and communicating architectural ideas. Students will use digital methodologies through all phases of a project as well as advanced representation and digital fabrication techniques. The use of digital modeling as a sketch and iterative tool will be emphasized. Tools taught in Digital Constructs 2 will build upon those software programs taught in Digital Constructs 1. This course is required of all first-year architecture undergraduates in the B.Arch. program. Coordination of the relationship of course content to Architectural Design Studio 2 will be between the Digital Constructs 2 faculty instructor and the first-year architectural design studio coordinator and faculty."
  },
  "ARCH-2540": {
    "subj": "ARCH",
    "crse": "2540",
    "name": "Digital Constructs 3",
    "description": "This course introduces computational and procedural design approaches that are a logical extension to topics covered in Digital Constructs 2. Students will develop an understanding of computational logic through introductory design applications, both as advanced tooling and as generative design techniques. Methodological approaches will be contextualized by a presentation of historical and theoretical precedents. Techniques introduced will include scripting, Java, geospatial mapping. This course is offered in the fall semester and is required of all second-year architecture undergraduates in the B.Arch. program. Coordination of the relationship of course content to Architectural Design Studio 3 will be between the Digital Constructs 3 faculty instructor and the second-year architectural design studio coordinator and faculty."
  },
  "ARCH-2550": {
    "subj": "ARCH",
    "crse": "2550",
    "name": "Digital Constructs 4",
    "description": "Building on techniques taught in Digital Constructs 3, this course will expand upon the role of technology in architecture by introducing advanced methods of design analysis and resolution. Students will learn to address issues of optimization, environmental surroundings, structure, and site by using various contemporary analytic software programs. This course is offered in the spring semester and is required of all second-year architecture undergraduates in the B.Arch. program. Coordination of the relationship of course content to Architectural Design Studio 4 will be between the Digital Constructs 4 faculty instructor and the second-year architectural design studio coordinator and faculty."
  },
  "ARCH-2600": {
    "subj": "ARCH",
    "crse": "2600",
    "name": "Graduate Design Studio",
    "description": "Design studio introducing students to general design through a series of short projects. The projects stress critical and creative thinking and invention, interdisciplinary collaboration, observation and perception, communication and visualization. Students will begin open-ended investigations using sketching, photography, model making, and computing."
  },
  "ARCH-2800": {
    "subj": "ARCH",
    "crse": "2800",
    "name": "Architectural Design Studio 1",
    "description": "This course introduces students to design as a way of thinking, creating, and making through a series of short projects. The projects stress critical and creative thinking and invention, interdisciplinary collaboration, observation and perception, communication and visualization. Using sketching, photography, model making, and computing students pursue open-ended investigations of form, space, materials, and the ideas that both generate and are generated by them. This course is required of all first-year architecture undergraduates in the B.Arch.  program."
  },
  "ARCH-2810": {
    "subj": "ARCH",
    "crse": "2810",
    "name": "Architectural Design Studio 2",
    "description": "This course continues the processes of critical inquiry in relation to design and design creativity through a series of hands-on projects that incorporate fundamental issues of technology, materiality, abstraction, tectonics, and theory that consider the array of architectural issues in the design of built environments that consider architecture in a wider sense that includes its involvement with site, context, situation, and simple program. This course is required of all first-year architecture undergraduates in the B.Arch. program."
  },
  "ARCH-2820": {
    "subj": "ARCH",
    "crse": "2820",
    "name": "Architectural Design Studio 3",
    "description": "This studio focuses on the relationship between building and landscape in terms of conceptual, pragmatic, ideological, aesthetic, and functional issues. As such, it endeavors to examine critically the disciplinary boundary between building and landscape. It also critically assesses the connections and inherent complexities between an institutional situation, workplace activity, and residential inhabitation in order to explore questions of publicness and privacy. This studio also addresses the tectonic dimensions of construction and structure in architectural design. This course is required of all second-year architecture undergraduates in the B.Arch. program."
  },
  "ARCH-2830": {
    "subj": "ARCH",
    "crse": "2830",
    "name": "Architectural Design Studio 4",
    "description": "This design studio builds on prior studios emphasizing projects of greater scale and complexity. Typically, the studio designs large-scale housing developments but other projects of similar complexity may be used. The studio requires the analysis and critique of precedent and the writing of an architectural program. This course is offered in the spring semester and is required of all second-year architecture undergraduates in the B.Arch. program."
  },
  "ARCH-2850": {
    "subj": "ARCH",
    "crse": "2850",
    "name": "Building Performance Studio 1",
    "description": "This studio considers the design of architectural form and space from the perspective of how the many factors of environmental and ecological forces give shape to them. The studio will employ architectural design projects as a means to explore these issues qualitatively and quantitatively. This course is required of all architecture undergraduates in the B.S. in Building Sciences program."
  },
  "ARCH-2860": {
    "subj": "ARCH",
    "crse": "2860",
    "name": "Building Performance Studio 2",
    "description": "This studio continues the work of the Building Performance Studio 2 to consider in greater depth and detail the design of architectural form and space from the perspective of how the many factors of environmental and ecological forces give shape to them. The studio will employ architectural design projects as a means to explore these issues qualitatively and quantitatively. This course is required of all architecture undergraduates in the B.S. in Building Sciences program."
  },
  "ARCH-2940": {
    "subj": "ARCH",
    "crse": "2940",
    "name": "Projects in Architecture and Environmental Design",
    "description": "Individual projects and readings adapted to the needs of individual students.Credit Hours: 1 to 6"
  },
  "ARCH-2960": {
    "subj": "ARCH",
    "crse": "2960",
    "name": "Topics in Architecture and Environmental Design",
    "description": "Experimental courses tried out in one or two terms as the general program requires.Credit Hours: 1 to 4"
  },
  "ARCH-4010": {
    "subj": "ARCH",
    "crse": "4010",
    "name": "Seminar in Sensory Culture",
    "description": "This seminar examines human perception from a designer's perspective. It draws on perspectives from the sciences, arts, and humanities in order to build an understanding of how people perceive and interact with the environments they create. One cannot only read about perception; the seminar will augment reading with a range of direct experiences as source material for discussion."
  },
  "ARCH-4020": {
    "subj": "ARCH",
    "crse": "4020",
    "name": "Bedford Architecture Engineering Seminar",
    "description": "This interdisciplinary seminar consists of students from both the School of Architecture and Civil Engineering department. Presentation of a variety of structural typologies bears direct relation to practical experience and the necessity for constructive interdisciplinary discourse. Specific structural typologies are examined through historic and contemporary project examples that are critically deconstructed and critically analyzed with respect to their basic engineering principles and architectural concepts. Students will be exposed to the collaborative methods inherent within the architect/engineer relationship. The course consists of lectures concerning each topic, case studies, and presentations of relevant projects, an interdisciplinary design project and discussion of the projects and presentations with respect to interdisciplinary discourse. Content and delivery may vary by instructor. Taught with CIVL 4020."
  },
  "ARCH-4050": {
    "subj": "ARCH",
    "crse": "4050",
    "name": "Cities and Their Territories",
    "description": "An important ancillary concern throughout the previous eight courses of the history, theory, and criticism sequence has been the examination of architecture as a fundamental part of the forces of urbanization and humanity's interventions into the landscape and environment. This course highlights the perspective of that dimension of architectural understanding by examining in detail both historically and contemporarily many of the most significant ways that human habitation has engaged the world at the large scale of cities and geographies. This 2-credit course is required of all architecture undergraduates in the B.Arch. program."
  },
  "ARCH-4070": {
    "subj": "ARCH",
    "crse": "4070",
    "name": "Twisted Siblings: Relationships Between Contemporary Painting and Digital Architecture",
    "description": "Architecture and painting are two of the oldest forms of societal expression and have been historically linked in complex and dynamic ways. In the 20th century, the movements of Cubism, Futurism, Neo-Plasticism, Constructivism, Purism, Surrealism, and Dadaism consisted of dynamic dialogs between architecture and painting. These exchanges allowed each to have a profound and deep impact upon the other. By contrast, in early 21st century, there seems to be all but a mute relationship between the two. This course intends to help break that silence. This course will begin to bridge the divide by establishing new connections between the current preoccupations with materials, procedures, and affects that are emerging in both contemporary painting and architecture. Twisted Siblings seeks to explore and discover new relationships between the most cutting-edge digital technologies and how painting may influence the expressive capacities of these technologies. As contemporary painting and architecture seek to establish future directions, a new dialog and exchange of ideas should be emerging, to ensure a dynamic and radical future for both. The course will consist of a series of lectures, discussions, and presentations. Students will be expected to research a number of individual architects, painters, and writers who are producing work of related interest. Students will be responsible for completing a research project, which synthesizes the content of the course."
  },
  "ARCH-4090": {
    "subj": "ARCH",
    "crse": "4090",
    "name": "Architectural Case Studies",
    "description": "Works of architecture embody knowledge, ideas, and imagination that express formally, spatially, and materially the ways of living and values of the civilizations in which they occur. In continuing the inquiry begun in The Ethos of Architecture and employing the skills and values acquired in that course and Architectural Media, the intent of this course is to teach students the means for investigating buildings coherently, rationally, and interpretively to understand the technical and cultural knowledge embedded within works of architecture. A select number of modern and contemporary buildings that represent a high degree of sophistication in the way their architects have approached the breadth of design issues both within and external to the programs of those works will be analyzed critically in order to ascertain the significance and relationships of the multiple systems of order inherent to a work of architecture."
  },
  "ARCH-4100": {
    "subj": "ARCH",
    "crse": "4100",
    "name": "An Architectural Genealogy",
    "description": "This course addresses the history of architectural and related developments in selected Western and non-Western civilizations in order to construct a conceptual and strategic understanding of the relationships between architecture, culture, civilization, technology, and thought. In doing so, it will focus on key constructed spatial phenomena of the pre-modern world and, where relevant, elucidate the connection of these works of architecture and their motivating ideals to those of the modern and contemporary world."
  },
  "ARCH-4120": {
    "subj": "ARCH",
    "crse": "4120",
    "name": "Cloud Atlas: 20th Century Architecture, Culture and Civilization",
    "description": "Building on the knowledge, critical perspectives, and abilities that students have acquired in the previous courses in the history, theory, and criticism sequence, this course begins a study of the ideas, values, theories, and practices that contributed to the rise of modernity in the western world and eventually on a global scale. This course explores the ideal of modernity as both a cultural phenomenon and as a technological enframing of the world, scientific rationality, historical consciousness, etc."
  },
  "ARCH-4150": {
    "subj": "ARCH",
    "crse": "4150",
    "name": "Contemporary Design Approaches",
    "description": "Reflecting on the knowledge and understandings acquired in all the previous courses in the history, theory, and criticism sequence, this course is a critical inquiry into the principal ideologies and premises of the most substantive architectural practices in the contemporary world. As such, the content of the course must necessarily evolve as the intellectual and cultural parameters of both theory and practice in the contemporary world change. The principal aim of the critique of various contemporary positions is to reinforce in students the importance of developing and critically maintaining their own values, vision, and voice in the design and making of architecture that was initiated in ARCH 2150, The Ethos of Architecture. Fundamental to this process is to encourage the students' awareness of the necessity to challenge their own subjectivities, biases, and presuppositions."
  },
  "ARCH-4160.80": {
    "subj": "ARCH",
    "crse": "4160.80",
    "name": "Research Investigations: Project Built Ecologies",
    "description": "This class is taken by professional students from the School of Architecture's Troy campus accepted into the one-semester visiting program at CASE in NYC. The course is structured to integrate visiting students into ongoing research at CASE by forming cohort groups that work directly with in-resident Ph.D. students. Architectural research methods are explored throughout the semester and include; case studies, modeling, simulation, and prototyping of building systems. The course consists of topical lectures, and discussions regarding progress of ongoing research projects."
  },
  "ARCH-4170.80": {
    "subj": "ARCH",
    "crse": "4170.80",
    "name": "Environmental Parametrics",
    "description": "Environmental Parametrics is an intensive introductory course on visual scripting theory and methodology intended to give incoming students a foundational base in computational and parametric design modeling in order to supplement fall semester courses for new and incoming students into the Built Ecologies and Geofutures post professional programs without prior experience. The techniques presented in this course allow designers to integrate environmental data and simulations fluidly into 3D models and the design process. A new and progressively more complex topic is introduced each week, and each topic is presented with an associated design exercise. This course is taught in a seminar format with some instructor led tutorials and workshop content linked to dedicated breakout time for completing assignments and modeling. A devoted archive folder for downloading and uploading course material and completed exercises will be used for the course. B.Arch. students can only register for the 4000 level of this course and M.Arch. students must register only for the 6000 level of this course."
  },
  "ARCH-4330": {
    "subj": "ARCH",
    "crse": "4330",
    "name": "Structures 2",
    "description": "This course builds on the material presented in Structures 1, with an emphasis on the analysis and design of structures compressed primarily of steel and site cast and pre-cast concrete, with an overview of load-bearing masonry and advanced systems. The theoretical concepts covered in the introduction course form the conceptual basis for work in Structures 2, with relevant new concepts/techniques covered. Innovative, non-normative structural systems are investigated and discussed. Analysis and design will proceed using primarily computer-aided techniques. The course approach will involve in-class presentations, homework and project work, computer lab, field trips, and case studies. WebCT will be used to expand the student's access to course materials and allow for a measure of distance learning. Sustainability: The following notions are introduced as important attributes of sustainable structures and construction: structural robustness, and programmatic flexibility. (Design optimization approaches are introduced and explored as avenues to accomplish more optimum design conditions under increasingly strict design constraints.)"
  },
  "ARCH-4510": {
    "subj": "ARCH",
    "crse": "4510",
    "name": "Construction Industry Seminar 1",
    "description": "This course introduces the construction industry as an essential context for realizing architecture. It is a survey of the people, organizations, and professional and industry groups involved in design, construction, finance, insurance, and regulation of building. Current issues influencing design quality are identified by the class and are explored in a series of student-organized in-depth seminars with industry participants. This is required of all architecture undergraduates in the B.S. in Building Sciences program."
  },
  "ARCH-4520": {
    "subj": "ARCH",
    "crse": "4520",
    "name": "Construction Industry Seminar 2",
    "description": "This course continues the examination of the diverse and interconnected aspects of the construction industry as an essential context for realizing architecture. It surveys the history and current developments of the people, organizations, and professional and industry groups involved in design, construction, finance, insurance, and regulation of building. Current issues influencing design quality are identified by the class and are explored in a series of student-organized in-depth seminars with industry participants. This is required of all architecture undergraduates in the B.S. in Building Sciences program."
  },
  "ARCH-4530": {
    "subj": "ARCH",
    "crse": "4530",
    "name": "Building Sciences Capstone",
    "description": "This course offers the students the opportunity to demonstrate a comprehensive knowledge of issues and practices in an important subject within the building sciences through a self-initiated and faculty-directed independent design, research, or research/design project. This is required of all architecture undergraduates in the B.S. in Building Sciences program.  This is a communication-intensive course."
  },
  "ARCH-4540": {
    "subj": "ARCH",
    "crse": "4540",
    "name": "Professional Practice 1",
    "description": "An introduction to architectural practice as related to accomplishing design projects. An overview of professional obligations, registration and conduct, architects' roles in project delivery, and office organization and management for delivering professional services. In-depth examination of architects' responsibilities for health, safety, and welfare in design; building code requirements for fire protection, life safety, and accessibility; economics of building systems and assemblies; design and construction contracts; and design documentation."
  },
  "ARCH-4550": {
    "subj": "ARCH",
    "crse": "4550",
    "name": "Professional Practice 2",
    "description": "This course covers topics that are essential to developing an effective professional architectural practice. The course will address professional obligations and ethics, contracts, registration, office organization, and management. The course will emphasize effective communication, negotiating, public speaking, and team development."
  },
  "ARCH-4560": {
    "subj": "ARCH",
    "crse": "4560",
    "name": "Materials and Enclosures",
    "description": "In a world of rapid technological change, this course aims to equip future architects with the ability to position, understand, and implement new materials and systems in meaningful ways. The working principles of selected advanced materials and systems are explained and issues of material development, applications, and integration into buildings systems are addressed. Emphasis is also placed on understanding the issues involved when combining and installing new materials or systems into buildings. Students are further introduced to detail development. Sustainability: New materials and systems are explored with the objective of formulating meaningful technological response to critical environmental and societal issues such as resource depletion, environmental degradation, and globalization."
  },
  "ARCH-4580.80": {
    "subj": "ARCH",
    "crse": "4580.80",
    "name": "Materials Systems and Productions",
    "description": "The goal of Material Systems and Production is threefold: to develop a fundamental understanding of materials through first principles, classification, production, and impacts, to develop models for material properties and testing, and to develop criteria to make reasoned choices for the implementation of materials in the built environment. Students will engage in directed research projects with the intent of opportunistically identifying intrinsic material properties, exploiting production-forming logics, and developing a prototype detail assembly for testing."
  },
  "ARCH-4590": {
    "subj": "ARCH",
    "crse": "4590",
    "name": "Entrepreneurship and Architecture",
    "description": "This course addresses the range of economic issues related to the practice of architecture. Topics will include economic cycles and building construction, globalization of architectural practice, case studies of models of practice, setting and negotiation of fees for services, economic relationships of architects and consultants, cost estimation."
  },
  "ARCH-4730": {
    "subj": "ARCH",
    "crse": "4730",
    "name": "Sustainable Building Design Strategies",
    "description": "This course addresses an exploration of design strategies that produce environmentally responsible buildings. A review of the principles for a variety of green strategies will be presented. Case studies will be employed to demonstrate best practices in the design integration of green strategies. The material covered can be incorporated into a studio design development course."
  },
  "ARCH-4740": {
    "subj": "ARCH",
    "crse": "4740",
    "name": "Building Systems and Environment",
    "description": "Design analysis and performance characteristics of building environmental systems, emphasizing heating, cooling, ventilation, and lighting systems. In addition, building electrical systems, acoustics, water, waste, and drainage systems are covered in terms of fundamental theory, designs, and calculations. Case studies, field trips, and system design project work are required."
  },
  "ARCH-4750": {
    "subj": "ARCH",
    "crse": "4750",
    "name": "Sustainable Building Design Metrics",
    "description": "A review of current and anticipated metrics associated with sustainable building design will be reviewed as well as construction practices in the building industry will be discussed. How sustainable design practices can mitigate the climate change in a positive way will be reviewed. An understanding of energy terminology is useful for this course. Lectures, discussions, field trips, and assigned reading will be utilized to explore the subject matter."
  },
  "ARCH-4770": {
    "subj": "ARCH",
    "crse": "4770",
    "name": "Architectural Design Studio 5",
    "description": "This is an upper division architectural design studio that explores topics of contemporary interest to the discipline. Students apply for this studio based on their personal interest and professional objectives. Three such studios Architectural Design Studio 5, Architectural Design Studio 6, and Architectural Design Studio 7, are required for the degree. This course is offered in the fall and spring semesters and is required of all architecture undergraduates in the B.Arch. program."
  },
  "ARCH-4770.80": {
    "subj": "ARCH",
    "crse": "4770.80",
    "name": "Architectural Design Studio 5",
    "description": "This is an upper division architectural design studio that explores topics of contemporary interest to the discipline. Students apply for this studio based on their personal interest and professional objectives. Three such studios Architectural Design Studio 5, Architectural Design Studio 6, and Architectural Design Studio 7, are required for the degree. This course is offered in the fall and spring semesters and is required of all architecture undergraduates in the B.Arch. program."
  },
  "ARCH-4780": {
    "subj": "ARCH",
    "crse": "4780",
    "name": "Architectural Design Studio 6",
    "description": "This is an upper division architectural design studio that explores topics of contemporary interest to the discipline. Students apply for this studio based on their personal interest and professional objectives. Three such studios Architectural Design Studio 5, Architectural Design Studio 6, and Architectural Design Studio 7, are required for the degree. This course is offered in the fall and spring semesters and is required of all architecture undergraduates in the B.Arch. program."
  },
  "ARCH-4780.80": {
    "subj": "ARCH",
    "crse": "4780.80",
    "name": "Architectural Design Studio 6",
    "description": "This is an upper division architectural design studio that explores topics of contemporary interest to the discipline. Students apply for this studio based on their personal interest and professional objectives. Three such studios Architectural Design Studio 5, Architectural Design Studio 6, and Architectural Design Studio 7, are required for the degree. This course is offered in the fall and spring semesters and is required of all architecture undergraduates in the B.Arch. program."
  },
  "ARCH-4790": {
    "subj": "ARCH",
    "crse": "4790",
    "name": "Architectural Design Studio 7",
    "description": "This is an upper division architectural design studio that explores topics of contemporary interest to the discipline. Students apply for this studio based on their personal interest and professional objectives. Three such studios: Architectural Design Studio 5, Architectural Design Studio 6, and Architectural Design Studio 7, are required for the degree. This course is offered in the fall semester and is required of all first-year architecture undergraduates in the B.Arch. program."
  },
  "ARCH-4810": {
    "subj": "ARCH",
    "crse": "4810",
    "name": "Sonics Research Lab 2",
    "description": "The second semester of the Sonics Research Lab includes advanced acoustical measurement techniques. Another important part of the semester curriculum concerns noise sources, noise control, and vibration measurements. State-of-the-art, commercial software and the school's research-based software will be used for simulation/analysis/measurement of room acoustics in order to show the students how such technical tools assist in acoustics research and consulting practice for the design of performance and public spaces. The course will also give students a deeper theoretical understanding of architectural acoustics in order to assist them in room acoustics research. There will also be labs to reflect typical measurement procedures and (if time permits) site visits to acoustics research labs and different types of acoustical spaces. The Sonics Research Lab 2 emphasizes more training on independent hands-on and problem-solving skills (than the Sonics Research Lab 1). B.S. and B.Arch., and other school students can only register for the 4000 level of this course and M.S. in Architecture students must register only for the 6000 level of this course.\n\nThis course is required of all graduate students in the M.S. in Architectural Sciences with Concentration in Acoustics, and in co-term. Other undergraduate students from Architecture and Engineering can take it as a minor course at the 4000 level."
  },
  "ARCH-4820": {
    "subj": "ARCH",
    "crse": "4820",
    "name": "Integrated Design Schematic",
    "description": "This studio is a design-based studio that focuses on the integration of structural, technical, detail, zoning, and code-related issues with respect to the design of a moderate to large-scale building of civic importance. Such building types are (but not limited to) libraries, theaters, city halls, judicial buildings, educational buildings, etc. An important focus of the design project will be the relationship of the building to its urban context. An essential part of the design will involve programming of the building as well as responding to numerous of the learning outcomes defined by the NAAB (the accrediting agency for professional architecture programs) for a comprehensive design project. This course is required of all architecture undergraduates in the B.Arch. program."
  },
  "ARCH-4830": {
    "subj": "ARCH",
    "crse": "4830",
    "name": "Integrated Design Development",
    "description": "This studio is a technology-based design studio emphasizing the materialization and making of architectural design projects. The integration of building code requirements for fire protection, life safety, accessibility, building environmental systems, structure, construction, and materiality is central to the effective achievement of design intent. Students become aware of how these issues affect and inform design decisions. They learn to integrate technology, systems, and materials in the comprehensive resolution of building design and gain exposure to construction documents and design documentation. Construction and site visits are an integral part of the studio as is an integrated electronic media seminar on CAD applications. Students must coregister for ARCH 4540 Professional Practice 1, a concurrent 2-credit course that introduces codes, the regulatory process, agreements, contract documents, building design cost control, and administration. This course is required of all architecture undergraduates in the B.Arch. program."
  },
  "ARCH-4840": {
    "subj": "ARCH",
    "crse": "4840",
    "name": "Architectural Acoustics 1",
    "description": "This course provides an overview of the essentials for architectural acoustics design of performance and public spaces, including concert halls, theaters, museums, classrooms, sports arenas, courtrooms, and religious buildings. There are no prerequisites, but the course may be used as the starting point for a certificate in Architectural Acoustics, a concentration in an architecture student’s professional electives, or the beginning of a master’s degree in acoustics. The course covers basic principles of sound, room acoustics, sound absorption in rooms, sound isolation and privacy, acoustics of mechanical systems, and sound quality. After both Architectural Acoustics 1 and 2, the student should be prepared for a basic entry-level position in either acoustics in architecture or in acoustical consulting."
  },
  "ARCH-4850": {
    "subj": "ARCH",
    "crse": "4850",
    "name": "Architectural Acoustics 2",
    "description": "In the spring semester, students will have the opportunity to design their own performance hall. This process will include continued studies of acoustics measurements, simulated sound fields, community noise issues, and professional practice in acoustics consulting. The course will also have detailed lectures on concert hall acoustics, sound quality, and synthesized sound fields. Students will be introduced to a variety of simulation software and measurement equipment in the Acoustics Research Laboratory. After both Architectural Acoustics 1 and 2, the student should be prepared for a basic entry-level position in either acoustics in architecture or in acoustical consulting."
  },
  "ARCH-4860": {
    "subj": "ARCH",
    "crse": "4860",
    "name": "Applied Psychoacoustics",
    "description": "Topics include the functional overview of the auditory system, loudness, pitch, and timbre perception, masking, binaural hearing, auditory scene analysis, multi-modal integration, and auditory perception in rooms. Required signal processing methods will be covered as well. Course taught with ARCH 6860."
  },
  "ARCH-4870": {
    "subj": "ARCH",
    "crse": "4870",
    "name": "Sonics Research Lab 1",
    "description": "The Sonics Research Lab is completely research based. The first part (the Fall semester) will be focused on hands-on research tools and techniques. First, students will learn the basics of digital signal processing, develop an understanding of measurement equipment and analysis methods for sound. The course will examine the ISO standards of room-acoustic measurements, develop students' research goals and a specific set of data to gather for their research. The course will also prepare the students with the fundamental knowledge on CATT Acoustic and/or EASE in geometrical modeling. Then the students and professors will visit a number of performance venues (e.g. EMPAC Concert Hall, and/ or other venues) and perform the room-acoustic measurements. Students will then work on analyzing and interpreting the research results. Practice measurements will be scheduled in the gallery or somewhere on campus before trips to performance halls. MATLAB will play a central role throughout all the classes (SRL I &amp; II) and the thesis research projects. It will be used during the class exercises. Within one week from the semester start, every student is required to INSTALL a functioning MATLAB Software package onto her/his laptop computer.\n\nB.S. and B. ARCH, and other school students can only register for the 4000 level of this course and M.S. in ARCS students must register only for the 6000 level of this course."
  },
  "ARCH-4880": {
    "subj": "ARCH",
    "crse": "4880",
    "name": "Aural Architecture",
    "description": "In this course, design processes in architectural acoustics will be studied from a psychoacoustical perspective. Different concepts to create physical and virtual acoustic spaces will be discussed based on perceptual design goals. Topics include ecological psychoacoustics, sound quality, auditory virtual environments, and auditory computational modeling."
  },
  "ARCH-4890": {
    "subj": "ARCH",
    "crse": "4890",
    "name": "Engineering Acoustics",
    "description": "Introductory materials of engineering acoustics for students with basic knowledge in mathematics (at least one level of first-year college). Much of the course material is taken from the textbook \"Acoustics for Engineers\" by Blauert and Xiang (2nd Ed.). The course includes mechanic and acoustic oscillations, the wave equations in fluids,  governing equations for horns and ducts, spherical sound sources and arrays, piston membranes, diffraction and scattering, dissipation, reflection, refraction and absorption, isolation of air- and structure-borne sounds, noise propagation and noise control. B.S. and B.Arch. students can only register for the 4000 level of this course and M.S.Arch. Acoustics students must register only for the 6000 level of this course."
  },
  "ARCH-4910": {
    "subj": "ARCH",
    "crse": "4910",
    "name": "Final Project Design Research Seminar",
    "description": "This seminar is the first required course of the two-semester, 5th-year Final Project course sequence in the undergraduate program and as such serves as a prerequisite to the spring semester ARCH 4920 Final Project Design Studio. The Design Research Seminar provides a forum for readings and discussions as well as design and/or material experimentation as it relates to the respective Final Project instructor's thematic framework. The seminar also covers fundamentals related to standard methods of research and analysis. This 3-credit course is required of all architecture undergraduates in the B.Arch. program."
  },
  "ARCH-4920": {
    "subj": "ARCH",
    "crse": "4920",
    "name": "Final Project Design Studio",
    "description": "This design studio is the second required course of the two-semester, 5th-year Final Project course sequence in the undergraduate program. The Final Project Design Studio provides a forum for the design and development of a comprehensive architectural proposal pertinent to the Final Project course sequence. This course is required of all fifth-year architecture undergraduates in the B.Arch. program. This is a communication-intensive course."
  },
  "ARCH-4940": {
    "subj": "ARCH",
    "crse": "4940",
    "name": "Advanced Individual Projects in Architecture and Environmental Design",
    "description": "Individual projects and readings adapted to the needs of individual students at the advanced level.Credit Hours: 1 to 6"
  },
  "ARCH-4960": {
    "subj": "ARCH",
    "crse": "4960",
    "name": "Special Topics in Architecture and Environmental Design",
    "description": "Experimental courses tried out in one or two terms as the general program requires.Credit Hours: 1 to 4"
  },
  "ARCH-5100": {
    "subj": "ARCH",
    "crse": "5100",
    "name": "History, Theory, Criticism 1",
    "description": "This course will examine the spectrum of architectural phenomena and ideas without a specific chronology using examples ranging from antiquity to the contemporary world in western and non-western civilizations and produced in both vernacular and disciplinary cultures. An essential part of this course is to stimulate students' curiosity about architecture and the larger world and introduce them to key issues of architecture regarding space, form, critique, technology, aesthetics, societal and cultural contexts, etc. Particular emphasis will be given to the emergence of modernism in architecture. Crucial to the goals of this course is to encourage students to pursue and develop their own unique vision and voice in architecture throughout their education and practice. Fundamental to this process is making students aware of the necessity to challenge their own subjectivities, biases, and presuppositions."
  },
  "ARCH-5110": {
    "subj": "ARCH",
    "crse": "5110",
    "name": "History, Theory, Criticism 2",
    "description": "This course addresses the history of architectural and related developments in selected Western and non-Western civilizations in order to construct a conceptual and strategic understanding of the relationships between architecture, culture, civilization, technology, and thought. In doing so, it will focus on key constructed spatial phenomena of the pre-modern world and, where relevant, elucidate the connection of these works of architecture and their motivating ideals to those of the modern and contemporary world."
  },
  "ARCH-5140": {
    "subj": "ARCH",
    "crse": "5140",
    "name": "Structures 1",
    "description": "Introduction to Structures introduces the student of Architecture to the principles of structural mechanics and their application to basic architectural structures comprised primarily of wood. The fundamentals of statics are presented in order to gain an understanding of the way in which external forces produce internal stresses in individual members and, in essence, flow through the building system to be resolved at the foundation level. The principles of strength of materials are studied to understand how particular structural materials and configurations manage to resist these forces without unacceptable distortions, or even failure. Wood structural properties are studied in all their complexity as a means to internalize the more theoretical topics broached. Through in-class presentations, reading, homework and project work, computer lab, field trips, and case studies, the student will be aided in developing this intuitive (while practical) understanding. It is recognized that intuitions of building technologies are not acquired quickly but result from much study, observation, and practice. Introduction to Structures makes use of the several approaches above to ensure that the beginning student is provided with a broad, solid base for future structural investigations. WebCT will be used to expand the student's access to course materials and allow for a measure of distance learning. Sustainability: the following notions are introduced as important attributes of sustainable structures and construction: durability and service life and life cycle cost. This course is required of all architecture graduate students in the M.Arch. program."
  },
  "ARCH-5150": {
    "subj": "ARCH",
    "crse": "5150",
    "name": "Structures 2",
    "description": "This is an intermediate course to structures that presents the load transfers of gravity and lateral forces in building systems. The course demonstrates the principles of analyses and design of steel and reinforced concrete elements. The course also outlines the concepts of compression and/or tension structures. Structural principles are reinforced by building physical models."
  },
  "ARCH-5160": {
    "subj": "ARCH",
    "crse": "5160",
    "name": "Digital Constructs 1",
    "description": "This course focuses upon contemporary means of producing and communicating architectural ideas. Students will use digital methodologies through all phases of a project as well as advanced representation and digital fabrication techniques. The use of digital modeling as a sketch and iterative tool will be emphasized. Tools taught in Digital Constructs 1 will support softwares taught in Digital Constructs 2. This course is required of all first-year architecture graduate students in the M.Arch. program. Coordination of the relationship of course content to Graduate Architecture Design 1 will be between the Digital Constructs 1 faculty instructor and the architectural design studio coordinator and faculty."
  },
  "ARCH-5170": {
    "subj": "ARCH",
    "crse": "5170",
    "name": "Digital Constructs 2",
    "description": "Building on techniques taught in Digital Constructs 1, this course will expand upon the role of technology in architecture by introducing advanced methods of design analysis and resolution. Students will learn to address issues of optimization, environmental surroundings, structure, and site by using various contemporary analytic softwares. This course is required of all second-year architecture graduate students in the M.Arch. program. Coordination of the relationship of course content to Graduate Architecture Design 2 will be between the Digital Constructs 2 faculty instructor and the studio coordinator and faculty."
  },
  "ARCH-5200": {
    "subj": "ARCH",
    "crse": "5200",
    "name": "Graduate Architecture Design 1",
    "description": "This studio focuses on the relationship between building and landscape in terms of conceptual, pragmatic, ideological, aesthetic, and functional issues. As such, it endeavors to examine critically the disciplinary boundary between building and landscape. It also critically assesses the connections and inherent complexities between an institutional situation, workplace activity, and residential inhabitation in order to explore questions of publicness and privacy. This studio also addresses the tectonic dimensions of construction and structure in architectural design."
  },
  "ARCH-5210": {
    "subj": "ARCH",
    "crse": "5210",
    "name": "Graduate Architecture Design 2",
    "description": "This design studio builds on prior studios emphasizing projects of greater scale and complexity. Typically, the studio designs large-scale housing developments but other projects of similar complexity may be used. The studio requires the analysis and critique of precedent and the writing of an architectural program."
  },
  "ARCH-5300": {
    "subj": "ARCH",
    "crse": "5300",
    "name": "Materials and Construction Systems",
    "description": "This course centers on the development of a technical knowledge of, sensibility to, and intuition for the process by which an architectural design is realized in built form. The interdependence among building materials, acoustic qualities, enclosure systems, interior, finish, and other systems is investigated, with an emphasis on the broader architectural design endeavor. Drawing as a means of understanding forms the basis for a semester-long project to be done in small groups. Case studies will center on concepts and systems that have not yet found their way into mainstream practice. The course approach will involve in-class presentations, project work, field trips and case studies. WebCT will be used to expand the student's access to course materials and allow for a measure of distance learning. Sustainability: the notion that design intentions can be nullified through incorrect construction is stressed. The importance of proper detailing, construction, and maintenance to accomplish lasting and efficient enclosures is highlighted. Skills to diagnose and treat incorrect construction are developed."
  },
  "ARCH-5310": {
    "subj": "ARCH",
    "crse": "5310",
    "name": "Environmental and Ecological Systems",
    "description": "An exploration of the fundamental principles of human physiology, thermal and luminous comfort, and indoor quality. Emphasis is on bioclimatic and psychrometric climate analysis and its relationship to architectural design, understanding the energy exchange between body in space, the natural meaning of enclosures, and nonstructural materials and systems. The focus is on passive heating, cooling, and daylighting systems and their design. Exercises include vital sign analysis of existing spaces (thermal, air, luminous), forming hypotheses of building performance, using scientific instrumentation, tenant survey techniques, and physical modeling and simulation techniques related to daylighting and shading techniques. This course is required of all architecture graduate students in the M.Arch. program."
  },
  "ARCH-5330": {
    "subj": "ARCH",
    "crse": "5330",
    "name": "Entrepreneurship and Architecture",
    "description": "This course addresses the range of economic issues related to the practice of architecture. Topics will include economic cycles and building construction, globalization of architectural practice, case studies of models of practice, setting and negotiation of fees for services, economic relationships of architects and consultants, cost estimation."
  },
  "ARCH-5340": {
    "subj": "ARCH",
    "crse": "5340",
    "name": "Materials and Enclosures",
    "description": "In a world of rapid technological change, this course aims to equip future architects with the ability to position, understand, and implement new materials and systems in meaningful ways. The working principles of selected advanced materials and systems are explained and issues of material development, applications, and integration into buildings systems are addressed. Emphasis is also placed on understanding the issues involved when combining and installing new materials or systems into buildings. Students are further introduced to detail development. Sustainability: new materials and systems are explored with the objective of formulating meaningful technological response to critical environmental and societal issues such as resource depletion, environmental degradation, and globalization. This is required of all architecture graduate students in the M.Arch. program."
  },
  "ARCH-5360": {
    "subj": "ARCH",
    "crse": "5360",
    "name": "Building Systems and the Environment",
    "description": "Design analysis and performance characteristics of building environmental systems, emphasizing heating, cooling, ventilation, and lighting systems. In addition, building electrical systems, acoustics, water, waste, and drainage systems are covered in terms of fundamental theory, designs, and calculations. Case studies, field trips, and system design project work are required. This course is required of all architecture graduate students in the M.Arch. program."
  },
  "ARCH-5380": {
    "subj": "ARCH",
    "crse": "5380",
    "name": "Professional Practice 1",
    "description": "This course covers topics that are essential to developing an effective professional architectural practice. The course will address professional obligations and ethics, contracts, registration, office organization, and management. The course will emphasize effective communication, negotiating, public speaking, and team development. This course is required of all architecture graduate students in the M.Arch. program."
  },
  "ARCH-5390": {
    "subj": "ARCH",
    "crse": "5390",
    "name": "Professional Practice 2",
    "description": "This course covers topics that are essential to developing an effective professional architectural practice. The course will address professional obligations and ethics, contracts, registration, office organization, and management. The course will emphasize effective communication, negotiating, public speaking, and team development. This course is required of all architecture graduate students in the M.Arch. program."
  },
  "ARCH-6310": {
    "subj": "ARCH",
    "crse": "6310",
    "name": "Environmental History and Theory",
    "description": "This course has been conceived together with Material Systems and Productions and the Design Research Studio, such that each student will develop a complementary written analysis that critically situates the new material system that the student is developing in design studio within historical, socio-political, and economic flows. The written analysis will directly reference key themes contained within the required readings, lectures, and seminar discussions. Course taught in New York City."
  },
  "ARCH-6320": {
    "subj": "ARCH",
    "crse": "6320",
    "name": "Built Ecologies 1",
    "description": "Advanced graduate level course focusing on the collection, analysis, and application of data for the generation of criteria within the design process. Multiple scales will be investigated, from the material and product scale, to the building/architectural scale, and finally to the urban, regional, and global scales. Course taught in New York City."
  },
  "ARCH-6330": {
    "subj": "ARCH",
    "crse": "6330",
    "name": "Built Ecologies 2",
    "description": "In this seminar, students develop and analyze an ecologically sensitive built system related to their thesis topic with particular attention to the architectural, social, and political implications of the work and their inter-relationships. An awareness of the political and economic forces that are instrumental in the development of contemporary built ecologies creates opportunities for innovation in the cultures of making. Course taught in New York City."
  },
  "ARCH-6340": {
    "subj": "ARCH",
    "crse": "6340",
    "name": "Material Systems and Productions",
    "description": "The goal of Material Systems and Production is threefold: to develop a fundamental understanding of materials through first principles, material classification, material production, and material impacts, to develop material models based on material properties and tests, and to develop criteria to make reasoned choices for the implementation of materials in the built environment. Students will engage in directed research projects through the lens of material with the intent of opportunistically identifying intrinsic material properties, exploiting production forming logics, and developing a prototype detail assembly for testing. B.Arch. students can only register for the 4000 level of this course and M.Arch. students must register only for the 6000 level of this course."
  },
  "ARCH-6350": {
    "subj": "ARCH",
    "crse": "6350",
    "name": "Design Research Studio",
    "description": "This initial studio segment will explore variable phases of data collection, processing, and synthesis through explorative visualization methods. These methods will bear the complexity of mapping dynamic forces present in nature juxtaposed to cultural and economical factors. Course taught in New York City."
  },
  "ARCH-6360": {
    "subj": "ARCH",
    "crse": "6360",
    "name": "Interdisciplinary Research Studio",
    "description": "The studio addresses interdisciplinary exchange within research practice, understanding that buildings operate within complex dynamic systems. Buildings and their material systems are composed of interdependent systemic relationships at multiple scales – 'Built Ecologies' – operating as metabolic systems within and upon existent natural and made systems. Design is a method of research, discovering and developing new systems and strategies transferable to many sites. Course taught in New York City."
  },
  "ARCH-6380": {
    "subj": "ARCH",
    "crse": "6380",
    "name": "Graduate Environmental Parametrics",
    "description": "Environmental Parametrics is an intensive introductory course on visual scripting theory and methodology intended to give incoming students a foundational base in computational and parametric design modeling in order to supplement fall semester courses for new and incoming students into the Built Ecologies and Geofutures post professional programs without prior experience. The techniques presented in this course allow designers to integrate environmental data and simulations fluidly into 3D models and the design process. A new and progressively more complex topic is introduced each week, and each topic is presented with an associated design exercise. This course is taught in a seminar format with some instructor led tutorials and workshop content linked to dedicated breakout time for completing assignments and modeling. A devoted archive folder for downloading and uploading course material and completed exercises will be used for the course. B.Arch. students can only register for the 4000 level of this course and M.Arch. students must register only for the 6000 level of this course."
  },
  "ARCH-6380.80": {
    "subj": "ARCH",
    "crse": "6380.80",
    "name": "Environmental Parametrics",
    "description": "The work of this course sets out to describe the meaning, values, and methods of using parametric techniques as both an analytical tool and a generative device in comprehensive performance-based building design. The students learn techniques to set-up feedback between analysis and tactical response in performance-based design while also situating these techniques within the broader discourse and methodology of fostering design ecologies and creating ecologies of design as they relate to the construction of the built environment and contemporary issues of sustainability. In addition to the practical concerns of environmental parametrics, this course will examine closely the theoretical foundation for environmental parametrics."
  },
  "ARCH-6390": {
    "subj": "ARCH",
    "crse": "6390",
    "name": "Energy and Systems Simulation",
    "description": "Energy and Systems Simulation provides students with an introduction to advanced simulation tools and procedures necessary for analyzing the performance of complex environmental building systems. The course utilizes parametric software for the simulation and analysis of multi-objective optimization workflow procedures. Areas of building performance assessment include thermal and daylight optimization."
  },
  "ARCH-6400": {
    "subj": "ARCH",
    "crse": "6400",
    "name": "Criticism I",
    "description": "Criticism I introduces students to both historical and contemporary forms of discourse as it relates to the disciplines of architecture, landscape architecture, and urbanism. The course serves as an introduction to critical thinking and writing and provides students with the necessary analytical, verbal, and written skill sets to effectively participate in the discursive aspects of the disciplines of architecture, landscape architecture, and urbanism."
  },
  "ARCH-6510": {
    "subj": "ARCH",
    "crse": "6510",
    "name": "Disciplinary Research Methods Seminar",
    "description": "A seminar in research methods. This course will review the major considerations and tasks involved in conducting research in areas appropriate to the architectural sciences. It introduces the essential aspects of designing, supporting, and conducting a research project. Major areas that will be considered include: history and present status of the quantitative and qualitative methods, strengths and weaknesses of each method and approach, location of resources, information and data, sampling or selection of research materials and/or participants, data collection, measurement, data analysis, and research writing and style."
  },
  "ARCH-6520": {
    "subj": "ARCH",
    "crse": "6520",
    "name": "Interdisciplinary Ph.D. Seminar",
    "description": "This is a seminar course restricted to students in their second year of doctoral study. It provides a critical forum for the discussion of issues from methods to sources confronting the students on the dissertation. This course will form the core of the interdisciplinary experience of the Doctor of Philosophy in Architectural Sciences. It supports the position that advanced work in architecture frequently builds on knowledge from several disciplines, and as such provides a model for encouraging cross disciplinary work in the Institute. It will involve a combination of senior faculty and visitors and regular presentation of dissertation work in progress."
  },
  "ARCH-6610": {
    "subj": "ARCH",
    "crse": "6610",
    "name": "Graduate Architecture Design 3",
    "description": "This is a design-based studio that focuses on the integration of structural, technical, detail, zoning, and code-related issues with respect to the design of a moderate to large-scale building of civic importance. Such building types are (but not limited to) libraries, theaters, city halls, judicial buildings, educational buildings, etc. An important focus of the design project will be the relationship of the building to its urban context. An essential part of the design will involve programming of the building as well as responding to numerous learning outcomes defined by the NAAB (the accrediting agency for professional architecture programs) for a comprehensive design project. This course is required of all architecture students in the M.Arch. program."
  },
  "ARCH-6620": {
    "subj": "ARCH",
    "crse": "6620",
    "name": "Graduate Architecture Design 4",
    "description": "This is a technology-based design studio emphasizing the materialization and making of architectural design projects. The integration of building code requirements for fire protection, life safety, accessibility, building environmental systems, structure, construction, and materiality is central to the effective achievement of design intent. Students become aware of how these issues affect and inform design decisions. They learn to integrate technology, systems, and materials in the comprehensive resolution of building design and gain exposure to construction documents and design documentation. Construction and site visits are an integral part of the studio as is an integrated electronic media seminar on CAD applications. Students must coregister for ARCH 5380, Professional Practice 1, a concurrent 2-credit course that introduces codes, the regulatory process, agreements, contract documents, building design cost control, and administration. This course is required of all architecture students in the M.Arch. program."
  },
  "ARCH-6630": {
    "subj": "ARCH",
    "crse": "6630",
    "name": "Graduate Architecture Design 5",
    "description": "This design studio will explore various concerns that relate architecture to environmental and ecological concerns. It will address human intervention at multiple and diverse scales within the natural world in order to understand their social, technical, aesthetic, conceptual, and philosophical implications for architectural design. Throughout the semester, the evolution of student design proposals will coordinate with the environmental and ecological issues that are presented in the supporting courses at CASE that are taken simultaneously with this studio. B.Arch. students can only register for the 4000 level of this course and M.Arch. students must register only for the 6000 level of this course."
  },
  "ARCH-6680": {
    "subj": "ARCH",
    "crse": "6680",
    "name": "History, Theory, Criticism 3",
    "description": "Works of architecture embody knowledge, ideas, and imagination that express formally, spatially, and materially the ways of living and values of the civilizations in which they occur. A select number of modern and contemporary buildings that represent a high degree of sophistication in the way their architects have approached the breadth of design issues both within and external to the programs of those works will be analyzed critically in order to ascertain the significance and relationships of the multiple systems of order inherent to a work of architecture. Reflecting on the knowledge and understandings acquired in all the previous courses in the history, theory, and criticism sequence, this course is a critical inquiry into the principal ideologies and premises of the most substantive architectural practices in the contemporary world. As such, the content of the course must necessarily evolve as the intellectual and cultural parameters of both theory and practice in the contemporary world change. This course is required of all architecture graduate students in the M.Arch. program."
  },
  "ARCH-6750": {
    "subj": "ARCH",
    "crse": "6750",
    "name": "Final Project Design Research Seminar",
    "description": "This seminar is the first required course of the two-semester, 3rd-year Final Project course sequence in the M.Arch program and as such serves as a prerequisite to the spring semester Final Project Design Studio (ARCH 6XXX). The Design Research Seminar provides a forum for readings and discussions as well as design and/or material experimentation as it relates to the respective Graduate Final Project instructor's thematic framework. The seminar also covers fundamentals related to standard methods of research and analysis. This course is required of all architecture graduate students in the M.Arch. program."
  },
  "ARCH-6810": {
    "subj": "ARCH",
    "crse": "6810",
    "name": "Research Design Seminar",
    "description": "The principal objective of this introductory seminar is to provide stude­­­nts with the opportunity to learn the fundamentals of research design. Research design includes: (1) identifying and selecting focused research problems/opportunities/ideas; (2) documenting the state of the art in the selected research area; (3) identifying the critical resources and settings to carry out the research; (4) designing the research program including strategies and tactics for carrying out the research. It is hoped that the knowledge gained in the RD Seminar will assist students in the development of their own individual thesis proposals while they contribute to active research. B.Arch. students can only register for the 4000 level of this course and M.Arch. students must register only for the 6000 level of this course."
  },
  "ARCH-6830": {
    "subj": "ARCH",
    "crse": "6830",
    "name": "Graduate Thesis Seminar: Acoustics",
    "description": "The Graduate Thesis Seminar: Acoustics is designed to provide support to graduate students who are engaged in independent thesis research projects. It is a required course for all graduate students in the Architectural Acoustics programs. This seminar provides a formal opportunity for students and faculty from a range of concentrations to meet together and discuss thesis work in progress."
  },
  "ARCH-6840": {
    "subj": "ARCH",
    "crse": "6840",
    "name": "Engineering Acoustics",
    "description": "Introductory materials of engineering acoustics for students with basic knowledge in mathematics (at least one level of first-year college). Much of the course material is taken from the textbook \"Acoustics for Engineers\" by Blauert and Xiang (2nd Ed.). The course includes mechanic and acoustic oscillations, the wave equations in fluids, governing equations for horns and ducts, spherical sound sources and arrays, piston membranes, diffraction and scattering, dissipation, reflection, refraction and absorption, isolation of air- and structure-borne sounds, noise propagation and noise control. B.S. and B.Arch. students can only register for the 4000 level of this course and M.S.Arch. Acoustics students must register only for the 6000 level of this course."
  },
  "ARCH-6860": {
    "subj": "ARCH",
    "crse": "6860",
    "name": "Applied Psychoacoustics",
    "description": "This course covers the fundamentals of psychoacoustics with a focus on Architectural Acoustics. Topics include the functional overview of the auditory system, loudness, pitch, timbre perception, masking, binaural hearing, auditory scene analysis, multi-modal integration, and auditory perception in rooms. Required signal processing methods will be covered as well. The graduate-level course requires an extensive individual project and more advanced analysis."
  },
  "ARCH-6870": {
    "subj": "ARCH",
    "crse": "6870",
    "name": "Sonics Research Laboratory 1",
    "description": "The Sonics Research Lab is completely research based. The first part (the Fall semester) will be focused on hands-on research tools and techniques. First, students will learn the basics of digital signal processing, develop an understanding of measurement equipment and analysis methods for sound. The course will examine the ISO standards of room-acoustic measurements, develop students' research goals and a specific set of data to gather for their research. The course will also prepare the students with the fundamental knowledge on CATT Acoustic and/or EASE in geometrical modeling. Then the students and professors will visit a number of performance venues (e.g. EMPAC Concert Hall, and/ or other venues) and perform the room-acoustic measurements. Students will then work on analyzing and interpreting the research results. Practice measurements will be scheduled in the gallery or somewhere on campus before trips to performance halls. MATLAB will play a central role throughout all the classes (SRL I &amp; II) and the thesis research projects. It will be used during the class exercises. Within one week from the semester start, every student is required to INSTALL a functioning MATLAB Software package onto her/his laptop computer.\n\nB.S. and B. ARCH, and other school students can only register for the 4000 level of this course and M.S. in ARCS students must register only for the 6000 level of this course."
  },
  "ARCH-6880": {
    "subj": "ARCH",
    "crse": "6880",
    "name": "Sonics Research Laboratory 2",
    "description": "The second semester of the Sonics Research Lab includes advanced acoustical measurement techniques. Another important part of the semester curriculum concerns noise sources, noise control, and vibration measurements. State-of-the-art, commercial software and school research-based software will be used for simulation/analysis/measurement of room acoustics in order to show the students how such technical tools assist in acoustics research and consulting practice for the design of performance and public spaces. The course will also give students a deeper theoretical understanding of architectural acoustics in order to assist them in room acoustics research. There will also be labs to reflect typical measurement procedures and (if time permits) site visits to acoustics research labs and different types of acoustical spaces. The Sonics Research Lab II emphasizes more training on independent hands-on and problem-solving skills (than the SRL I).  \n\nB.S. and B.Arch., and other school students can only register for the 4000 level of this course and M.S.Arch. students must register only for the 6000 level of this course."
  }
}