{
  "/alan-desrochers": {
    "name": "Alan Desrochers",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/AlanDesrocher.jpg",
    "title": "Professor Emeritus, Electrical, Computer, and Systems Engineering",
    "website": "http://www.eng.rpi.edu"
  },
  "/alec-walker": {
    "name": "Alec Walker",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "School of Architecture"
  },
  "/alex-patterson": {
    "biography": "Alex Patterson is a Lecturer in the Department of Electrical, Computer, and Systems Engineering at Rensselaer Polytechnic Institute. Before joining Rensselaer, he worked at Osram Opto Semiconductors in Regensburg, Germany, where he implemented advanced methodologies for electrical, thermo-electrical, and optical modeling of LEDs and developed simulation tools. His academic research interests focus on bridging the gap between theory and experiment in the realm of nanoelectronic and photonic devices via developing new models and employing them as tools to better understand device behavior. He was the recipient of the National Science Foundation's Graduate Research Fellowship and the 2013 IVNC Shoulders-Gray-Spindt Award for Best Student or Postdoc Paper.",
    "education": "Ph.D., Electrical Engineering, Massachusetts Institute of Technology, 2018 M.S., Electrical Engineering, Massachusetts Institute of Technology, 2013 B.S., Electrical Engineering, University of Pittsburgh, 2011",
    "name": "Alex Patterson",
    "office": "JEC 6020",
    "orcid": "0000-0001-5823-2670",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-08/Patterson%20Headshot%20Square%203.jpg",
    "primary-area": "Modeling and Simulation of Nanoelectronic and Photonic Devices, Multiphysics Modeling",
    "title": "Lecturer, Electrical, Computer, and Systems Engineering"
  },
  "/alexander-hiland": {
    "biography": "Alexander Hiland Ph.D is a Senior Lecturer in Communication & Media. After earning his doctorate from the University of Minnesota in 2017 he served as the Assistant Director of Debate at James Madison University and the Director of Forensics (speech and debate) at Texas Tech University. Dr. Hiland comes to RPI with 14 years of experience coaching students in competitive public speaking events and 11 years of teaching at the collegiate level. In the 2022-2023 Academic Year Dr. Hiland will be teaching Public Speaking and Communication Theory & Practice. Previously he has taught courses such as Argumentation & Debate, Communication in Social Movements, American Political Culture & Communication, Introduction to Research Methods, Freedom of Speech, and Communicating Terrorism. He has also worked extensively in preparing students and political candidates for public speaking events. Dr. Hiland also maintains an active research program at the intersection of rhetoric, politics, and speech pedagogy. His most prominent work is his 2019 book \"Presidential Power, Rhetoric, and the Terror Wars: The sovereign Presidency,\" which analyzes how Presidents George W. Bush and Barack Obama used presidential powers to pursue the War on Terror. He has also written on originalism and how it will likely influence Supreme Court decisions, especially on First Amendment issues. His writing has appeared in the William & Mary Bill of Rights Law Review. He has also published and presented on various approaches to debate as a pedagogical tool, especially in the post-secondary school setting. Currently he is continuing his research on originalism with his co-author Michael Smith focusing on how an originalist approach would change contemporary understandings of defamation law. He has recently begun data collection for a project about political podcasts and will be presenting a paper focusing on rhetoric about the war in Ukraine at the National Communication Association conference in November, 2022. He is also working on a manuscript that revisits Kennedy’s Inaugural Address as a foundational statement on U.S. foreign policy.",
    "name": "Alexander Hiland",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-08/Headshot_0.jpg",
    "title": "Sr. Lecturer, School of Humanities, Arts and  Social Sciences (HASS)"
  },
  "/amir-hirsa": {
    "biography": "Rensselaer Polytechnic Institute; 2005 - present Professor of Mechanical and Aerospace Engineering; 1996 - 2005 Associate Professor; 1990 - 1996 Assistant Professor, also, Associate Head for Graduate Studies (2007 – present) Rensselaer Polytechnic Institute; 2003 - 2009 Joint Appointment (by courtesy) Howard P. Isermann Department of Chemical and Biological Engineering University of California in Santa Barbara, Department of Chemical Engineering; 1/'07 - present Visiting Professor Cornell University, School of Chemical Engineering 1/'00 - 12/'00 Visiting Associate Professor Naval Surface Warfare Center (Formerly David Taylor Research Center), Hydrodynamics Division, Code 1542, Bethesda, Maryland. 5/'92 - 8/'92 Faculty Research Fellow Editorial board member, Proceedings of The Royal Society (London) A: Mathematical, Physical & Engineering Sciences (Proc. R. Soc. A)",
    "education": "Ph.D. University of Michigan 1990 Aerospace Engineering M.S.E. University of Michigan 1986 Aerospace Engineering B.S. San Jose State University 1983, Aeronautics Professional Experience Rensselaer Polytechnic Institute; 2005 present Professor of Mechanical and Aerospace Engineering; 1996 - 2005 Associate Professor; 1990 - 1996 Assistant Professor; and Associate Head for Graduate Studies (2007 - 2009) Rensselaer Polytechnic Institute; 2003 - present Joint Appointment (by courtesy) Howard P. Isermann Department of Chemical and Biological Engineering University of California in Santa Barbara, Department of Chemical Engineering; 1/2007 - 8/2007 Visiting Professor Cornell University, School of Chemical Engineering; 1/2000 - 12/2000 Visiting Associate Professor Professional Societies American Physical Society (Division of Fluid Dynamics) Member (1988 - Present) Miscellaneous Holder, FAA-issued \"Airframe and Power Plant Mechanic Certificate\"",
    "name": "Amir Hirsa",
    "office": "5036 Jonsson Engineering Center",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/hirsa_amir_web_0.jpg",
    "primary-area": "Fluid Dynamics at Interfaces, Surface Tension Phenomena, Proteins at Liquid Surfaces",
    "research": "Fluid mechanics and interfacial phenomena. Current research interests are in the area of interfacial hydrodynamics, including monolayer hydrodynamics (such as measurements and modeling of intrinsic interfacial viscosities for lung surfactant applications), and other surface tension effects such as capillarity (e.g. capillary instability and its applications to liquid lenses). Our work in the area of bio-fluids also includes studies of protein structure in the presence of flow, especially at the air/water interface. We have made advances to experimental techniques including particle image velocimetry, nonlinear optical technique of second-harmonic generation, as well as Brewster angle microscopy for flowing systems. We also work in the area of microfluidics, especially in relation to free surface effects. Our research has received funding from the Office of Naval Research (ONR), Defense Advanced Research Projects Agency (DARPA), National Science Foundation (NSF), and National Aeronautics and Space Administration (NASA). Patents: Hirsa, A.H. and Lopez, C.A., Pinned-Contact Oscillating Liquid Lens and Imaging System, United States Patent No. US 8,148,706 B2 (issued April 3, 2012) Hirsa, A.H., Malouin, B.A., Vogel, M.J., Cheng, L., and Olles, J.D., Pinned-Contact, Oscillating Liquid-Liquid Lens and Imaging system, US and International Patent Application No. PCT/US11/45346, filed July 26, 2011 (pending) Hirsa A.H., Malouin, B.A., and Vogel, M.J., Reconfigurable, Non-Oscillating Liquid Lens and Imaging System, US and International Patent Application No. PCT/US11/45353, filed July 26, 2011 (pending)",
    "title": "Professor, Mechanical, Aerospace and Nuclear Engineering",
    "website": "http://www.rpi.edu/~hirsaa/"
  },
  "/andrew-fitzgerald": {
    "biography": "Andy Fitzgerald is an Assistant Professor of Communication & Media at Rensselaer Polytechnic Institute. His research and teaching expertise include critical communication and cultural studies, technology and audience studies, media theory, and global media ethics. Fitzgerald is currently starting a lab at RPI to use the \"Screenomics\" screen-capture research framework that collects screenshots of participants devices every few seconds for longitudinal studies to conduct critical digital audience and mobile user studies. He is interested in connecting with potential collaborators, and is also interested in advising doctoral students in the areas of digital politics and media ethics, and critical audience/user studies. Fitzgerald received his Ph.D. in Communication from Stanford University in June of 2022. His dissertation, \"Mediatizing Terrorism: A Study of Audiences' Construction of Violent Events under Datafied Capitalism,\" explored the circulation and public reception of accounts of a series of Daesh terrorist attacks in Europe during the spring of 2017 as observed in Screenomics participants' platform and mobile ecosystems. Fitzgerald's academic research has been published in peer-reviewed journals including Communication Theory, Journal of Media Ethics, Journal of Communication Inquiry, and Human-Computer Interaction, and presented at conferences including the International Communication Association (ICA), Society for the Social Studies of Science (4S), and the Association of Internet Researchers (AoIR). Four of my papers have received student paper awards from the Philosophy, Theory & Critique division of ICA (PTC) in 2016, 2017, 2020 and 2021. My 2020 paper, “The Eclipse of Ideology: Nonconscious Cognition, Neurodiversity, and Datafied Media Systems as Tools for ‘Self-Regulation,’” was awarded Top Student Paper. He has served as a reviewer for top journals including New Media & Society, Communication Theory, and Television & New Media, and was also elected and served as the Student and Early Career Representative for PTC from 2019-2021.",
    "education": "B.A. in Politics, Bates College Ph.D. in Communication, Stanford University",
    "name": "Andrew Fitzgerald",
    "office": "Sage 5410",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-10/fitzga2%40rpi.edu_Andrew_Fitzgerald_Square%20copy.jpg",
    "primary-area": "Critical Cultural Studies, Media Ethics, Digital Political Economy, Media Theory",
    "research": "I am currently focused on a book manuscript and journal articles drawing on my dissertation research, and starting up a lab at RPI conducting critical audience and user studies utilizing a data collection framework called Screenomics that collects screenshots from consenting participants’ devices every few seconds for longitudinal studies. The lab will explore how the interweaving of data-driven social media platforms and mobile devices across categories of life and social action shapes users’ construction of their digital lives and realities, and our broader political climate in turn. Immediate research areas include mediatized violence, particularly terrorism, and its circulation and reception in platform-centric mobile media environments, and far-right authoritarian subjectivization and conspiratorial discourses. Potential research avenues for students and future collaborators could include these areas as well as platform politics and governance, global comparative studies of mobile user cultures and mediatized violence and event construction. My dissertation, Mediatizing Terrorism: A Study of Audiences' Construction of Violent Events Under Datafied Capitalism, studied the circulation of transnational mobile media accounts of terror attacks in order to examine the intersection of violence, liberalism, and authoritarianism as it is transformed in the data-driven political economy of communication. The dissertation’s central question asks: how is mediatized terrorism encountered, made sense of, and responded to by audiences in datafied media systems? To answer, I used screenomics to observe U.S. mobile media users’ responses to a wave of ISIS terror attacks in Europe in the spring of 2017. These responses were captured unobtrusively every five seconds, affording examination of transnationally mediated accounts of terrorist attacks viewed on users’ mobile devices across platforms and contexts using coterminous observation, revealing in fine detail how audiences truly use their mobile devices, platforms, and how they respond to attacks as they unfold. Based on this observation, I identified four mediatized rituals in response to terrorist attacks as they occur: one, a contingent of responses to terrorism in far-right ecosystems, assimilates attacks and unrelated social conflict into an imagined future of what liberal multiculturalism portends, creating the possibility for offline action stoking and reinforcing cycles of violence; the other three micro rituals comprise a limited suite of individualized responses to distant crises that are habituated by the data-driven political economy. My analysis stands in contrast to the dominant critiques of data-driven social media such as the de-ritualization of media and political polarization by highlighting both the persistence of media rituals as well as the distinct threat posed by ritual action in far-right mobile media specifically.​",
    "title": "Assistant Professor, Communication and Media",
    "website": "https://www.a-a-fitzgerald.com/"
  },
  "/andrew-steele": {
    "name": "Andrew Steele",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Adjunct Professor, Earth and Environmental Sciences"
  },
  "/anita-greenfield": {
    "name": "Anita Greenfield",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Communication and Media"
  },
  "/arjun-saxena": {
    "name": "Arjun Saxena",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-11/ArjunSaxena.jpg",
    "title": "Professor Emeritus, Electrical, Computer, and Systems Engineering"
  },
  "/arta-yazdanseta": {
    "name": "Arta Yazdanseta",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Architecture"
  },
  "/arthur-sanderson": {
    "area": "robotics, knowledge-based systems, computer vision",
    "name": "Arthur Sanderson",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/Sanderson_resize.jpg",
    "title": "Professor Emeritus, Electrical, Computer, and Systems Engineering"
  },
  "/ashwani-kapila": {
    "area": "Applied Mathematics: Reactive and multiphase flow, nonlinear waves, perturbation methods, scientific computing, Education: Development of web-based instructional materials",
    "biography": "My research has addressed problems of practical concern arising in the general area of solid and fluid mechanics, especially chemically reactive flows of the kind that occur during combustion and explosion processes. Recent work has focused on the development and analysis, both theoretical and computational, of models that would accurately predict the generation and propagation of detonation waves in high-energy solid explosives. The research is carried out in collaboration with colleagues at Rensselaer and at Los Alamos and Lawrence Livermore national laboratories.",
    "name": "Ashwani Kapila",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/Kapila_crop.jpg",
    "title": "Professor, Mathematical Sciences"
  },
  "/awino-hellen-awino": {
    "name": "Awino Hellen Awino",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "School of Architecture"
  },
  "/b-wayne-bequette": {
    "area": "Deep learning and AI applications in healthcare, Deep learning and AI applications in smart manufacturing, Diabetes technology, Process systems automation and control, Human-in-the-Loop, Safety",
    "biography": "B. Wayne Bequette is a Professor of Chemical and Biological Engineering and the Technology Manager for the Northern Regional Center of the Clean Energy Smart Manufacturing Innovation Institute (CESMII) at Rensselaer Polytechnic Institute. His research efforts are focused on the modeling and control of biomedical and chemical process systems. Professor Bequette is the author of over 100 refereed journal publications and two textbooks published by Prentice Hall – (i) Process Control: Modeling, Design and Simulation (2003), and (ii) Process Dynamics: Modeling, Analysis and Simulation (1998). He serves as Board Secretary for the American Automatic Control Council and is a Trustee of the Computer Aids for Chemical Engineering (CACHE) Corporation. Dr. Bequette is a founding member of the Editorial Board of the Journal of Diabetes Science and Technology, and serves on the Editorial Board of Industrial & Engineering Chemistry Research. He is a Fellow of IEEE, AIChE and the American Institute of Medical and Biological Engineers, and was inducted into the Arkansas Academy of Chemical Engineers. He is an avid bicyclist (commuting to campus in upstate NY throughout the entire year) and pole-vaulter (Master’s level competition refers more to age than skill level).",
    "education": "1980 B.S. Ch.E. University of Arkansas, Fayetteville 1985 M.S.E. University of Texas, Austin 1986 Ph.D. University of Texas, Austin",
    "linkedin": "https://www.linkedin.com/in/b-wayne-bequette-122ab816/",
    "name": "B Wayne Bequette",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2023-02/Bequette-Wayne.png",
    "title": "Professor and Technology Manager, CESMII Northern Regional Manufacturing Center, Chemical and Biological Engineering",
    "website": "http://www.rpi.edu/~bequeb"
  },
  "/belmiro-galo-da-silva": {
    "biography": "Dr. Galo earned his PhD from University of Rochester and from University of São Paulo in August 2021. His research interests include Harmonic Analysis, Geometric Measure Theory and Analytic Combinatorics. His favorite subject is \"Falconer-type problems\". The Falconer distance problems ask how large does the Hausdorff dimension of a compact set need to be to ensure the Lebesgue measure of the distance set. Dr. Galo is committed to being an effective, engaging teacher. He held teaching appointments at Colgate University (2021-2022) and University of Rochester (2018-2021). He earned an Outstanding Graduate Teaching Award in March 2020 from University of Rochester.",
    "education": "Ph.D., Mathematics, University of Rochester, 2021. Ph.D., Mathematics, University of São Paulo, 2021. M.S., Mathematics, University of Rochester, 2019. M.S., Mathematics, University of São Paulo, 2014. B.S., Mathematics, Federal University of Bahia, 2008.",
    "linkedin": "https://www.linkedin.com/in/belmiro-galo-da-silva-8b7132180/",
    "name": "Belmiro Galo da Silva",
    "office": "404 Amos Eaton Hall, 110 8th St, Troy, NY 12180",
    "office-hours": "Office Hours Wednesday afternoons",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2023-02/Screen%20Shot%202023-02-15%20at%2011.33.24%20AM.png",
    "teaching": "Rensselaer Polytechnic Institute. Fall 2022 MATH 1010 - Calculus I- 113 Students. MATH 1010 - Calculus I- 116 Students. MATH 1010 - Calculus I- 113 Students. MATH 6950 - Grad. Students Seminar- 9 Students.",
    "title": "Lecturer, Mathematical Sciences",
    "website": "https://belmirogalo.com"
  },
  "/bimal-malaviya": {
    "area": "Fission and Fusion Reactor Physics and Technology, Biomedical Applications, Radioactive Waste Management, Pedagogic Technology",
    "name": "Bimal Malaviya",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/malaviya_bimal_web.jpg",
    "title": "Professor, Mechanical, Aerospace and Nuclear Engineering"
  },
  "/brett-orzechowski": {
    "biography": "Brett Orzechowski began the undergraduate and MBA entrepreneurship programs at Utica University and co-founded the Media Innovation Collaborative at Quinnipiac University, which fostered the creation of interdisciplinary early-stage companies. He is also the founder of Seven Point Labs, a data-focused company that explores the commercialization of intellectual property that emphasizes human-centered product or service design. His experience with the ideation process and the cultivation of strategic partnerships has paved the way for new founders and entrepreneurs over the last decade. Prof. Orzechowski focuses his professional and scholarly efforts on the entrepreneurial business climate in upstate New York.",
    "education": "Orzechowski earned his Master’s Degree in Organizational Leadership from Quinnipiac University in 2012, and a second Master’s Degree in Data Science from Utica University in 2021.",
    "linkedin": "https://www.linkedin.com/in/brettorzechowski/",
    "name": "Brett Orzechowski",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-03/Orzechowski_Two_0.jpg",
    "primary-area": "Entrepreneurship",
    "title": "Lecturer, Program Coordinator for the MBA in Life Sciences Entrepreneurship, Lally School of Management"
  },
  "/brian-bayly": {
    "name": "Brian Bayly",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Earth and Environmental Sciences"
  },
  "/brian-pertl": {
    "name": "Brian Pertl",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Summer Programs"
  },
  "/brian-tolle": {
    "name": "Brian Tolle",
    "office": "Sage 5207",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-09/tolle_portrait_0.jpg",
    "title": "Sr. Lecturer, Science and Technology Studies",
    "website": "http://www.briantollestudio.com"
  },
  "/bruce-piper": {
    "area": "Mathematics Education, Computer Aided Geometric Design, Approximation Theory",
    "biography": "Developing courses that teach applications of basic data analysis techniques such as data visualization, classification, clustering, and ridge regression to undergraduate math majors is one of the primary efforts. By using a case study approach, students are immediately immersed into understanding high-dimensional data and provided with a fundamental toolkit with which they can analyze data throughout their careers. Another effort is to contribute to the retention of STEM majors by enabling upper class students to act as mentors for first year students in Calculus courses. This provides leadership experience for the mentors and guidance for the Freshman on how to succeed in STEM. Shape preserving interpolation is an area of interest in Computer Aided Geometric Design and Approximation Theory. Specific problems of interest include the preservation of monotonic curvature and the reated problems of preserving 3-convexity and finding novel representations of surfaces for the task of convexity preserving surface interpolation.",
    "name": "Bruce Piper",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/Piper_crop.jpg",
    "title": "Associate Department Head, Mathematical Sciences",
    "website": "http://www.rpi.edu/~piperb/"
  },
  "/caleb-white": {
    "biography": "Caleb White is a Lecturer in the Rensselaer Polytechnic Institute School of Architecture. He has also taught at the Weitzman School at the University of Pennsylvania in both the Masters of Science Advanced Architectural Design Program and the Masters of Architecture Program. He received his Masters of Architecture from the Weitzman School at the University of Pennsylvania and a Bachelors in Environmental Design from the University of Colorado. He currently teaches a variety of courses ranging from First year design studios to digital modeling techniques and representation. His research includes emerging machine learning technology applied to architectural design and its impacts on aesthetics.",
    "education": "M.ARCH University of Pennsylvania 2016 B.ENVD University of Colorado 2012",
    "linkedin": "https://www.linkedin.com/in/caleb-white-1b013093/",
    "name": "Caleb White",
    "office-hours": "Office Hours Thursday 12:00PM - 2:00PM (By Appointment) Greene Building Room 400",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-09/Passport%20Photo_Caleb%20White%20BW.jpg",
    "title": "Lecturer, Architecture",
    "website": "https://www.instagram.com/calebw.white/"
  },
  "/caren-canier-0": {
    "biography": "Caren Canier is a native of New York City. She attended Cornell University, graduating with a BFA in Painting, and earned her MFA in Painting at Boston University. She studied with Philip Guston and James Weeks at BU and Gillian Pederson-Krag at Cornell. In 1977, she was awarded the Rome Prize Fellowship and spent a year at the American Academy in Rome. Since then she has divided her time between Umbria and upstate New York, where she is Professor of Art Emeritus at Rensselaer Polytechnic Institute in Troy. Canier’s work was represented by the Robert Schoelkopf Gallery in New York City, where she had two solo shows, until its closing in 1991. Since that time, she has exhibited frequently in New York, New England and Italy. Recent comprehensive shows include two solo exhibitions at the Painting Center in New York City and a two-person exhibition at the Sale Espositive Comunale of the Comune di Gubbio in Italy. In addition to the Rome Prize Fellowship, she is the recipient of many awards, including a New York State CAPS grant, two Artists’ Fellowships from the New York Foundation for the Arts, and grants from the Ingram Merrill Foundation and the Pollock-Krasner Foundation. In 2002, she received the Distinguished Alumni Award of Boston University College for the Arts.",
    "name": "Caren Canier",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2023-02/Canier.JPG",
    "title": "Professor Emeritus, Arts",
    "website": "http://carencanier.com"
  },
  "/carl-mcdaniel": {
    "name": "Carl McDaniel",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Biological Sciences"
  },
  "/carolin-hofmann": {
    "area": "Melville, affect, trauma, violence, sentiment and sensation, ecocriticism",
    "biography": "Carolin Alice Hofmann hofmac@rpi.edu Ph.D. in English, University at Albany, SUNY M.A. in American Studies, Comparative Literature (minor), Media Studies (minor), Leipzig University",
    "name": "Carolin Hofmann",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "primary-area": "19th-century American literature",
    "title": "Lecturer, Communication and Media"
  },
  "/cassandra-sammartano": {
    "name": "Cassandra Sammartano",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Adjunct, GSAS"
  },
  "/chan-chung": {
    "area": "Polymer processing, melt rheology and processing aids, Multi-phase polymers and blends, Polymer waste recycling, Binder-assisted injection molding of metal and ceramic powders",
    "biography": "ACADEMIC EXPERIENCE Seoul National University \tSchool of Chemical & Biological Engineering Invited Professor 2005 Rensselaer Polytechnic Institute (RPI) 1973 - 2004 Joint appointment to Materials Science & Engineering Department, and Chemical & Biological Engineering Department Professor Emeritus Jan. 1, 2005 - Present Professor Emeritus and Research Professor Jan. 1, 2000 - Dec. 2004 Professor July 1, 1979 - Dec. 31, 1999 Permanent Tenure July 1, 1977 Associate Professor July 1, 1975 Assistant Professor Jan. 22, 1973 Director of Advanced Manufacturing Laboratories I and II 1986-1992 Director of Polymer Science & Engineering Program 1984-1987 Chan I. Chung taught mainly polymer courses at RPI: Polymer Physics, and Polymer Engineering. He also taught a continuing education course on Polymer Extrusion and Melt Rheology from 1973 to 1989, attended by many industrial engineers from all over the world. His research has been focused on the development of an analytical melting model for single-screw extrusion through experimental and theoretical studies. He also contributed to the understanding of the structure-property relationship of block copolymers in their molten state as related to processing. His other contributions include the concept of using a solid solvent as a processing aid, HDPE/LDPE blend for solid state deformation processing, compatibilizers for recycling municipal plastics waste as commingled blends, and using a solid polymer solution as a binder for binder‑assisted injection molding of metallic and ceramic powders.",
    "name": "Chan Chung",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/chan%2520i%2520chung.jpg",
    "title": "Professor Emeritus, Materials Science and Engineering"
  },
  "/cheng-kent-hsu": {
    "biography": "Dr. Cheng Hsu is Professor of Industrial and Systems Engineering and Professor of Information Technology, Rensselaer Polytechnic Institute, Troy, NY12180-3590. He earned a Ph.D. degree from the Ohio State University in Management Sciences (with a minor in Computer Science), MS in Industrial and Systems Engineering from Ohio State University, and BS in Industrial Engineering from Tunghai University, Taiwan. He served on Rensselaer's Faculty Council, Faculty Senate, and various other academic committees at the school and institute levels (e.g., the Institute-wide BS-IT and MS-IT curricula committees). He has been a keynote speaker to a number of international meetings in Taiwan, Hong Kong, Thailand, Italy, and Canada, as well as in the US. Dr. Hsu is currently engaging in research on service science, with a focus on service design and system design. He developed a thoery of Digital Connections Scaling to help explain the dynamics of new service in the connected world. The theory recognizes population-wide connected value cocreation among persons and organizations as a transforming mode of production for Knowledge Economy, and thereby analyzes new busness designs and service system design laws. A new model accompanies the theory: Hyper-Networks, which engages the emerging network science to provide insights into the analytic nature of connected value cocreation. New system design methods aim at helping scale IS up to the populations of customers, providers, and resources; down to individual users; and transformational to cross-sectional collaboration. The theory is also suported by such results as instrumentation of the environments (using, e.g., RFID systems, wireless sensor networks), Cyber-Infrastructure-Assisted Enterprises, and the market approach to open and scalable information exchange. He is a believer of person-centered models on the Internet. In addition to the above original work on serfvice science, Dr. Hsu is also devoted to studying sustainability design for products and production systems, and alternative energy system design for micro grids at the community level. The originator of the Metadatabase and Two-Stage Entity-Relationship Models, Dr. Hsu's work have contributed to much of the research on these topics as reported in this Web site, Enterprise Integration and Modeling. He has been a principal investigator of Rensselaer's Computer-Integrated Manufacturing and Adaptive Integrated Manufacturing programs, and a number of other government- and industry-sponsored projects. The sponsors include companies such as Alcoa, Digital, GE, GM, IBM, and Samsung Electronics, and government sources such as the U.S. National Science Foundation, Army Research, New York State, and NATO. Dr. Hsu teaches Multi-disciplinary Capstone Engineering Design, Discrete Systems Simulation, Databases, e-Business engineering, and Information Systems. His publications include a number of books and edited volumes, and over a hundred scholarly papers in a number of archivaljournals and proceedings. He is a member of AIS, IEEE and ASEE. He has served and continue to serve on the editorial board for several journals and organizations, including, e.g., IEEE Transactions on Systems, Man, and Cybernetics.",
    "name": "Cheng (Kent) Hsu",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-10/cheng-480.jpg",
    "title": "Professor Emeritus, Industrial and Systems Engineering",
    "website": "http://viu.eng.rpi.edu/"
  },
  "/chjan-lim": {
    "area": "Network Science, Computations on networks, Applied Stochastics, Vortex Dynamics, Statistical physics and turbulence, Symmetric Dynamical Systems, Combinatorial Matrix Theory",
    "biography": "See homepage http://www.rpi.edu/~limc",
    "name": "Chjan Lim",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/Lim_crop.jpg",
    "title": "Professor, Mathematical Sciences",
    "website": "http://www.rpi.edu/~limc"
  },
  "/christopher-donohue": {
    "name": "Christopher Donohue",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Lally School of Management"
  },
  "/chuck-boylen": {
    "area": "biodefense, biology, fementation, freshwater, microbiology",
    "biography": "As Professor of Biology and Associate Director of the Darrin Fresh Water Institute (DFWI) at Rensselaer Polytechnic Institute (RPI), Dr. Boylen worked in conjunction with the Director all aspects of running the research field station, including funding, research, teaching and administration. Dr. Boylen is internationally known for his New York State limnology research, particularly in the Adirondacks and Lake George. Dr. Boylen’s research has been federally funded by National Science Foundation, Environmental Protection Agency, and the National Institute of Health, as well as state and local agencies. He is the author and co-author of more than 100 articles published in highly ranked academic journals and has supervised more than 40 graduate student theses. Dr. Boylen is actively involved with a number of environmentally focused organizations which include the Hudson River Environmental Society, Fund for Lake George, and the Lake George Watershed Coalition. Since the 1970’s he has maintained an active limnological research program on Lake George and numerous freshwater systems in NY and the Adirondacks. His research results have been applied to community and policy issues relating the impact of human activities on water quality, particularly how watershed practices negatively impact stormwater runoff. Dr. Boylen served as a Co-PI for the Adirondack Effects Assessment Program (EPA funded 1994-2006), and the New York State Invasive Species Advisory Committee, a NYSERDA funded program of which he also serves as a Co-PI.",
    "name": "Chuck Boylen",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/boylen_crop2.jpg",
    "title": "Professor Emeritus, Biological Sciences",
    "website": "http://homepages.rpi.edu/~boylec/"
  },
  "/chun-leung": {
    "name": "Chun Leung",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Physics, Applied Physics & Astronomy"
  },
  "/claire-moriarty": {
    "name": "Claire Moriarty",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "School of Architecture"
  },
  "/conor-lennon": {
    "area": "Economic History Experimental Economics Economics of Education",
    "biography": "I am an empirical micro-economist who leverages experimental and quasi-experimental settings to address policy-relevant research questions in health and labor economics. My up-to-date cv is available at conorjlennon.com/vitae",
    "education": "2016 - Ph.D. Economics, University of Pittsburgh, Pittsburgh, PA 2008 - M.S. Economic Policy, National University of Ireland, Galway, Ireland 2004 - B.S. Economics and Finance, University College Dublin, Ireland",
    "name": "Conor Lennon",
    "office": "SAGE 3402",
    "office-hours": "Office Hours Webex (by appointment, contact me by email to set up a time to meet)",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-10/lennon-500.jpg",
    "primary-area": "Health and Labor Economics",
    "research": "I am an empirical micro-economist who leverages experimental and quasi-experimental settings to address policy-relevant research questions in health and labor economics. I am particularly interested in studying how employer-sponsored health insurance (ESI) affects labor market outcomes. Other areas of interest include the economics of education and economic history, where I examine the effect of the 1944 G.I. Bill on female World War II veterans, how the likelihood of slave escape affected antebellum slave prices, and whether the labor market values online degree programs. A relatively new area of research for me examines how ridesharing (Uber, Lyft, etc.) affects patterns of alcohol consumption and associated risky behavior. In other work, I study how moral concerns shape policy preferences and how they can explain differences between economists’ and non-economists’ views on divisive issues.",
    "teaching": "I have 9 years of teaching experience, including teaching Intro and Intermediate level Microeconomics and Macroeconomics, Money & Banking, American Economic History, Intro to Philosophy, Politics & Economics, and the Economics of Discrimination.",
    "title": "Associate Professor, Economics",
    "website": "http://conorjlennon.com"
  },
  "/cristina-james": {
    "area": "American Literature Literary Theory Popular Culture and Media Studies Facilitating Student Led TEDx events Woman's Studies",
    "biography": "Cristina C. James earned her Bachelor's and Masters' degrees in English Literature at Columbia University and her PhD in English Literature at SUNY Albany. She also earned her Juris Doctor from Pepperdine University School of Law. After teaching, administrating, and designing English curriculum at the secondary school level for a number of years, she returned in 2019 to the undergraduate classroom, teaching for several years as a lecturer in the English department at the State University of New York at Albany. She is a trained TEDx organizer and has curated many student TEDx Talk events. Her academic interests center around the intertextual connections between canonical feminist literature, critical theory, and popular culture- especially music.",
    "education": "PhD in American Literature,State University of New York at Albany M.A. in American Literature, Columbia University B.A. in American Literature Columbia College Juris Doctor Pepperdine University School of Law",
    "name": "Cristina James",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Lecturer, Communication and Media"
  },
  "/curt-breneman": {
    "area": "Cheminformatics, Materials Informatics, Drug Discovery Software, Computational ADME/Tox, Data Analytics",
    "biography": "Curt Breneman was born in Santa Monica, California in 1956, and went on to earn a B.S. in Chemistry at UCLA in 1980 followed by a Ph.D. in Chemistry at UC Santa Barbara (with an emphasis on Physical Organic and Computational Chemistry) in 1987. Following two years of post-doctoral research at Yale University, Dr. Breneman joined the faculty of the Department of Chemistry at Rensselaer Polytechnic Institute (RPI) and began a program in molecular recognition and computational chemistry based on his concept of \"Transferable Atom Equivalents\", or TAEs, as building blocks for describing the electronic and reactive character of molecules. Dr. Breneman currently holds the rank of Full Professor in the RPI Department of Chemistry and Chemical Biology, and is the Director of the NIH RECCR Center. He later served as Head of the Department of Chemistry & Chemical Biology and now as Dean of the School of Science. The Breneman research group primarily specializes in the development of new molecular property descriptors and machine learning methods that can be applied to a diverse set of physical and biochemical problems. Of paramount interest are methods that can increase the information content of molecular descriptors, and machine learning techniques that can exploit this data for the creation of fully validated, predictive property models. Current application areas include pharmaceutical ADME prediction, virtual high-throughput screening of drug candidates, protein chromatography modeling (HIC and ion-exchange), as well as polymer property prediction.",
    "name": "Curt Breneman",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/dean_breneman2.jpg",
    "title": "Dean of the School of Science, Professor and Director, Rensselaer Exploratory Center for Cheminformatics Research (RECCR), School of Science",
    "website": "http://rpi.edu/dept/chem/chem_faculty/profiles/breneman.html"
  },
  "/daeyong-lee": {
    "name": "Daeyong Lee",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Mechanical, Aerospace and Nuclear Engineering"
  },
  "/daniel-berg": {
    "biography": "In 1950 graduated from City College of New York with a B.S. in physics and chemistry. He earned M.S. and P.h. D. degrees in physical chemistry from Yale University in 1951 and 1953 respectively. From 1953-1977, he worked at the Westinghouse Electric Corporation, ultimately as technical director.[2] In 1977, he joined Carnegie Mellon University as dean of the Mellon College of Science. In 1981, he became co-provost. In 1983, he was appointed vice president of academic affairs and provost of Rensselaer Polytechnic Institute. In 1984, he was named acting president on the death of the previous president, George Low, and became president of Rensselaer in 1985. He served as president until 1987,[4] and he stayed on at RPI as the Institute Professor of Science and Technology. His research interests include \"understanding the relationship of technology and the service sector,\" as well as \"management of technological organization, innovation, policy, manufacturing strategy, robotics, policy issues of research and development in the service sector.",
    "name": "Daniel Berg",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-10/berg-480.jpg",
    "primary-area": "management of technological organizations, innovation, policy, robotics, policy issues of research and development in the service sector",
    "title": "Professor Emeritus, Industrial and Systems Engineering"
  },
  "/daniel-stratford": {
    "name": "Daniel Stratford",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "School of Architecture"
  },
  "/darrin-hunt": {
    "biography": "Dr. Darrin Hunt is a freshwater ecologist who researches how biotic communities respond to broad scale anthropogenic stressors. Specifically, he studies how native stream benthic communities are impacted by habitat changes caused by invasive species, and how native faunal responses vary by urbanization and climate type. Dr. Hunt is interested in bridging the gap between science and the public, and has worked extensively with citizen led, bioassessment and management programs throughout the Great Lakes region. Recently, he has taken an interest in the green work force where he has advised non-profit organizations on urban flooding mitigation strategies using green stormwater infrastructure (GSI) installations (rain gardens, bioswales, etc.).",
    "education": "Ph.D. Biological Sciences, Wayne State University, Detroit, MI. 2022.",
    "linkedin": "https://www.linkedin.com/feed/",
    "name": "Darrin Hunt",
    "orcid": "0000-0002-2508-0022",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-10/IMG_0791_0.jpeg",
    "research": "Stream ecology Urban ecology Freshwater biology Invasive species management Green stormwater infrastructure",
    "title": "Lecturer, Biological Sciences"
  },
  "/david-bebe": {
    "biography": "Before joining RPI, Dr. Bebe was an Associate Professor of Music at the College of Saint Rose where he served as the Instructor of Violoncello, Director of Orchestras, and String Program Coordinator for over a decade. An active cellist, he performs regularly as a chamber musician in the Capital Region and he has soloed in Avery Fisher Hall at Lincoln Center, with the Miami Bach Society Orchestra, Project Copernicus, and the National Foundation for the Advancement of the Arts. Dedicated to contemporary works, Dr. Bebe gave the Florida premiere of Steve Reich’s Cello Counterpoint, with the composer present and released a recording of Michael White’s Sonata in One Movement for Violoncello and Piano; a work he premiered with pianist Dr. Young Kim at the Julliard School. In early 2020, the duo participated in performances of all the Beethoven cello sonatas as a part of the SUNY Albany 250 year Beethoven celebration. As a string teacher, Dr. Bebe has been on the faculties of the Indiana University String Academy, the String Academy of Wisconsin at the University of Wisconsin-Milwaukee, the Young Musicians and Artists Festival in Oregon, the Gem State String Boot Camp at Idaho State University and is co-founder of the Academy for Strings in Albany, NY. He has been published in the American String Teachers Association journals and regularly leads workshop and clinics in string pedagogy. In the summer of 2021, Dr. Bebe joined the Empire State Youth Orchestra as their Director of Education where he creates enrichment opportunities, coordinates curriculum, supports the artistic staff and directs the summer session. He received his D.M.A from the University of Miami and his B.M. and M.M. from Indiana University where he studied with Ross Harbaugh, Tsyoshi Tsutsumi, and Helga Winold. During his studies, he participated in masterclasses with such great cellists as Orlando Cole, Janos Starker, Gary Hoffman and Philippe Muller.",
    "name": "David Bebe",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/BebeD.jpeg",
    "title": "Music Fellow, Arts"
  },
  "/david-bell": {
    "name": "David Bell",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Associate Professor, Architecture"
  },
  "/david-haviland": {
    "name": "David Haviland",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, School of Architecture"
  },
  "/david-isaacson": {
    "area": "Mathematics applied to medical problems., Medical imaging, Electrical Impedance Tomography. Monitoring heart and lung functions., Mathematics applied to the molecular diagnosis and chemotheraputic treatmentment of breast cancer and other diseases.",
    "biography": "Professor Isaacson works in two areas: mathematical physics and medical imaging. His work in mathematical physics has centered on the development of methods for approximating energy levels, particle masses, and critical exponents in quantum mechanics, quantum field theory, and statistical mechanics. His work in medical imaging has centered on the development of algorithms and devices for measuring and displaying the electrical state of the interior of a body from measurements made on the body's exterior. The long term goal of this research is to improve the diagnosis and treatment of heart disease and cancer.",
    "name": "David Isaacson",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/Isaacson_crop.jpg",
    "title": "Professor",
    "website": "http://homepages.rpi.edu/~isaacd/"
  },
  "/david-kahn": {
    "name": "David Kahn",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "School of Architecture"
  },
  "/dick-lahey-jr": {
    "area": "Multiphase Flow and Boiling Heat Transfer, Reactor Safety Analysis, Reactor Thermal-Hydraulics, Applications of Chaos Theory, Sonofusion Technology",
    "biography": "Professor Lahey is an international authority in multiphase flow and heat transfer technology and was formerly Director of the Center for Multiphase Research (CMR) at Rensselaer. He was previously Dean of Engineering at RPI and has served as Chairman of the Faculty & Science Senate. Prior to joining Rensselaer in 1975 as Chairman of the Department of Nuclear Engineering, he held several technical and managerial positions with the General Electric Company, including overall responsibility for all domestic and foreign R&D programs associated with nuclear reactor thermal-hydraulic and safety technology.",
    "name": "Dick Lahey Jr",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/lahey_richard_web_0.jpg",
    "title": "Professor Emeritus, Mechanical, Aerospace and Nuclear Engineering",
    "website": "http://www.rpi.edu/~laheyr"
  },
  "/donald-drew": {
    "biography": "Donald Drew earned his bachelor’s, master’s, and doctoral degrees in mathematics from Rensselaer. In between his long tenure at the Institute, Drew conducted postdoctoral research at MIT, and taught for two years at New York University. Drew works in the area of multiphase flows, which are flows in which more than one material moves. Applications include sedimentation, boiling filtration and separation. A common example of the latter is the separation of a carbonated beverage and its “head”. It is an exciting area because of the complexity which can occur in such flows, and also because the simplest set of equations you can write are “ill-posed” — flawed in a very fundamental way. Even though the simplest equations are incorrect in this way, many predictions obtained from them appear believable. Should the right equations be very different from the wrong ones? To try to answer this question, Drew is examining solutions of the equations which represent special physical phenomena in the flows and how sensitive the predictions are to the equations. The physical phenomena include the formation and propagation of “structures” in the flow, such as shocks and transitions, including the interface between the beverage and its foamy “head”. There are some deep physical questions encountered along the way. Specifically, one wants to know how the equations appear in different coordinate systems. Since coordinate systems are human inventions, the materials cannot know one from another. This gives information about the form the equations can take. Another question involves the concepts of entropy and disorder. The motion of liquid flowing around a bubble has a “disorder” in it on the scale of the bubble size, but this is vastly different than the thermal motions usually treated with thermodynamic ideas. On the other hand, this “disorder” associated with the motion cannot all be reordered, or recovered, without some expenditure of energy. Drew feels that results in this important technological area can give insights in other areas of mechanics, for example, in the relation between gas dynamics and the dynamics of a large collection of gas molecules.",
    "name": "Donald Drew",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/Drew_crop.jpg",
    "title": "Professor Emeritus, Mathematical Sciences",
    "website": "http://eaton.math.rpi.edu/faculty/Drew/DDHome.html"
  },
  "/donald-schwendeman": {
    "area": "Numerical methods for PDEs, Fluid-structure interaction problems, Gas dynamics and wave propagation, Multi-scale and multiphase reactive flow, Adaptive and parallel algorithms, Mathematics for industrial applications",
    "biography": "Dr. Schwendeman received his B.S.E. in Aerospace Engineering from the University of Michigan, and earned his Ph.D. in Applied Mathematics at the California Institute of Technology (Caltech) under the supervision of Professor G.B. Whitham, FRS. Dr. Schwendeman took a one-year postdoctoral research position at Caltech working with Professor H.B. Keller, before joining the faculty in the Department of Mathematical Sciences at Rensselaer as an assistant professor in August, 1987. Dr. Schwendeman received promotions to associate professor with tenure and then professor, and was named the Head of the Department of Mathematical Sciences in 2012. Dr. Schwendeman's research focuses on the development and analysis of numerical methods for systems of partial differential equations (PDEs) that arise in applications of science and engineering. A significant portion of his work has centered around the development of numerical methods for systems of PDEs modeling wave phenomena in reactive and nonreactive flows. This work has included numerical studies of shock wave focusing and convergence, transonic and hypersonic aerodynamics, and multi-phase and multi-material high-speed reactive flow. In recent work, Dr. Schwendeman has developed a class of new numerical methods for fluid-structure interaction problems. All of this work has been in collaboration with researchers at national labs (Los Alamos and Lawrence Livermore) and at Rensselaer. Dr. Schwendeman is also actively involved in undergraduate and graduate education and career development. He is a leader among the consortium of universities organizing the Mathematical Problems in Industry Workshop (1993-present), and the originator and lead organizer of the Graduate Student Mathematical Modeling Camp (2004-present). Dr. Schwendeman is also an active member of the NSF-funded Research Training Grant (RTG) program in the department, which supports the research and education of several graduate students and postdoctoral research fellows.",
    "name": "Donald Schwendeman",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/don_department_head.jpg",
    "title": "Professor, Department Head and Director, Center for Modeling, Optimization and Computational Analysis (MOCA), Mathematical Sciences",
    "website": "http://www.rpi.edu/~schwed"
  },
  "/edwin-rogers": {
    "name": "Edwin Rogers",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Computer Science"
  },
  "/enrique-ramirez": {
    "name": "Enrique Ramirez",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "School of Architecture"
  },
  "/ephraim-glinert": {
    "name": "Ephraim Glinert",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Computer Science"
  },
  "/esra-agca-aktunc": {
    "education": "Ph.D., Industrial and Systems Engineering, Virginia Polytechnic Institute and State University, 2013 M.Sc., Industrial and Systems Engineering, Virginia Polytechnic Institute and State University, 2011 B.Sc., Industrial Engineering, Bilkent University, 2008",
    "linkedin": "http://www.linkedin.com/in/esraagca",
    "name": "Esra Agca Aktunc",
    "office": "CII 5211",
    "orcid": "0000-0002-9597-569X",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2023-01/EsraAgcaAktunc%20-%20Copy.JPG",
    "title": "Sr. Lecturer, Industrial and Systems Engineering"
  },
  "/evan-runyon": {
    "name": "Evan Runyon",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "School of Humanities, Arts and  Social Sciences (HASS)"
  },
  "/gary-judd": {
    "name": "Gary Judd",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-11/gary-judd.jpg",
    "title": "Professor Emeritus, Lally School of Management",
    "website": "https://archives.rpi.edu/institute-history/gary-judd"
  },
  "/geetu-sharma": {
    "name": "Geetu Sharma",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Lecturer, Chemistry and Chemical Biology"
  },
  "/george-habetler": {
    "name": "George Habetler",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Mathematical Sciences"
  },
  "/george-lee": {
    "education": "Ph.D., Baylor University, 2020",
    "name": "George Lee",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-10/leeg2.jpg",
    "title": "Lecturer, Biomedical Engineering"
  },
  "/georges-belfort": {
    "area": "Membrane separation processes, Transport phenomena, Interfacial phenomena and rheology, Bioseparations and sensors, Protein misfolding and aggregation, Intein technology",
    "biography": "Dr. Georges Belfort: Endowed chair Russell Sage Professor of Chemical and Biological Engineering at RPI. He received his BS degree in CHME at the University of Cape Town and PhD in Engineering from UC Irvine. He has broad research interests include mass transfer and membrane filtration, protein misfolding and kinetics, single molecule force spectroscopy, and bioseparations. He has received the two major awards in the US on Separations (ACS (1995) and AIChE (2000)), the ACS Murphree Award in Industrial and Engineering Chemistry (2008), and is one of the â€œ100 Chemical Engineers of the Modern Erae as part of the AIChE Centennial Celebration in 2008. He was elected a member of the US National Academy of Engineering, February 2003.",
    "name": "Georges Belfort",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/george_belfort_0.jpg",
    "title": "Institute Professor of Chemical and Biological Engineering, Member, National Academy of Engineering, Chemical and Biological Engineering",
    "website": "http://www.rpi.edu/~belfog"
  },
  "/gerald-korenowski": {
    "biography": "Prior to joining the RPI faculty in 1982, Korenowski was a postdoctoral research associate at Columbia University and a National Institutes of Health Postdoctoral Fellow at SUNY/Stony Brook.",
    "name": "Gerald Korenowski",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/Korenowski_crop.jpg",
    "title": "Director of Undergraduate Studies and Research, Chemistry and Chemical Biology",
    "website": "http://rpi.edu/dept/chem/chem_faculty/profiles/korenowski.html"
  },
  "/gunnar-babcock": {
    "biography": "Gunnar Babcock works in the philosophy of biology. He received his doctorate in philosophy from the University at Albany and he held a postdoctoral position for two years in the Department of Biology at Duke University working on the project, \"Increasing complexity: The first rule of evolution?\" He is also a co-project leader on the upcoming project titled, \"Agency, Purpose, and Field Theory\" that is a continuation of his research on goal directed systems and teleological explanations in the sciences.",
    "education": "Postdoctoral Associate, Dept. of Biology, Duke University (2020-2022) PhD, University at Albany, (2013-2020) B.A., Sarah Lawrence College, (2004-2008)",
    "name": "Gunnar Babcock",
    "office-hours": "Office Hours Mondays and Thursdays, 10:00-11:00am (and by appointment)",
    "orcid": "0000-0001-6197-7921",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "primary-area": "Philosophy of biology",
    "research": "Gunnar's research is primarily in the philosophy of biology. It focuses on topics like biological individuality, species, and both modern and historical accounts of teleology. He has published in both philosophical and biological journals such as the British Journal for the Philosophy of Science, Synthese and the Biological Journal of the Linnean Society. He has also presented his work at venues including the Linnean Society of London and the Philosophy of Science Association, and he has written for Aeon Magazine. Currently, he collaborates with Daniel W. McShea (Duke University) to further develop a new approach to understanding goal directed systems that they call field theory. They have been awarded a grant by the John Templeton Foundation to fund a project called Purpose, Agency, and Field Theory, which is a continuation of this work. Some of Gunnar's other research considers developments in synthetic biology, biological concepts like bio-indeficiency, and various areas of biotechnology to determine how these alter the metaphysical underpinnings of concepts like reproduction, species, and lineages. His broader philosophical interests extend to the history and philosophy of science, environmental ethics and ancient philosophy.",
    "teaching": "While Gunnar specializes in the philosophy of biology, he's taught courses across a wide variety of philosophical topics. Some of his courses include Happiness, Environmental Ethics, Bioethics, and Plato on Eros, Poetry and Philosophy. The institutions where he's taught include Bard College at Simon’s Rock, Hartwick College, Marist College, the University at Albany, and the University of Alaska.",
    "title": "Lecturer, Cognitive Science",
    "website": "https://gunnarbabcock.com/"
  },
  "/henrik-hagerup": {
    "name": "Henrik Hagerup",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Mechanical, Aerospace and Nuclear Engineering"
  },
  "/henry-bungay-iii": {
    "name": "Henry Bungay III",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2023-01/henry-bungay.jpg",
    "title": "Professor Emeritus, Chemical and Biological Engineering"
  },
  "/henry-scarton-0": {
    "name": "Henry A. Scarton",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus"
  },
  "/hesham-hassan": {
    "area": "Cloud Condensation Nuclei distributions.",
    "education": "Ph.D. and MSc. from SUNY, UAlbany. BSc. Ain Shams University, Cairo, Egypt.",
    "name": "Hesham Hassan",
    "office": "JRSC, 2C01",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2023-03/hassah2%40rpi.edu_Hesham_Hassan_SocialMedia.jpg",
    "research": "Particulate pollutants' physical and chemical properties, concentration trends, and source distributions.",
    "teaching": "SUNY UAlbany: Air pollution Science and air quality policies, Introduction to Environmental Sciences, Sustainable Energy, and Oceans. SUNY SCCC: Physics I and II, Meteorology, and Astronomy.",
    "title": "Lecturer, Physics, Applied Physics & Astronomy"
  },
  "/ishwara-bhat": {
    "biography": "Ishwara B. Bhat is a Professor of Electrical, Computer and Systems Engineering Department at RPI. He received his B.S.E.E. degree from Indian Institute of Technology, India and his M.S. and Ph.D. degrees from Electrical Engineering, Rensselaer Polytechnic Institute (RPI). Bhat joined Rensselaer in 1985 as a research associate and was promoted to full professor in 2000. He has published over 75 articles in refereed journals and edited several special issues of the Journal of Electronic Materials. Bhat has served as a member of the program committee of several national and international conferences, including serving as co-chair of the 1996 and 2000 U.S. Workshop on the Physics and Chemistry of II-VI Materials held in Las Vegas, Nevada and Albuquerque, N.M., respectively. Bhat has over 20 years of experience in epitaxial growth and characterization of several II-VI, III-V, and IV-IV semiconductors. His work includes growth of wide band gap semiconductors (such as GaN, SiC, and ZnSe) and narrow band semiconductors (such as HgCdTe and InGaSb). His current research is focused on the growth of silicon carbide epitaxial films for use in high-power, high-temperature, and high-voltage devices, including Texas Instruments and others.",
    "name": "Ishwara Bhat",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2023-01/Ishwara-Bhat_0.jpg",
    "primary-area": "Type II-VI Semiconductors, CdTe, ZnTe, hBN and other, Epitaxial Films",
    "title": "Professor, Electrical, Computer, and Systems Engineering",
    "website": "http://www.rpi.edu/dept/cie/cpes/Ishwara_Bhat.htm"
  },
  "/ivar-giaever": {
    "name": "Ivar Giaever",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Physics, Applied Physics & Astronomy"
  },
  "/j-keith-nelson": {
    "biography": "Dr. Nelson was the Philip Sporn Professor of Electric Power Engineering at Rensselaer until 2009, having served as Head of the Department of Electric Power Engineering from 1987 to 2001. Previously he had been Manager of High Field Technology Programs at the General Electric Corporate Research and Development Center in Schenectady, NY, after serving as a faculty member at the University of London in the UK. His early career and training had been in the utility industry with Eastern Electricity in the UK. He holds degrees from the University of London and is a Fellow both of the IEEE and the IET. Keith Nelson has been very active in the Institute of Electrical and Electronic Engineers, and is past President of the IEEE Dielectrics and Electrical Insulation Society. He was elected as a Director of the IEEE in 2010. He has acted extensively as an industrial consultant to numerous organizations and is an evaluator for the Acceditation Board for Engineering and Technology ( ABET ).. Dr. Nelson has been the recipient of many awards from professional organizations such as the Institution of Engineering and Technology {formally the IEE} (UK), the Institute of Electrical and Electronic Engineers (US), the Edison Electric Institute, the Royal Society, and the Japan Society for the Promotion of Science. In 2007, he was awarded the \"Outstanding Professor Award\" by the Rensselaer Engineering School, and more recently (2017), The Maquis Lifetime Achievement Award. A full Curriculum Vitae is available. A pictorial portrait may also be viewed to depict his life and times.",
    "name": "J. Keith Nelson",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2023-02/JKN_Dakin_2022-sq.jpg",
    "research": "The primary area of interest involves the physical phenomena of power system equipment. This embraces dielectric phenomena and high voltage technology, physical electronics, gas physics, and, more recently, the application of superconductivity to power apparatus and the development of nanodielectrics. As an experimentalist, Dr. Nelson is particularly interested in the development of computer-based diagnostic instrumentation for power plant (currently transformers and generators). Acoustic and optical methods; as well as artificial intelligence are often invoked in this arena. Computer numerical modeling of the physical processes involved is often an important element in this work. The involvement in high-voltage and transient phenomena also includes a strong interest in electrostatics. Interest has centered both on the understanding and mitigation of unwanted electrostatic effects (e.g. streaming electrification) and also on the utilization of electrostatics for such things as precipitators. Research Specializations Streaming Electrification and ECT in liquids Generator Insulation Diagnostics Ultrasonic interrogation of insulating structures Artificial intelligence applied to partial discharge analysis Development and application of nanodielctrics Superconducting quench phenomena Distributed generation and islanding issues Large scale computer modeling in connection with these activities. Since 2002, most of Professor Nelson's research activity has centered on the development of nanodielectrics as a new class of insulating materials. This activity is encapsulated in a new book entitled \"Dielectric Polymer Nanocomposites\" which was published by \"Springer-Verlag\" in early 2010.",
    "teaching": "Courses previously taught in the Electric Power program: EPOW-4030 EPE Laboratory EPOW-4850 Electric Power Engineering Design EPOW-6850 Electric and Magnetic Fields in EPE EPOW-6900 Seminar in EPE",
    "title": "Professor Emeritus, Electrical, Computer, and Systems Engineering",
    "website": "https://homepages.rpi.edu/~nelsoj/"
  },
  "/james-bailey": {
    "education": "Ph.D., Algorithms, Combinatorics, and Optimization, Georgia Institute of Technology, 2017. M.S., Industrial Engineering, Kansas State University, 2012. B.S., Mathematics, Kansas State University, 2012. B.S., Industrial and Manufacturing Systems Engineering, Kansas State University, 2012",
    "name": "James Bailey",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-10/Bailey-480.jpg",
    "primary-area": "Advancing knowledge and solution methodologies in optimization, data analytics, machine learning, and social choice through the use of interdisciplinary techniques.",
    "title": "Assistant Professor, Industrial and Systems Engineering"
  },
  "/james-richardson": {
    "name": "James Richardson",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Architecture"
  },
  "/jane-koretz": {
    "biography": "Jane Koretz graduated from Swarthmore College with High Honors in 1969, and received her Ph.D. in Biophysics from The University of Chicago in 1974. After a post-doc at King’s College, London, she joined the faculty of the Biology Department at RPI, where she rose to the rank of Professor. She helped to found the Biochemistry and Biophysics Program at RPI in the early 1990s, and was successful in obtaining accreditation for awarding the Ph.D. in Biochemistry and Biophysics ten years later. She retired from RPI in the summer of 2013, and was awarded Professor Emerita status. Her research studies on aspects of the human visual process resulted in long-term support from the National Eye Institute of NIH; well over 100 papers and book chapters, including a Scientific American article; a research Fulbright Scholarship to the University of Oxford, where she was named an honorary research associate (1992-2004); and a Ruth L. Kirschstein Senior Fellowship (2008-2010). She also served on NIH study sections continuously from the mid-1980s until her retirement. She holds two patents, one in collaboration with four colleagues, and one in her own name. She is currently participating in research on the proteomics of the retina, particularly age-related macular degeneration. In addition to publications directly related to her research, she is the author of a number of essays on science, ethics, and humanism, and the co-author of several articles for the American Association of University Professors. These ancillary interests led her to the joint Union Graduate College-Mt. Sinai School of Medicine program in Bioethics from which she received her M.S. (Bioethics) in 2014, specializing in Research Ethics. She is currently a member of RPI’s Institutional Review Board.",
    "education": "B.A. with High Honors, Swarthmore College, Swarthmore, PA, Biology, 1969 Ph.D., The University of Chicago, Biophysics, 1974 Post-Doctoral Fellow, MRC Cell Biophysics Unit, London, England, 1974-1976 Fulbright Fellow, Nuffield Laboratory of Oplthalmology, University of Oxford and Open University Oxford Research Unit, 1991 M.S. Union Graduate College and Mount Siani School of Medicine, Bioethics, 2014",
    "name": "Jane Koretz",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/Koretz.JPG",
    "title": "Professor Emeritus, Biological Sciences"
  },
  "/jarrett-rose": {
    "biography": "Professor Jarrett Rose is a sociologist of mental health, medicine, culture, and psychedelics. Broadly, his research explores how social, cultural, and political relations impact health and wellbeing. Most recently, Dr. Rose has been investigating the use of group-based psychedelic-assisted therapy in people suffering chronic, treatment-resistant mental distress for whom orthodox medicine has been inefficacious. He uses qualitative methods (e.g., ethnography, interviews) to examine the cultural and social-psychological dynamics of group-based psychedelic therapy retreats. In this research, Dr. Rose studies how the cultural structure of retreats--i.e., therapeutic philosophy/alliance--and the social and emotional connections made amongst retreat participants, influence treatment outcomes. Dr. Rose is also a member of the Ebola Project at York University in Toronto, Canada, an interdisciplinary, international team of global health scholars studying the social, political, and historical factors impacting the Ebola Virus Disease outbreak and response in West Africa. This research has recently been published in Social Science & Medicine.",
    "education": "Ph.D. (Sociology), York University, Toronto, Canada M.A. (Sociology), San Diego State University B.A. (Sociology), California State University, Long Beach",
    "name": "Jarrett Rose",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-10/rose-j-480.jpg",
    "research": "Mental Health and Medicine Psychedelic Science, Cultures, and Therapy Global Health Sociological Theory Social Psychology",
    "title": "Lecturer, Science and Technology Studies"
  },
  "/jason-jacobskind": {
    "name": "Jason Jacobskind",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Lecturer, Cognitive Science"
  },
  "/jason-warner": {
    "name": "Jason Warner",
    "office": "Ricketts Building",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2023-01/warner_photo.jpg",
    "title": "Lecturer, Chemical and Biological Engineering"
  },
  "/jee-hoon-choi": {
    "name": "Jee Hoon Choi",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": ""
  },
  "/jenny-kemp": {
    "biography": "Jenny Kemp's work has been exhibited in solo exhibitions at Gold/Scopophilia• in Montclair, NJ, Mandeville Gallery in Schenectady, NY, and GridSpace in Brooklyn, NY. Recent group exhibitions include Transmitter in Brooklyn, 5-50 Gallery in Long Island City, and Kenise Barnes in Kent, CT. Featured publications include 100 Painters of Tomorrow published by Thames & Hudson, New American Paintings, The University of Chicago Press, The Huffington Post, Seattle’s City Arts, New York Times, Chronogram, and The New England Review. She is a recipient of the 2015 NYFA fellowship in painting and the 2015 Emerging Artist Award recipient from the Art Center of the Capital Region in Troy, NY. She also sits on the board of Collar Works, a non-profit art space dedicated to the support of emerging artists in Troy, NY",
    "name": "Jenny Kemp",
    "office": "West Hall, Rm 105",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-09/thumbnail_IMG_1879_0.jpg",
    "title": "Lecturer, Arts",
    "website": "http://jennykemp.com"
  },
  "/jidong-xiao": {
    "name": "Jidong Xiao",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Computer Science"
  },
  "/jillian-willis": {
    "name": "Jillian Willis",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Lecturer, Arts"
  },
  "/joe-chow": {
    "area": "Web simulator, Voltage-sourced, Voltage stability analysis, Voltage and power dispatch, UPFC, Sensitivity analysis, Rated-capacity operation, Loadflow models, IPFC, GUPFC, FACTS controllers, EPRI, Dynamic models, Dispatch strategies, Damping control, CSC, Converter based, Computational tools",
    "education": "BSEE, B. Math University of Minnesota, Minneapolis-St. Paul M.S. (EE) University of Illinois, Urbana-Champaign Ph.D. (EE) University of Illinois, Urbana-Champaign",
    "name": "Joe Chow",
    "office": "JEC 7012",
    "orcid": "0000-0001-6021-0112",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/chowjsmall.jpg",
    "primary-area": "Power system dynamics and control",
    "research": "Large-scale power system analysis, power system damping control, synchrophasor technology, control of renewable resources",
    "title": "Institute Professor, Electrical, Computer, and Systems Engineering",
    "website": "http://sites.ecse.rpi.edu/~chowj/"
  },
  "/joe-donahue": {
    "name": "Joe Donahue",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2023-01/D1F49F75-09D8-451D-B3B0-70BA68F18F54_1_201_a.jpeg",
    "title": "Adjunct Professor, Communication and Media"
  },
  "/joel-plawsky": {
    "area": "Interfacial phenomena, Transport Processes, Thin Films, Microelectronics, Photonics",
    "biography": "Joel L. Plawsky received his BS in chemical engineering from the University of Michigan and his MSCEP and ScD in chemical engineering from the Massachusetts Institute of Technology. After graduation, Joel worked for Corning Inc. in their applied physics research division before returning to academia at Rensselaer Polytechnic Institute. He is currently a professor of chemical engineering at RPI. Joel was a NASA Faculty Fellow in 1999 and 2000 and a visiting professor of chemical engineering at Delft University of Technology in 2002. In 2003 Joel spent 6 months at Marshall Space Flight Center where he helped in the investigation of what caused the disintegration of the space shuttle, Challenger, and developed repair materials to help prevent another catastrophic loss. He is a Fellow of the American Institute of Chemical Engineers (AIChE), has served as the chairman of the Transport and Energy Processes Division of AIChE, is a recipient of AIChEâ€™s Herb Epstein Award, and serves on the editorial board of Chemical Engineering Communications.",
    "name": "Joel Plawsky",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/plawsky.jpg",
    "title": "Professor and Department Head, Chemical and Biological Engineering",
    "website": "http://homepages.rpi.edu/~plawsky/"
  },
  "/john-brunski": {
    "name": "John Brunski",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus"
  },
  "/john-dargenio": {
    "name": "John D'Argenio",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Adjunct Professor, Lally School of Management"
  },
  "/john-gowdy": {
    "area": "climate change behavioral and evolutionary economics",
    "biography": "John M. Gowdy was a Professor of Economics and Professor of Science and Technology Studies at Rensselaer Polytechnic Institute in Troy, New York. He is the recipient of the Herman Daly Award for contributions to ecological economics. “Throughout my career I have been interested in the relationship between economic systems, social institutions and the natural world. My current research, in collaboration with evolutionary biologists, focuses on the evolution of economic systems. I feel fortunate to be an economist in this period of rapid change in the field. After several decades of intellectual stagnation economics is opening up to new ideas from the behavioral sciences, biology, and systems theory. This awakening holds the promise to make economics once again relevant to the daunting challenges confronting our species.” Gowdy is the author of over 170 published articles and 10 books. His most recent book is Microeconomic Theory Old and New: A Students Guide. Other recent published work includes the book Economic Theory Old and New: A Students Guide, Paradise for Sale: A Parable of Nature, with Carl McDaniel, \"Global Warming Economics in the Long Run\" in Land Economics, \"A Group Selection Perspective on Economic Behavior, Institutions and Organizations\" in the Journal of Economic Behavior and Organization, and \"Behavioral Economics and Climate Change Policy\" in the Journal of Economic Behavior and Organization. Gowdy has served as president of the U.S. Society for Ecological Economics and President of the International Society for Ecological Economics. He is the recipient of the Herman Daly Award for contributions to ecological economics. He has been a Fulbright scholar at the Economic University of Vienna, Leverhulme Professor at Leeds University and a visiting scholar at the Autonomous University Barcelona, the University of Zurich, the Free University of Amsterdam, the University of Queensland and Tokushima University Japan. C.V.",
    "name": "John Gowdy",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/gowdy.jpeg",
    "title": "Professor Emeritus, Economics",
    "website": "http://homepages.rpi.edu/~gowdyj/"
  },
  "/john-koller": {
    "name": "John Koller",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Cognitive Science"
  },
  "/john-mitchell": {
    "area": "optimization, integer programming, linear programming, conic optimization, semidefinite programming, mathematical modeling of interdependendent infrastructures, sparse optimization and rank minimization",
    "biography": "Professor Mitchell's interests are in various areas of optimization. From a theoretical point of view, he develops algorithms for integer optimization, conic optimization problems, and problems with complementarity constraints, areas that have multiple applications in allocation of resources as well as in other areas of science. One particular current area is in sparse and low-rank optimization, especially in the use of exact complementarity formulations. Sparse formulations occur in, for example, compressed sensing and genome-wide association studies. Low-rank optimization is also used in some problems in compressed sensing and also in statistics and in financial optimization. Current application areas of particular interest are in effective resource allocation in disaster management and humanitarian logistics, looking both at preparation and mitigation for a potential disaster, and in recovery from a disaster. He also looks at the related area of designing resilient supply chains.",
    "name": "John Mitchell",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/Mitchell_crop.jpg",
    "title": "Graduate Program Director, Mathematical Sciences",
    "website": "http://www.rpi.edu/~mitchj/"
  },
  "/john-schroeder": {
    "biography": "Prior to joining the faculty of Rensselaer in January, 1982, he was a commissioned officer in the U.S. Navy from June, 1962, to January, 1970. From 1975 to 1978 Professor Schroeder was a Post-Doctoral Associate in the School of Chemical Sciences and a Senior staff member of the Materials Research Laboratory at the University of Illinois in Champaign/Urbana. In l978, he joined the General Electric Corporate Research and Development Center in Schenectady, NY. He did basic glass and ceramic material research and examined material behavior at ultra high pressure (diamonds). At Rensselaer he studied the optical and magnetic properties of glasses using Rayleigh, Brillouin and Raman spectroscopic techniques at extremes of pressure and temperatures. Recently Schroeder has worked on confirming the existence of intermediate range order in glasses leading to an explanation of the existence of non-exponential structural relaxation in glasses. He also leads a program of optical characterization of nanocrystalline (II-VI and IV) semiconductors with high pressure being a most important parameter. Now, he also works on the problem of cataract formation in the human lens employing photoluminescence spectroscopy and perturbative colorimetry techniques. Schroeder is the author or coauthor of over 110 published technical articles in refereed journals and proceedings. Under Schroeder’s guidance ten Ph.D. thesis students and eight M.S. students have completed their degrees. He has also supervised undergraduate research participants for over twenty students.",
    "name": "John Schroeder",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/Schroeder.jpg",
    "title": "Professor, Physics, Applied Physics & Astronomy",
    "website": "http://rpi.edu/dept/phys/faculty/profiles/schroeder.html"
  },
  "/jonathan-newell": {
    "biography": "Dr. Newell was an investigator for 20 years in the Trauma Research Center at the Albany Medical Center, conducting clinical research into the physiological consequences and complications of injury or trauma. He has investigated basic physiological regulation of the pulmonary circulation and gas exchange. He has been a reviewer of grants for research and training in Biomedical Engineering for the National Institute of Health, the National Science Foundation, the Whitaker Foundation, and other agencies. He has been an Associate Editor for the IEEE Transactions on Medical Imaging, and a reviewer of manuscripts for that and many other journals. Since 1985, he has collaborated with several other faculty in developing Electrical Impedance Imaging systems. The focus of this work has been its application to breast cancer diagnosis. Present efforts are directed at continuous bedside monitoring of heart and lung function in the critically ill.",
    "education": "Ph.D., Albany Medical College, 1974",
    "name": "Jonathan Newell",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/newelj_0.jpg",
    "title": "Professor Emeritus, Biomedical Engineering",
    "website": "http://www.rpi.edu/~newelj"
  },
  "/joseph-markowski": {
    "biography": "Joseph Markowski researches philosophical questions and issues concerning comparative philosophy, religion and ethics. He is particularly interested in exploring the normative views of Asian religious traditions, specifically Buddhism, in dialogue with Western ethical theories. He currently works with students in the following classes: Introduction to Philosophy of Religion, Religion in the Global World and Environmental Ethics.",
    "education": "Ph.D., Vrije Universiteit Amsterdam, The Netherlands MA., McGill University BA., Green Mountain College",
    "name": "Joseph Markowski",
    "office": "Carnegie 110",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "primary-area": "Buddhism in dialogue with Western Philosophy (Metaethics, Ethical Theory and Applied Ethics).",
    "research": "While my research interests in philosophy and religion are broad, my academic expertise is in the areas of Buddhism (South Asian, Tibetan and East Asian traditions) and ethics (metaethics, ethical theory and applied ethics). Within the field of Buddhism, I am particularly interested in: (a) Indo-Tibetan epistemology; (b) the metaphysics of emptiness (Skt. sunyata); (c) the koan and Zen philosophy of language; (d) Buddhism in dialogue with Western ethical theories; and (e) the phenomenology of meditation as a normative practice. In regard to ethics, I am particularly interested in moral epistemology and contemporary debates concerning realism and anti-realism, as well as cognitivism and non-cognitivism. In addition, I am also interested in exploring a range of topics within environmental ethics and medical ethics, as well as engaging analytic discussion concerning the meaning of life.",
    "title": "Lecturer, Cognitive Science"
  },
  "/joyce-diwan": {
    "name": "Joyce Diwan",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/diwan.jpg",
    "title": "Professor Emeritus, Biological Sciences"
  },
  "/julia-carroll": {
    "name": "Julia Carroll",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Civil and Environmental Engineering"
  },
  "/julia-lee": {
    "biography": "I am a sociologist of organizational behavior applying a mixed methods approach to investigating value creation and decision-making in the context of entrepreneurship. I earned a Ph.D. in Sociology in 2018 from the University at Albany, SUNY. T o indicate my dedication and purpose to transition to business school education, I am currently earning an online MBA within the Gies College of Business at the University of Illinois at Urbana-Champaign. My research explains why newly publicly-traded firms succeed and fail through socio-cognitive perspectives. A specific feature makes my research program important is its applications of machine learning algorithms. I have used topic modeling algorithms to develop a novel metric for interpretative frames of information about newly public firms in crisis times. I have over three years of teaching experience at graduate and undergraduate levels. My pedagogy reflects a commitment to the multidisciplinary understanding of management with engaged learning opportunities. Prior to my academic career, I worked for a Japanese multinational company for over three years, and thus I can offer business students a practitioner’s perspective connected to theory.",
    "linkedin": "https://www.linkedin.com/in/julia-lee-44961620a/",
    "name": "Julia Lee",
    "orcid": "https://orcid.org/0000-0002-4963-3082",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-11/Julia_Lee.jpg",
    "primary-area": "Entrepreneurship, Organizational Behavior/Organizational Theory, Business Analytics",
    "title": "Lecturer, Lally School of Management",
    "website": "https://faculty.rpi.edu/julia-lee"
  },
  "/june-deery": {
    "area": "Television and new media, Politics and Class, Reality TV, Fictionality",
    "biography": "June Deery works in media studies and is particularly interested in contemporary television in traditional and online platforms. She writes on commercialization, politics, gender, and class. For some time, she has been investigating cultural perceptions of fact and fiction and is currently exploring their status within a political context. In Consuming Reality: The Commercialization of Factual Entertainment (Palgrave Macmillan, 2012), Deery demonstrates how reality television monetizes and consumes reality through its branding of content and propagation of capitalist narratives. Among other things, she examines the professionalization of individual identities and social relationships, the development of television as a social and interactive medium, and the commodification of viewers and TV participants. Reality TV (Polity, 2014) provides an overview of the impact of reality television since its inception and its contribution to discussions of gender, class, race, celebrity, audience agency, and consumer identity. The book also continues to explore cultural understandings of factuality and realism. Deery also co-edited (with Andrea Press) Media and Class: TV, Film, and Digital Culture (Routledge, 2017). In this collection, a range of prominent British and American scholars address topics such as class as entertainment, labor relations and media production, and digital celebrity. Deery has received awards for best journal article, best conference paper, and for teaching. In 2010, she was the recipient of Rensselaer’s Trustee’s Outstanding Teacher Award and before that the School of the Humanities, Arts, and Social Sciences Teaching Award (2009).",
    "name": "June Deery",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/Deery%2520June.jpeg",
    "title": "Professor, Communication and Media"
  },
  "/justin-den-herder": {
    "name": "Justin Den Herder",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Architecture"
  },
  "/katherine-skovira": {
    "name": "Katherine Skovira",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "School of Humanities, Arts and  Social Sciences (HASS)"
  },
  "/kathryn-cartini": {
    "name": "Kathryn Cartini",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "I-Corps Instructor, Lally School of Management"
  },
  "/ken-rose": {
    "name": "Ken Rose",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-11/KenRose.jpg",
    "title": "Professor Emeritus, Electrical, Computer, and Systems Engineering"
  },
  "/kenneth-connor": {
    "area": "engineering education, plasma science and engineering, electromagnetic theory, wave propagation, broadening participation in the engineering workforce",
    "biography": "Dr. Connor's research involves plasma physics, electromagnetics, photonics, biomedical sensors, engineering education, diversity in the engineering workforce, and technology enhanced learning. He learned problem solving from his father (who ran a gray iron foundry), his mother (a nurse) and grandparents (dairy farmers). He has had the great good fortune to always work with amazing people, most recently the members and leadership of the Inclusive Engineering Consortium (IEC) from HBCU, HSI and TCU ECE programs and the faculty, staff and students of the Lighting Enabled Systems and Applications (LESA) ERC, where he was Education Director until his retirement in 2018. He was RPI ECSE Department Head from 2001 to 2008 and served on the board of the ECE Department Heads Association (ECEDHA) from 2003 to 2008. He is a Life Fellow of the IEEE.",
    "name": "Kenneth Connor",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/kennethaconnorC_0.jpg",
    "title": "Professor Emeritus, Electrical, Computer, and Systems Engineering",
    "website": "http://hibp.ecse.rpi.edu/~connor/ken_connor.html"
  },
  "/kenneth-miller": {
    "name": "Kenneth Miller",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Chemistry and Chemical Biology"
  },
  "/kristin-johnson": {
    "area": "Chemistry is often defined as \"The Central Science\". With the combination of the geologic / solid state perspective collaborations with other disciplines become possible. Currently, initial collaboration have begun with a faculty member in architecture. Our part is to characterize and understand the role that the inorganic binder had in carbon sequestration. Any interested undergraduate students should reach out to ask about potential possibilities to get involved.",
    "biography": "More about Kristin N. Johnson-Finn (\"Johnson-Finn\" is the preferred name in publications and professional settings over \"Johnson\") The Chemical Lens: The Bridge between Geology and Chemistry Research in the Johnson-Finn laboratory bridges the divide between organic chemistry and geology, which is a useful perspective when pursuing the fate of organic compounds in geologic settings, astrobiology biosignatures, questions of origins of life and more! By bringing a chemist’s perspective, our understanding of observations from these systems can expand beyond what has been accomplished before. The interdisciplinary approach opens pathways to new information that we cannot pursue otherwise and allows collaboration with a diverse variety of different researchers. Because of the fundamental nature of this research, it has many applications. Professor Johnson-Finn is a faculty member of the RARE (Rensselaer Astrobiology Research and Education) Center and a Co-I of a NASA funded research grant involving collaborators across the country titled \"Earth First Origins\" (EFO). The EFO focuses on understanding the connection between geologic environments and the emergence of life through observations, modelling, and experiments. Link to RARE flyer Pathways: The Unification of Chemistry, Geology, Astrobiology & Processes on Earth Missions to the icy moons of Europa and Enceladus, explorers of organic sediments on the ocean floor, engineers developing organic synthesis methods in batch reactors, and researchers focused on finding the first origins of life all need a detailed map of reactions at different parameter space. Detailed pathway mapping through a combination of experimental results and theoretical calculation can shine light on the dark forest of unexplored parameter space waiting to be pursued in any environment where organic compounds and geology result in a complex mixing history. Potential collaborators and students unafraid to help dig into the weeds of these problems are welcome to stop by for a chat!",
    "education": "Research Scientist (2018 - 2022) Earth-Life Science Institute: Tokyo Institute of Technology, Tokyo, Japan. Ph.D. (2017) Department of Chemistry & Biochemistry / School of Molecular Sciences: Arizona State University, Tempe, AZ, USA. B.S. (2010) Department of Chemistry: Youngstown State University, Youngstown, OH, USA. ( Minors in Mathematics and Geology)",
    "linkedin": "https://www.linkedin.com/in/kristinnicolejohnson/",
    "name": "Kristin Johnson",
    "office": "Polymer Center (Empire Hall) 3105",
    "orcid": "https://orcid.org/0000-0001-6015-8617",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-10/Johnson-Finn_JRowl_better_square.jpg",
    "primary-area": "hydrothermal chemistry, electrochemistry, geo-catalysis, organic geochemistry, thermodynamics, astrobiology",
    "research": "(Under construction) Astrobiology and the interface between Chemistry & Geology Definitions of \"Astrobiology\": Though the term 'astrobiology' contains the word 'biology', the field of study is not limited to only specimens that are themselves classified as living. Instead it is a broad and encompassing field involving many different disciplines and areas of research. A good description can be found through the University of Washington [ link ]: “Astrobiology is the study of life in the universe. The search for life beyond the Earth requires an understanding of life, and the nature of the environments that support it, as well as planetary, planetary system and stellar interactions and processes. To provide this understanding, astrobiology combines the knowledge and techniques from many fields, including astronomy, biology, chemistry, geology, atmospheric science, oceanography and aeronautical engineering.” Where the Johnson-Finn (PENGUIN) Group Fits in Astrobiology Research: Chemists, astronomers, and geologists at RPI follow a history of research in astrobiology and pre-biotic chemistry (the field of research exploring the types of chemistry that could have existed before life emerged). Science itself is an ever-evolving organism, adapting to new information, new techniques, and new problems in need of solutions. Currently, the newest evolution of astrobiology research at RPI is through RARE (Rensselaer Astrobiology & Research Education) Center. A collaboration between the departments of Earth & Environmental Science and Chemistry & Chemical Biology funded by NASA and RPI. Professor Johnson-Finn is a faculty member of the RARE Center and a Co-I of a NASA funded research grant involving collaborators across the country titled \"Earth First Origins\" (EFO). The EFO focuses on understanding the connection between geologic environments and the emergence of life through observations, modelling, and experiments. Link to RARE flyer Sitting at the junction of organic chemistry and geology, the Johnson-Finn group aims to answer relevant questions as to the roles that geology plays in the pathways of organic compounds through experiments. When the astrobiology community was asked in recent years to define goals and objectives for future research, \"Identifying abiotic sources of organic compounds\" and \"Synthesis and function of macromolecules in the origin of life\" topped the list. [ NASA Astrobiology ] The Johnson-Finn research group is focused on exploring the fundamental chemistry that is available to organic compounds in geologic settings, primarily the role that minerals (the simplest chemical component of rocks) play either as catalyst or reagent in aqueous organic reactions. Through a combination of hydrothermal experiments, electrochemical approaches, and thermodynamic modelling, reaction pathways for different classes of organic compounds can be traced in the formation of a larger organic chemical framework. Beyond Astrobiology / Exploring Problems on Earth Our laboratory is looking to pursue research questions beyond our astrobiology work, probing fundamental abiotic processes that exist anywhere in the universe or pivoting back to Earth to find solutions related to the larger environmental issues we face today. The fundamental approach provides a powerful starting position to comprehend and explore how different environments evolve at a molecular level. Students help to guide these questions and drive our understanding forward! Techniques of the Laboratory (Both Physical and Virtual) The PENGUIN laboratories (currently under renovation) will house experimental vessels that can explore different fundamental parameters related to aqueous organic reactions. The goal of all studies in this group will be to gather information about the kinetics and mechanisms of different organic reaction paths through either experimental or theoretical means. The combination of experimental expertise with theoretical guidance is most powerful. The three main approaches utilized in the group include (1) hydrothermal chemistry, (2) electrochemistry, and (3) thermodynamic modelling. Interested students will undertake projects using one or more of these techniques to pursue questions related to specific geologic, environmental, or experimental fields of study. Hydrothermal chemistry: Water that is hot (described as \"hydrothermal\") has different properties from the water that we observe at ambient conditions. The reaction paths for organic compounds, especially in contact with different mineral surfaces available in naturally occurring geologic settings, is in need of detailed chemical cartographers, looking to map these environments through experiment. To perform such experiments requires the use of high temperature and high pressure reaction vessels and experimental methods designed to withstand such conditions while keeping the reaction mixture intact. Electrochemistry: To observe redox reactions requires the ability to control and monitor the flow of electrons. Electrochemistry is a useful tool for exploring reactions that require the transfer of those electrons to proceed. Initial inspirations for this work involve the use of semiconductor minerals as catalytic drivers of organic redox reactions. How those reactions may occur at hydrothermal conditions, influence the available biosignatures observed on other planets, or be harnesses for the purpose of sustainable chemistry are all of interest and under pursuit by researchers in this group. Thermodynamic Calculations: The analytical chemist Izaak M. Kolthoff popularized the maxim inherited from his PhD advisor N. Schoorl: \"Theory guides; experiment decides.\" Thermodynamic tools such as CHNOSZ https://chnosz.net/ can help to guide different experimental and analytical research by providing insight into what might exist and what definitely does not exist from an energetics perspective. Involving programming, data management, and database building, these calculations serve as a solid foundation upon which experimental studied can thrive and expand. Laboratory facilities will be located in the 1st floor of the Cogswell Laboratory building.",
    "title": "Assistant Professor, Chemistry and Chemical Biology"
  },
  "/kseniya-klyachko": {
    "area": "Mathematics Education",
    "biography": "Dr. Kseniya Klyachko earned her Ph.D. in Mathematical Sciences from University at Albany (SUNY) in 2020. Prior to joining the Department of Mathematical Sciences at Rensselaer as a Lecturer in 2022, Dr. Klyachko held teaching appointments at University at Albany (SUNY), Siena College, and Albany College of Pharmacy. Her current primary interest is in Mathematics Education and improving outcomes and experiences for Calculus students.",
    "name": "Kseniya Klyachko",
    "office": "Amos Eaton 408",
    "office-hours": "Office Hours Mondays and Thursdays: 10-11:20am in AE 408 Wednesdays: 3-4pm online",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2023-02/1.jpg",
    "title": "Lecturer, Mathematical Sciences"
  },
  "/larry-kagan": {
    "name": "Larry Kagan",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Arts"
  },
  "/larry-reid": {
    "biography": "Larry Reid has made significant contributions to the psychology and neuroscience of pleasure. Some of his most influential work is cited often, including several articles in Physiological Psychology, Pharmacology Biochemistry & Behavior, Alcohol, and the American Journal of Clinical Nutrition. “Throughout my career, beginning with my doctoral dissertation, I have been interested in the psychology and neuroscience of pleasure,” said Reid. “For many years, I studied the “pleasure-producing” effects of direct electrical stimulation of the brain in laboratory subjects. I developed a novel way of measuring “pleasure” among rats, the conditioned place preference test (a widely used test used, for example, in assaying the emotional effects of drugs in laboratory animals). The interest in pleasure led to an interest in studying the behaviors associated with the activity of endogenous opioid system (for example, I verified that the endogenous opioid system’s activity was involved with eating and with the intake of alcoholic beverages). Such studies provided the basic science for the development of medicines to curb alcoholism.” Reid’s current interest is in improving the treatment of alcoholism, by using knowledge of cognitive science, in helping to develop computer-assisted game-like programs to augment current therapies. He has a particular interest in the unique effects of alcohol in girls and women. Reid is a fellow in the American Psychological Association, the International Behavioral Neuroscience Society, and the Association for Psychological Science.",
    "name": "Larry Reid",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/reid.jpeg",
    "title": "Professor of Psychology and Neuroscience, Cognitive Science"
  },
  "/leandro-piazzi": {
    "name": "Leandro Piazzi",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-09/YO-03.jpg",
    "title": "Lecturer, Architecture",
    "website": "https://balsacrosettopiazzi.com"
  },
  "/lei-yu": {
    "biography": "Lei Yu is a Tenure-Track Assistant Professor in the Department of Computer Science at Rensselaer Polytechnic Institute. Before that, he was a Staff Research Scientist at IBM Research, IBM Thomas J. Watson Research Center. His research interests include security and privacy, big data analytics & distributed systems, the security and privacy of machine learning, and cloud and mobile computing. He received his Ph.D. in Computer Science from Georgia Institute of Technology.",
    "name": "Lei Yu",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2023-02/IMG_9782.jpeg",
    "primary-area": "data privacy and security",
    "title": "Assistant Professor, Computer Science",
    "website": "https://yuleihit.github.io/"
  },
  "/leonard-interrante": {
    "area": "Inorganic and Materials chemistry, Organosilicon polymers, Ceramic precursors, Low-k dielectric materials",
    "biography": "Assistant Professor, University of California, Berkeley, 1964-68 Research Scientist, General Electric Corp. Res. & Devel., SCH, NY, 1968-85 Professor of Chemistry, Rensselaer Polytechnic Institute, 1985-2013 Emeritus Professor, Rensselaer Polytechnic Institute, 2013 - present (Founding) Editor-in-chief of Chemistry of Materials. 1988-2013 Research in inorganic and materials chemistry: supervised 22 graduate students (18 Ph.D., 3 M.S. degrees granted), 10 undergrads. and 18 postdoctoral associates Over 200 peer-reviewed papers in scientific journals, 9 patents, 6 books edited. >5000 citations; h-index 43",
    "linkedin": "http://www.linkedin.com/in/leonard-interrante-80929414",
    "name": "Leonard Interrante",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/LVI%2520photo%2520final.jpg",
    "title": "Professor Emeritus, Chemistry and Chemical Biology"
  },
  "/linnda-caporael": {
    "name": "Linnda Caporael",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus"
  },
  "/liu-liu": {
    "area": "Domain-Specific Architectures Algorithm-Architecture Co-Design Machine Learning Systems",
    "biography": "Liu Liu has been with the Department of Electrical, Computer, and Systems Engineering at Rensselaer Polytechnic Institute (RPI) as an assistant professor since July 2022. He has a Ph.D. in Computer Science at University of California, Santa Barbara. His research interests reside in the intersection between computer architecture and machine learning, towards high-performance, energy-efficient, and robust machine intelligence. He leads the research on Elastic Processing & Hardware Architectures, with publications in top-tier conferences on machine learning and computer architecture (e.g., ICML, ICLR, MICRO, and ASPLOS). He earned an M.S. in Electrical and Computer Engineering from UC Santa Barbara in 2015. He is a recipient of the Peter J Frenkel Fellowship from the Institute of Energy Efficiency at UCSB.",
    "education": "Ph.D. in Computer Science, University of California, Santa Barbara, 2022 M.S. in Electrical & Computer Engineering, University of California, Santa Barbara, 2015 B.E. in Optoelectronics, University of Electronic Science and Technology of China, 2013",
    "name": "Liu Liu",
    "office": "JEC 6018",
    "orcid": "0000-0003-0792-8146",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-08/Liu-ECSE.jpeg",
    "primary-area": "Computer Architecture and Systems",
    "title": "Assistant Professor, Electrical, Computer, and Systems Engineering"
  },
  "/marcelo-crespo-da-silva": {
    "area": "Dynamics, Nonlinear Vibrations, Perturbation Methods, Computerized Symbolic Manipulation",
    "biography": "Professor Crespo da Silva received his undergraduate engineering degree from the Federal University of Rio de Janeiro, and his M. Sc. and Ph.D. degrees from Stanford. He was a National Research Council postdoctoral research associate at NASA Ames Research Center in California working on satellite dynamics, which was the subject of his doctoral thesis. He joined the Rensselaer faculty in 1986 after rising through the ranks from assistant professor to professor in the aerospace engineering and engineering mechanics department at the University of Cincinnati. On a sabbatical leave during the first half of 1983 he continued research work on helicopter rotor blade dynamics in the Aeromechanics Laboratory at Ames Research Center. His main interests are dynamics (including structural dynamics, satellite dynamics, and helicopter dynamics) and nonlinear oscillations. He has a number of publications in these areas, and received research grants from NASA, the U. S. Air Force, the U. S. Army Research Office, and the National Science Foundation. He is a member of the American Academy of Mechanics, Senior Member of AIAA, and Fellow of the ASME.",
    "name": "Marcelo Crespo da Silva",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Mechanical, Aerospace and Nuclear Engineering"
  },
  "/mark-embrechts": {
    "area": "Data Mining, Big Data, Neural Networks, Genetic Algorithms, Computational Intelligence, Biocomputing, Drug Design, Big Data for Renewable Energy, Statistics",
    "biography": "Mark J. Embrechts is Chief Scientist at CardioMag Imaging, Inc. CardioMag developed highly accurate technology for the early detection of ischemia by measuring the magnetic field of the hearth, a technology protected by 13 patents (2 pending). Mark Embrechts is also a professor in the Department of Mechanical, Aerospace, and Nuclear Engineering (MANE) at Rensselaer. Mark is also a Full Professor of Industrial and Systems Engineering (ISE) at Rensselaer Polytechnic Institute, Troy NY. Prof. Embrechts is a frequent guest professor at the Department of Electrical Engineering / Computer Science at the University of Kassel, Deutschland. Prof. Embrechts joined the Nuclear Engineering Department at Rensselaer in 1983 and was previously an AWU-DOE fellow, Staff Member and Laboratory Director's Fellow at Los Alamos National Laboratory (1981-1983). He is a pioneer in introducing neural networks, data mining, big data analytics, genetic algorithms, and computational intelligence to the Graduate Engineering Curriculum at Rensselaer and has been teaching courses related to these topics and data-driven engineering since 1988. He has worked as a consultant or staff member at Los Alamos National Laboratory, Oak Ridge National Laboratory, the Max Planck Institute for Plasma Physics (Munich, Germany), the Paul Scherrer Institute (Switzerland), TransScan (Israel), CardioMag Imaging (Schenectady), the World Bank (D.C. Headquarters), Nikkei Research (Japan), MetaLogic (Belgium), KODAK (USA), and General Electric (Schenectady, USA). He was Guest Professor of Materials Science at the University of Leuven in 1990 and 2008 (Belgium), Visiting Professor of Electrical Engineering (University of Porto, Portugal) in 2007 and spent eight months on sabbatical leave in the Center for Economical Studies at the University of Leuven in 1991. Dr. Embrechts authored more than 250 journal articles and archival publications, holds 4 patents on ischemia detection from MagnetoCardiography, and is organizer or member of the organizing committee of numerous professional meetings and conferences. Dr. Embrechts co-authored Exchange Rate Theory: Chaotic Models of Foreign Exchange Markets. He edited 11 books, published 19 Book Chapters, and is currently writing 4 books related to Nuclear Energy and Quantum Physics. Dr. Embrechts is past president of the New York Northeastern Section of the American Nuclear Society. He is a member of IEEE, the Royal Flemish Engineering Society, INFORMS, American Society for Engineering Education, and Sigma XI. Dr. Embrechts supervised 25 Master's students and 16 Ph.D. Students during his tenure at Rensselaer. He was member of 80 doctoral committees. Past Students include a vice president at Goldman Sachs, A Vice President at Oracle, A Vice President at Citi, A Vice President at Suez, A Chief data Officer at Schlumberger, several CEOs and several professors worldwide. Publications",
    "name": "Mark Embrechts",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-10/embrechts-480.jpg",
    "title": "Professor Emeritus, Industrial and Systems Engineering"
  },
  "/mark-holmes": {
    "area": "Development and analysis of mathematical models for physiological systems, including modeling the biological tissues found in joints (such as the knee).",
    "biography": "My research interests are time dependent. The reason is that I like mathematics, and I like to use mathematics to understand the world we live in (i.e., I am an applied mathematician). Here are two specific research topics of current interest: 1) Mechanoreception. This is the study of how a living organism senses and then recognizes mechanical stimuli. The mechanoreceptors that I am presently working on are in the auditory system and in skin. For example, the mechanisms through which skin transduces tactile stimuli from a mechanical to neural signal are not understood. Therefore, the goal of my research is to construct a mathematical model that describes this process. This project involves the study of the nonlinear deformation of skin, the analysis of the dynamics of the tactile receptor, and the study of the nonlinear diffusion associated with the electro-chemical processes in the nerve. 2) Sleep-Wake Cycle. The goal of this research project is to derive, and then analyze, a physiologically based model of the human sleep-wake cycle. The approach is to use the known properties of the neurotransmitters associated with wake and sleep, and the regions of the brain in which they function, to derive the model. This approach also incorporates, or accounts for, the states of sleep (REM and NREM) and the mechanisms that regulate it (homeostatic drive and circadian synchronization). Books: 1) Introduction to the Foundations of Applied Mathematics, Springer, 2009. 2) Introduction to Numerical Methods for Differential Equations, Springer, 2006 3) Introduction to Perturbation Methods (2nd Ed), Springer-Verlag, New York, 2013. 4) Introduction to Scientific Computing and Data Analysis, Springer-Verlag, New York, 2016.",
    "name": "Mark Holmes",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/Holmes_crop.jpg",
    "title": "Professor, Center for Modeling, Optimization and Computational Analysis (MOCA)",
    "website": "http://homepages.rpi.edu/~holmes/"
  },
  "/marty-schmidt": {
    "name": "Marty Schmidt",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-09/marty-schmidt-faculty-site.jpg",
    "title": "President of Rensselaer Polytechnic Institute, President",
    "website": "https://president.rpi.edu/"
  },
  "/matt-burgermaster": {
    "name": "Matt Burgermaster",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "School of Architecture"
  },
  "/merrill-whitburn": {
    "name": "Merrill Whitburn",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus"
  },
  "/michael-blostein": {
    "name": "Michael Blostein",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "School of Humanities, Arts and  Social Sciences (HASS)"
  },
  "/michael-borbath": {
    "area": "Photonics, Engineering Management, DoD Acquisition",
    "biography": "Programs Taught Managing Technical Organizations Bio Mike Borbath is currently a Senior Scientist at L3Harris Corporation in Melbourne, FL where he develops next generation cyber and intelligence solutions for the US military and allied nations. As a Colonel in the Air Force Reserve, Mike supports the United States Space Force as a senior reservist to the Executive Officer for Space Sensing in Space Systems Command at Los Angeles Air Force Base. He easily relates to Rensselaer at Work graduate students given he earned his Ph.D. in a fully-remote cohort program with the George Washington University. Other Professional Experience United States Space Force BAE Systems L3Harris Corp. Optium Corp. (now II-VI Corp.) Terabeam Corp. National Security Agency",
    "education": "Ph.D., Engineering Management, George Washington University M. Strategic Studies, Air War College, Maxwell AFB, Montgomery AL M.S., Electrical Engineering, University of Maryland College Park B.S., Electrical Engineering, University of Florida",
    "linkedin": "https://www.linkedin.com/in/michael-borbath-ph-d-986433b7/",
    "name": "Michael Borbath",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/borbam.jpg",
    "title": "Instructor Mentor, Engineering and Science"
  },
  "/michael-halloran": {
    "name": "Michael Halloran",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Communication and Media"
  },
  "/michael-hanna": {
    "area": "academic advising, eukaryotic organisms, scientific teaching methodologies",
    "biography": "Prior research interests involved both bacterial and single-celled eukaryotic organisms for the study of DNA replication, development, pathogenesis, and protein engineering. Current interests are in scientific teaching methodologies, academic advising, and administration of departmental and Institute programs. Responsibilities in the biology department include Director of the Accelerated Physician/Scientist Program while responsibilities as Associate Dean in Undergraduate Education include Director of the Advising and Learning Assistance Center.",
    "education": "Ph.D. University of Illinois, Urbana",
    "name": "Michael Hanna",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/hanna_crop2.jpg",
    "title": "Associate Dean, Undergraduate Education, Biological Sciences",
    "website": "http://www.rpi.edu/dept/bio/faculty/profiles/hanna.html"
  },
  "/michael-jensen": {
    "area": "Heat Transfer, Fluid Mechanics, Heat Exchangers, Boiling and Two-Phase Flows, Enhanced Heat Transfer, Fuel Cells, Solar Energy, Sustainability",
    "biography": "Michael Jensen received his B.S. in Mechanical Engineering from the University of Missouri-Columbia in 1972 and his M.S. and Ph.D. degrees from Iowa State University in 1976 and 1980, respectively. He began his teaching and research career at the University of Wisconsin-Milwaukee and moved to Rensselaer in 1987. Currently, he is a Professor in the Department of Mechanical, Aerospace, and Nuclear Engineering and holds a Professional Engineers license. Among many other university activities, he has served as Associate Chair for Graduate Studies in the department, been on the executive committee of the Faculty Senate, and served as the student-elected member on the Institute-wide Promotion and Tenure Committee. As principal investigator on 41 sponsored programs, including 19 multi-year grants from NSF, DOE, NIST, NYSERDA, and industry, and consultant to 25 industry and government organizations, Michael’s research interests have been directed toward convective single- and two-phase heat transfer and the associated fluid flows with an emphasis on these processes in heat exchangers and using enhanced heat transfer techniques. Recent research has focused on microchannel flows and thermal management of electronic systems, solar energy, and fuel cells. With his graduate students (32 MS, 18 PhD), he has performed both fundamental and applied research and has conducted both experimentally and numerically based research on a wide range of topics. Dr. Jensen has published over 180 technical papers, edited 10 volumes, 30 other assorted reports, and has published an undergraduate textbook on thermal and fluids engineering. He has two patents. Michael has been honored as a Fellow of ASME, twice received the student-chosen Lewis T. Assini Undergraduate Teaching and Counseling Award, received the Ralph R. Teetor Award of SAE, and was awarded the RPI School of Engineering Research Excellence Award. He is active in his profession, having served or is serving on editorial boards of four international journals (Journal of Heat Transfer, Experimental Thermal and Fluid Science; Applied Thermal Engineering, Journal of Mechanical Science and Technology), recently was named as Founding Editor-in-Chief of ASME’s newest journal, Thermal Science and Engineering Applications, led the ASME Heat Transfer Division, and appointed as Alternate Delegate to Assembly for International Heat Transfer Conferences. He has been chair or co-chair of six international conferences (including the National Heat Transfer Conference) and has been invited to be on numerous scientific committees for other national and international conferences. He is an active reviewer for numerous international journals and conferences and NSF, DOE, NASA, and NYSERDA proposals.",
    "name": "Michael Jensen",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/jensen_michael_web_0.jpg",
    "title": "Professor Emeritus, Mechanical, Aerospace and Nuclear Engineering",
    "website": "http://www.eng.rpi.edu/soe/index.php/faculty/154?soeid=jensem"
  },
  "/michael-orourke": {
    "area": "Engineering, Snow Loads",
    "biography": "Lifeline Earthquake Engineering: * Wave propagation effects on buried pipe * Permanent ground deformation effects on buried pipe * Centrifuge testing of buried pipe * Fragility relations for above ground tanks Seismic Response of Buried Pipeline: Earthquake damage to buried lifelines such as water, sewer and natural gas lines can be caused by either wave propagation or Permanent Ground Deformation (PGD). Research on both these topics is on-going at Rensselaer. This includes an analytical evaluation of the relationship between seismic damage (repairs per kilometer of pipe) and ground strain, as well as numerical and centrifuge evaluation of buried pipe subject to abrupt PGD at a fault crossing or the margin of a lateral spread. The 1999 MCEER Monograph by O’Rourke and Liu entitled “Response of Buried Pipeline Subject to Earthquake Effects”provide background information and a summary for the topic. An updated Buried Pipeline Monograph is expected early in 2011. Snow Loading on Roofs: * Ground Snow Loads * Drift loads on stepped roofs * Drift loads on gable roofs * Eave icing Snow and Ice Loads on Buildings: Snow loading is a structural design consideration for roofs in most states and the controlling load for at least some structural component in about half the states. Although not a significant load from a structural standpoint ice dams frequently lead to infiltration and costly water damage to interior walls and ceiling surfaces. Research on both issues is ongoing at Rensselaer. Of the many types of snow loads; uniform, sliding snow from a higher roof, etc drifted snow results in higher loads and more potential for structural damage. The Rensselaer water flume is being used to simulate snow drift loading and establish relationships for use in national codes. A guide explaining the ASCE 7-10 snow load provision through design examples and frequently asked questions has been published by ASCE Press.",
    "name": "Michael O'Rourke",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/orourke_michael_web2.jpg",
    "title": "Professor Emeritus, Civil and Environmental Engineering"
  },
  "/michael-z-podowski": {
    "area": "Two-Phase Flow and Heat Transfer, Reactor Dynamics and Safety, System Stability, Applied Mathematics",
    "biography": "Professor Podowski is a former Head of Department of Nuclear Engineering and Engineering Physics at RPI. Currently he serves as: Director of Center for Multiphase Research, Head of Nuclear Safety Review Board, Academic Director of Program for Graduated of Navy Nuclear Power School, and Director of GNEP University Consortium.He has served as technical expert to the International Atomic Energy Commission (IAEA), DOE, NRC, NASA and DOH&HS. He performed consulting work to numerous industrial organizations and governmental agencies, both in the US and internationally.He authored or co-authored over 260 technical publications, including 7 books/book chapters and 50 journal articles. He also served as Chairman and Scientific Committee Member for numerous international conferences, and as keynote and invited seminar speaker. He is Follow of American Nuclear Society and Member of American Society of Mechanical Engineers and American Institute of Chemical Engineers.",
    "education": "Ph.D. Warsaw University of Technology",
    "name": "Michael Z. Podowski",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/podowski_michael_web.jpg",
    "title": "Professor Emeritus, Mechanical, Aerospace and Nuclear Engineering",
    "website": "http://homepages.rpi.edu/~podowm/"
  },
  "/natalia-maldonado-martinez": {
    "education": "Ph.D., City College of New York, 2013",
    "name": "Natalia Maldonado Martinez",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Lecturer, Biomedical Engineering"
  },
  "/neil-rolnick": {
    "name": "Neil Rolnick",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Arts"
  },
  "/nicholas-l-clesceri": {
    "name": "Nicholas L. Clesceri",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Civil and Environmental Engineering"
  },
  "/nima-ahmadi": {
    "education": "Ph.D. Engineering Management, Western New England University, MA, 2020 M.S., Engineering Management, Western New England University, MA, 2015 B.Sc., Mechanical Engineering, Azad University Central Tehran Brand, Tehran, Iran, 2006",
    "name": "Nima Ahmadi",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-10/Ahmadi-480_0.jpg",
    "primary-area": "Development of training interventions, behavior and performance evaluation using eye-tracking and wearable technologies, usability assessments and UX designs.",
    "research": "Sample Research Projects: Barriers to commercializing renewable energy technologies in Africa, Asia, Europe, and North America Barriers to commercializing renewable energy technologies in Africa, Asia, Europe, and North America",
    "title": "Lecturer, Industrial and Systems Engineering"
  },
  "/nina-stanley": {
    "name": "Nina Stanley",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "GSAS"
  },
  "/norman-thibodeau": {
    "name": "Norman Thibodeau",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "School of Humanities, Arts and  Social Sciences (HASS)"
  },
  "/patrick-burke": {
    "name": "Patrick Burke",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Arts"
  },
  "/patrick-quinn": {
    "name": "Patrick Quinn",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, School of Architecture"
  },
  "/paul-chow": {
    "area": "Semiconductor Power Devices and ICs, Wide Bandgap Semiconductors, Semiconductors, Electronics and Circuits",
    "biography": "From 1977-1989, Dr. Chow worked at General Electric Corporate Research and Development, Schenectady, NY. In the first two years, he was involved with developing CVD processes and characterization of doped tin oxide and indium oxide thin films for transparent electrode applications in solid-state imagers. From 1979-1982, his work on refractory metals and metal silicides included the deposition and plasma etching of these films as well as their incorporation into integrated-circuit processes and performance characterization of test devices and logic circuits. From 1982 to 1989, he participated in the design and process development of various discrete and integrable MOS-gated unipolar and bipolar devices (such as the MOSFET, IGBT and MCT). Also, he was involved with process architecture and integration of high-voltage power integrated circuits. Since 1989, he has been in the faculty of the Electrical, Systems and Computer Engineering Department of Rensselaer Polytechnic Institute, Troy, NY.",
    "name": "Paul Chow",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/tatsingpaulchow.jpg",
    "title": "Professor, Electrical, Computer, and Systems Engineering",
    "website": "http://www.rpi.edu/dept/cie/cpes/chow.html"
  },
  "/paul-hohenberg": {
    "name": "Paul Hohenberg",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus"
  },
  "/paul-mccoy-0": {
    "name": "Paul McCoy",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Civil and Environmental Engineering"
  },
  "/paul-quigley": {
    "biography": "Guitarist Paul Quigley has performed with the Glens Falls Symphony and as concerto soloist with The University Orchestra at SUNY Albany. Other solo and chamber music performances include Troy Music Hall, the Riverside Church Christ Chapel series, Hunter College, The Spanish Institute, and the Oberwald Concert Series in Basel, Switzerland. Additionally, Paul was a featured performer on the Queen Elizabeth II World Cruise and the Queen Mary II and Crystal Symphony ships. Paul is a member of the Finger Lakes Guitar Quartet which has performed at Cleveland Guitar Society’s “Up and Coming Artists” series, Marietta College, Lake Luzerne Summer Music Festival, Zankel Music Center, Keuka College, and the Great Lakes Guitar Society. Recent performances include works written for the FLGQ including premieres of “Forever Wild”, by Evan Mack (written for the FLGQ and the Albany Symphony Orchestra), and “Sonata for Four Guitars” by Brett Wery. A versatile musician, Paul performs electric guitar in the Rock / Blues band “Nite Train with Thomasina Winslow” and is featured on the 2020 recording, “Cat on a Mission”. A graduate of SUNY Schenectady and the Manhattan School of Music, Paul earned the A.S., BM and MM degrees in guitar performance. He is currently on faculty at Rensselaer Polytechnic Institute, the College of Saint Rose and SUNY Schenectady.",
    "name": "Paul Quigley",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/PaulSmall.jpg",
    "title": "Music Fellow, Arts"
  },
  "/paul-schoch": {
    "area": "plasma diagnostics, instrumentation, engineering education",
    "name": "Paul Schoch",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/paulmschoch_1.jpg",
    "title": "Associate Professor and Director, Center for Initiatives in Pre-College Education (CIPCE)",
    "website": "http://www.ecse.rpi.edu/~schoch/"
  },
  "/peter-boyce": {
    "name": "Peter Boyce",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, School of Architecture"
  },
  "/peter-persans": {
    "area": "novel optoelectronic materials, Physics education research and educational development",
    "biography": "Professor Peter Persans is Associate Head of the Department of Physics, Applied Physics, and Astronomy. His research interests have been mostly in the physics of amorphous, nanocrystalline, and low-dimensional materials with applications in optoelectronics and energy conversion. Recently, he has focused on improving undergraduate education at all levels. Current projects include development of a first semester mentor program across the sciences and facilitating student creation of open-source materials to enable remote laboratory experiment access for introductory physics education.",
    "name": "Peter Persans",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/perans.jpg",
    "title": "Professor, Physics, Applied Physics & Astronomy",
    "website": "http://homepages.rpi.edu/~persap/"
  },
  "/prabhakar-neti": {
    "area": "Electrical energy systems, Electric machines, Condition monitoring and online asset management of electrical equipment",
    "name": "Prabhakar Neti",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/RPI-ID-1_1.jpg",
    "title": "Professor of Practice, Electrical, Computer, and Systems Engineering"
  },
  "/prabhat-hajela": {
    "area": "Optimum Design, Structural Dynamics, Aeroelasticity",
    "biography": "Prabhat Hajela, Ph.D., is the Provost at Rensselaer Polytechnic Institute in Troy, New York. In this role, he is responsible for all academic portfolios at the Institute, and, in collaboration with the Vice President for Research, works to strengthen the research missions of the Institute. He also plays a significant role in fundraising and external relations. Hajela has previously served as the Vice Provost & Dean of Undergraduate Education, where his broad administrative mandate included oversight of all undergraduate programs at the Institute, including engaging the five academic schools in program development and implementation. He also served as the Administrative Dean of the School of Humanities, Arts, and Social Sciences in 2010-2011, providing oversight to academic and research programs in the school during a period of transition. In 2003, he served as a Congressional Fellow responsible for Science and Technology Policy in the Office of US Senator Conrad Burns (R-MT). He worked on several legislative issues related to aerospace and telecommunications policy, including the development of the anti-SPAM legislation (CAN-SPAM) that was signed into law in December 2003. Hajela has been active in several national and international organizations. He is a past Vice-President of the International Society of Structural & Multidisciplinary Optimization. He has also a past Chair of ASME’s Aerospace Division. Hajela has served on different National Academies Panels related to Aerospace and Aviation research, including the first Decadal Survey of Aeronautics and a review of Aeronautics Research Programs at NASA, and is on the NRC Technical Assessment Board for the Army Research Laboratory. He Chairs the NRC Review Panel on Information Sciences research at the Army Research Laboratory. His research interests are in areas related to complex system analysis and design in the presence of uncertainties. He has conducted research at NASA’s Langley and Glenn Research Centers, and the Eglin Air Force Armament Laboratory. He also worked at the Boeing Company as the Boeing-A.D. Welliver Fellow in 1995. He has published over 275 papers and articles in the areas of structural and multidisciplinary optimization, and is an author/editor of 4 books in these areas. He has held editorial assignments and serves on the editorial boards of several international journals. In 2004, he was the recipient of AIAA’s Biennial Multidisciplinary Design Optimization Award. Hajela is a Fellow of the American Institute of Aeronautics and Astronautics (AIAA), a Fellow of American Society of Mechanical Engineers (ASME), and a Fellow of the Aeronautical Society of India (AeSI). Hajela received his undergraduate degree in Aeronautical Engineering (1977) from the Indian Institute of Technology, Kanpur. He received Masters degrees in Aerospace Engineering from Iowa State University (1979), in Mechanical Engineering from Stanford University (1981), a Ph.D. in Aeronautics and Astronautics from Stanford University (1982), and conducted postdoctoral research at UCLA (1982-83).",
    "name": "Prabhat Hajela",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/hajela_prabhat_web_0.jpg",
    "title": "Professor and Provost, Provost"
  },
  "/prakrati-thakur": {
    "biography": "My research interests lie in international trade and environmental economics. My current research focuses on international trade in waste including the welfare consequences of waste trade across countries and how the design of an international environmental agreement on waste trade affects countries' incentives to join the agreement. I also study the interplay between regulation and international trade. Particularly, I study how the structure of international trade creates incentives for countries to adopt regulatory and voluntary standards. At RPI, I teach a course on international trade and the environment that draws directly from my research interests. In this course, we cover topics on how international trade affects air pollution and natural resource depletion along with interactions between trade policy and environmental policy and the role of international environmental agreements.",
    "education": "Ph. D. Economics, University of Illinois Urbana-Champaign, 2022 M. S. Quantitative Economics, Indian Statistical Institute, Delhi, 2015 B. A. (Honors) Economics, St. Stephen’s College, Delhi University, 2012",
    "name": "Prakrati Thakur",
    "office": "3502 Russell Sage Laboratory",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-09/IMG_5666.jpg",
    "primary-area": "International Trade, Environmental Economics, Applied Econometrics",
    "title": "Assistant Professor, Economics",
    "website": "https://www.pthakur.com/"
  },
  "/radoslav-ivanov": {
    "area": "Cyber-physical systems, formal methods, machine learning, control theory and sensor fusion.",
    "biography": "Prior to joining Rensellaer as an Assistant Professor of Computer Science, Radoslav was a postdoctoral fellow at the University of Pennsylvania, where he worked with Dr. George Pappas and Dr. Rajeev Alur. Radoslav defended his PhD dissertation in 2017 at the University of Pennsylvania under the supervision of Dr. Insup Lee and Dr. James Weimer. His research lies broadly in the field of safe and secure autonomy. The natural application domains of his work are safety-critical cyber-physical systems (CPS) such as automotive CPS and medical CPS. The fields relevant to his research are safe autonomy, neural network verification, CPS security, control theory and sensor fusion.",
    "education": "Ph.D., Computer and Information Science, University of Pennsylvania, 2017. B.A., Computer Science and Mathematical Economics, Colgate University, 2011.",
    "name": "Radoslav Ivanov",
    "orcid": "0000-0003-4987-4836",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-03/Square%2C%20cropped_0.jpg",
    "primary-area": "Safe and Secure Autonomous Systems",
    "research": "My research lies broadly in the field of safe and secure autonomy. The natural application domains of my work are safety-critical cyber-physical systems (CPS) such as automotive and medical CPS. I work both on design-time and run-time approaches to analyze the safety of these systems. My contributions include a verification technique for autonomous systems with neural network components (check out my tool Verisig!) as well as resilient and parameter-invariant detection techniques for sensor attacks and other unsafe events (e.g., oxygen desaturation).",
    "title": "Assistant Professor, Computer Science",
    "website": "http://cs.rpi.edu/~ivanor/"
  },
  "/raghu-raghavachari": {
    "name": "Raghu Raghavachari",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus"
  },
  "/ralph-noble": {
    "biography": "Ralph Noble is an associate professor in the Department of Cognitive Science. His research has explored Evolutionary Psychology and Behavioral Endocrinology with a focus on the neuroendocrine control of sensory motor systems. Currently, his interests include the psychology of games and modeling bureaucratic control systems.",
    "name": "Ralph Noble",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/noble.jpeg",
    "title": "Associate Professor, Cognitive Science",
    "website": "http://www.rpi.edu/~nobler/"
  },
  "/ricardo-dobry": {
    "area": "Soil Mechanics, Geotechnical, Earthquakes, Simulation",
    "biography": "Dr. Dobry's research interests include soil dynamics, geotechnical earthquake engineering and geotechnical dynamic centrifuge testing. He was a leading participant of the group that wrote the new seismic provisions on local site amplification in the 1990's now incorporated in U.S. building codes. He is one o, one of 15 interconnected experimental nodes funded by NSF to revolutionize earthquake engineering research in the U.S. He has written more than 200 technical papers and research reports and has directed 40 PhD and MS theses at Rensselaer.",
    "name": "Ricardo Dobry",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/dobryfr-2.jpg",
    "title": "Institute Professor Emeritus, Civil and Environmental Engineering",
    "website": "http://www.nees.rpi.edu"
  },
  "/richard-chapman-0": {
    "name": "Richard Chapman",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Engineering and Science"
  },
  "/robert-block": {
    "name": "Robert Block",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Mechanical, Aerospace and Nuclear Engineering"
  },
  "/robert-maccrone": {
    "name": "Robert MacCrone",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Materials Science and Engineering"
  },
  "/robert-parsons": {
    "name": "Robert Parsons",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Biological Sciences"
  },
  "/robert-whalen": {
    "biography": "Robert Whalen (he/him/his) serves as Lecturer of Music and Conducting at Rensselaer, where he directs the Rensselaer Orchestra, Concert Choir, and Chamber Music Activities. Whalen has also led orchestras on the faculties of the University of Chicago as Director of the Chamber Orchestra and Lewis and Clark College as Interim Director of Orchestral Activities. At the University of Chicago, Whalen launched numerous innovative programs and projects, including an “Explore Classical Music!” alliance with the Berlin Philharmonic, a Graduate Student Composer Fellowship, and the Chamber Orchestra’s first-ever participation the University of Chicago’s Humanities Day Festival. A passionate advocate for contemporary music, Whalen is Co-Founder and Music Director of the Philadelphia-based ensemble SoundLAB. Of his work with SoundLAB, The Philadelphia Inquirer wrote, “The diabolical enthusiasm of...Robert Whalen left me nearly begging for mercy...the artistic equivalent of NASA’s New Horizons spacecraft.” Whalen founded SoundLAB as the Barnes Ensemble in 2016 at the Barnes Foundation, where Whalen also served as Associate Curator for Music, the first curator of music in the 100-year history of the institution. The Barnes Ensemble has performed a diverse array of music by living composers and projects at the intersection of the arts, social justice, and technology. Whalen has collaborated with the Philadelphia Orchestra, the JACK Quartet, the Argus Quartet, the Curtis Institute of Music, the Barnes Foundation, Temple University’s Institute on Disabilities, the Free Library of Philadelphia, the American Philosophical Society, and with composers Chaya Czernowin, Zosha Di Castri, Clara Iannotta, Eric Wubbels, and Augusta Read Thomas. Under Whalen’s direction, SoundLAB was included at the International Contemporary Ensemble’s 2021 Ensemble Evolution Symposium, where industry thought leaders met to discuss and define trends in contemporary performance. Access to music education and supporting young composers is core to Whalen’s work as a conductor and ensemble director. With SoundLAB, engaged over 1,000 students from the City of Philadelphia School District around Ligeti’s Ramifications in the inaugural Barnes Ensemble Festival in 2017. In the same year, Whalen began partnership with the Temple University Institute on Disabilities and the Curtis Institute of Music’s Social Entrepreneurship program that cultivated a musical partnership between artists who use Alternative Assistive Communication and students at the Curtis Institute. This ongoing project has led so far to the premiere of two co-developed song cycles, lost time (2020) and __[no words]__ (2021). Whalen’s conducting has been recognized in the US and internationally. He was personally selected by Lorin Maazel to serve as his Conducting Fellow at the Castleton Festival and has worked as Assistant Conductor at the WDR in Cologne, Germany. In addition to his instrumental work, Whalen also has significant experience working with the choirs. Whalen served as Assistant Chorus Master at Opera Philadelphia beginning in 2019 and has conducted the 64-voice professional chorus in preparations for productions of Prokofiev’s The Love for Three Oranges, Handel’s Semele, and Verdi’s Requiem. During his tenure at the Barnes Foundation, Whalen also served as Director of the Choral Series and Guest Conductor of the Philadelphia Voices in a performance of Einojuhani Rautavaara’s Vigilia, which was praised by the Philadelphia Inquirer: “ …programs this thoughtfully conceived and confidently executed are always needed in even the richest of musical communities.” Whalen has also held the Choral Conducting Fellowship at Yale University’s Norfolk Chamber Music Festival. Whalen earned a BA cum laude from Cornell University, where he studied composition with Pulitzer Prize-winning composer Steven Stucky. Whalen was awarded an MFA in Orchestral Conducting from the Bard College Conservatory of Music, and a DMA from the University of Minnesota, where he studied with Craig Kirchhoff.",
    "name": "Robert Whalen",
    "office": "West 316",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-08/Robert-Whalen-photo-by-Keitaro-Harada-1.jpg",
    "title": "Lecturer, School of Humanities, Arts and  Social Sciences (HASS)"
  },
  "/ron-gutmann": {
    "name": "Ron Gutmann",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-10/RJG-photo-sq.jpg",
    "title": "Professor Emeritus, Electrical, Computer, and Systems Engineering"
  },
  "/ronald-bailey": {
    "biography": "Prior to joining Rensselaer in 1961, Bailey was a NATO Science Fellow at University College, London (1960-61) with Sir R. S. Nyholm. Research Areas: Coordination Chemistry Synthesis and structural characterization of metal coordination compounds provide information on metal-ligand bonding. Two aspects of interest are, first, the modes of bonding of potentially ambidentate ligands with various metal ions, and second, mixed-metal complexes formed by organic ligands that bridge two different metal ions. Infrared and visible-UV spectroscopy, magnetic properties, X-ray diffraction, and electrochemical techniques are used in the characterization.",
    "education": "Ph.D., McGill University, 1960 B.S., University of Manitoba, 1956",
    "name": "Ronald Bailey",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/Bailey_crop.jpg",
    "title": "Professor Emeritus, Chemistry and Chemical Biology",
    "website": "http://www.rpi.edu/dept/chem/chem_faculty/profiles/baily.html"
  },
  "/rosemary-armao": {
    "name": "Rosemary Armao",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Adjunct, Summer Programs"
  },
  "/rushabh-padalia": {
    "area": "Data Science Advanced Analytics Big Data Data Management Business Intelligence Data Integration, Data Governance, and Data Architecture.",
    "biography": "Programs Taught Business Intelligence, Production Analytics, Machine Learning and AI Bio With 22 years of experience in various management and technology consulting positions, Rushabh has an extensive background in data science, machine learning, artificial intelligence, data governance and data architecture. He has worked across multiple industries including healthcare, life sciences, insurance, auto manufacturing and food retail. His reputation is renowned for leading and strategizing enterprise-level transformation initiatives to monetize available data using the power of analytics and thereby reducing operational cost, improving customer satisfaction, and increasing revenue. In his quest to expand his knowledge base in data science best practice, Rushabh completed a Master of Science in Predictive Analytics from Northwestern University. He has worked with top consulting firms like Infosys and Capgemini and has recently joined TheMathCompany, a fast-growing analytics start-up, as a Partner. Other Professional Experience Infosys Capgemini Other Certificates and Licenses Certified Scrum Master Capgemini certified Level 1 Engagement Manager Riversand certified Level 1 Product Information Management (PIM) Professional Certified Software Quality Analyst (CSQA) Infosys certified Project Management Professional American Health Insurance Plans Certified Professional",
    "education": "M.S., Northwestern University, Predictive Analytics B. Eng., Maharaja Sayajirao University Baroda, Metallurgical Engineering",
    "linkedin": "https://www.linkedin.com/in/rushabh-padalia-1252474/",
    "name": "Rushabh Padalia",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/padalr.jpg",
    "title": "Faculty Practitioner, Engineering and Science"
  },
  "/russell-kraft": {
    "area": "embedded systems and control education, electronic manufacturing inspection, high-speed digital circuits",
    "biography": "Senior Lecturer, ECSE, Rensselaer Polytechnic Institute, Troy, NY. Dr. Kraft is responsible for several courses in ECSE and Core Engineering. With many of the studio and lab courses, there is a continuous demand for updating equipment, software, procedures, objectives, and training of support. Current courses include VLSI Design, Applications in Control & Communication, and Embedded Control. Since Feb. 2016 duties have included maintenance and support of the ECSE teaching, research, & private servers and workstation system and its network with EDA tools. This includes tools from Cadence, Mentor, Synopsys, ANSYS, Sonnet, Keysight, Xilinx, Virtutech, and others. IC foundry Process Design Kits are maintained from several manufacturers, including GlobalFoundries, TSMC, ST Micro, CMP-IMAG, Hittite Microwave Corp., AMS, TI, MITLL, NGC, NCSU, and Raytheon.",
    "name": "Russell Kraft",
    "office": "Jonsson 6028",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/russellpkraft.jpg",
    "primary-area": "Embedded Control & Control Systems Lab Development",
    "title": "Sr. Lecturer, Electrical, Computer, and Systems Engineering",
    "website": "https://www.ecse.rpi.edu/~kraftr/"
  },
  "/sam-estabrooks": {
    "name": "Sam Estabrooks",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Lecturer, Communication and Media"
  },
  "/sam-miller": {
    "name": "Sam Miller",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Cognitive Science"
  },
  "/sama-rakhshan-pouri": {
    "education": "- Ph.D. in Nuclear Engineering, VCU, 2017. - M.S. in Mechanical Engineering, VCU, 2015. - M.S. in Chemical Engineering, IUST, 2010.",
    "linkedin": "https://www.linkedin.com/in/pouri",
    "name": "Sama Rakhshan Pouri",
    "office": "5028 Jonsson Engineering Center",
    "orcid": "0000-0002-9525-9095",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-08/Picture41.png",
    "research": "Artificial Neural Intelligence (ANI) - Developed a novel robust signal detection method towards pyroprocessing safeguards. - Implemented the ANI method on uranium and zirconium chloride under different conditions. - Provided a new framework for ANI structure design to bypass the guessing approach and omit trial and error method. - Overcame the overfitting issue by considering the validation check as an ANI assessment. - Attained a final productive predictions structure for both zirconium and uranium chloride. - Enhanced a Graphical User Interest (GUI) to predict CV by providing the proper variables. Diffusion Model - Developed a principal diffusion model in the MATLAB software package to predict the cyclic voltammetry (CV) behavior of uranium and zirconium chloride in Electro refinery (ER) at different conditions. - Decreased the process time to less than 2 minutes and prospered near real-time monitoring. - Enhanced a Graphical User Interest (GUI) to predict the concentration of species as a function of time. - Predicted the probability reactions during the zirconium chloride process using the reverse-engineering CV method. PEM Fuel Cell - Developed a model to describe the water transport phenomena in Proton Exchange Membrane Fuel Cell (PEMFC) through MATLAB software package. - Considered a seven-layer structure of PEMFC for modeling rather than prevalent five layers. - Examined the influences of several crucial system parameters. - Selected proper set of parameters to balance between dehydration and flooding and to increase fuel cell efficiency. - Calculated optimum values for water management including relative humidity of reactant gas, the stoichiometric ratio of reactant gases, the porosity of GDL, and the membrane thickness.",
    "teaching": "Numerical method and programming in Python Nuclear Instruments and Measurements General Physics I Introduction to C Programming",
    "title": "Lecturer, Mechanical, Aerospace and Nuclear Engineering"
  },
  "/sandeep-singh": {
    "biography": "Professor Sandeep Singh joined the Mechanical, Aerospace and Nuclear Engineering department at Rensselaer Polytechnic Institute as a tenure-track Assistant Professor in July 2022. He received his Ph.D. from Texas A&M University in 2022 where his thesis focused on leveraging manifolds and manifold-analogues to generate efficient, ephemeris-driven, piecewise optimal trajectories with eclipse consciousness. Professor Singh was also a graduate fellow during Summer 2020 at Jet Propulsion Laboratory, California Institute of Technology where he spent the previous summer as an intern. During his doctoral studies, he was awarded several university fellowships as well as the John V. Breakwell Student Award conferred by the American Astronautical Society. Prior to starting his doctoral studies, he was employed as a Scientist at Space Applications Center, Indian Space Research Organization where he served as Program Manager for Mechanical Design of the ASTROSAT mission. He also supported efforts for optical assembly design and was responsible for developing innovative, low-risk, space-qualification testing methods like the Force Limited Vibration Testing for fragile remote sensing payloads. He actively serves as a referee for several international journals and conferences and has published several journal articles and conference papers. He serves as a member of the AIAA Astrodynamics Technical Committee and is the RPI representative to the Universities Space Research Association.",
    "education": "Ph.D. Texas A&M University, 2022 B. Tech. Indian Institute of Space Science and Technology, 2013",
    "linkedin": "https://www.linkedin.com/in/sandeep-singh-8a4160137/",
    "name": "Sandeep Singh",
    "office": "JEC 2040",
    "office-hours": "Office Hours Wednesdays 3:00 PM - 5:00 PM",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-10/075A0CED-4882-465D-956D-02D05C2830F1.jpeg",
    "primary-area": "Optimal Trajectory Design for Spacecraft, Autonomous Guidance and Sensor Fusion Technology",
    "research": "Research conducted in the Advanced Space Concepts Laboratory (ASCLab) is in the following areas: Spacecraft Trajectory Design and Optimization Developing Numerical Methods to solve complex Optimal Control problems Manifold Theory and Chaotic Dynamics - Aiding Trajectory Design for Interplanetary Spacecraft Sensor Fusion Technology - Correlating data from different sensors Development of knowledge-rich digital twin models - Generate high-fidelity digital replica of complex physical systems",
    "teaching": "Fall '22: ENGR 2090, Engineering Dynamics Spring '23: MANE 4100, Spaceflight Mechanics",
    "title": "Assistant Professor, Mechanical, Aerospace and Nuclear Engineering",
    "website": "http://www.asclabrpi.com"
  },
  "/sandra-nierzwicki-bauer": {
    "area": "Environmental remote sensing, Invasive species, Water resource management",
    "biography": "Research Interests Molecular studies of microbial and picoeukaryote communities in lakes and rivers. Basic and applied studies of invasive species (zebra mussels). Water resource management and environmental remote sensing. Molecular studies of microbial and picoeukaryote communities in lakes and rivers. The biodiversity of freshwater microbial and picoeukaryotes is still understudied (compared with marine environments) with many more organisms to be discovered. We are using molecular approaches, as well as more traditional culturing and microscopic methodologies to elucidate the structure and function of community composition in Adirondack lakes, some of which have been impacted by acid rain or other pollutants. Basic and applied studies of invasive species (zebra mussels). Zebra mussels are an invasive species that have significant economic and ecological impacts. We are carrying out basic studies on zebra mussels which include; development of molecular probes for their early detection and bioassays for gaining a better understanding of chemical and physical factors that influence or can predict their survival. We are carrying out applied studies that deal with management of zebra mussels once they have been introduced into freshwater bodies, as well as proactive monitoring/detection strategies to help prevent colonization. Water resource management and environmental remote sensing. We are using a combination of traditional and advanced techniques to study human impacts on water resources. The approaches that we are utilizing include automated water chemistry profiling systems, side-scan sonar, satellite remote sensing, solar powered autonomous underwater vehicles (SAUV’s) and hydroacoutics, to name a few.",
    "education": "BS - Microbiology - University of New Hampshire Ph.D. - Microbiology - University of New Hampshire Post Doc. - Molecular Biology - University of Chicago",
    "name": "Sandra Nierzwicki-Bauer",
    "office": "MRC 306",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/nierzwicki-bauer_crop2.jpg",
    "primary-area": "Limnology, Symbiosis, Invasive Species",
    "title": "Associate Director of Darrin Fresh Water Institute (DFWI), Biological Sciences"
  },
  "/sang-han": {
    "name": "Sang In Han",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Electrical, Computer, and Systems Engineering"
  },
  "/santiago-paternain": {
    "area": "Information Science and Systems Control of Dynamical Systems, Machine Learning, Optimization",
    "biography": "He is currently an Assistant Professor in the Department of Electrical Computer and Systems Engineering at the Rensselaer Polytechnic Institute. Prior to joining Rensselaer, Dr. Paternain was a postdoctoral Researcher at the University of Pennsylvania. His research interests lie at the intersection of machine learning and control of dynamical systems. Dr. Paternain was the recipient of the 2017 CDC Best Student Paper Award and the 2019 Joseph and Rosaline Wolfe Best Doctoral Dissertation Award from the Electrical and Systems Engineering Department at the University of Pennsylvania.",
    "name": "Santiago Paternain",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/paters%2540rpi.edu_Santiago_Paternain_SocialMedia.jpg",
    "primary-area": "Control and Autonomy",
    "title": "Assistant Professor, Electrical, Computer, and Systems Engineering",
    "website": "https://ecse.rpi.edu/~paters/"
  },
  "/sebastian-souyris": {
    "biography": "Professor Sebastian Souyris is a tenure-track Assistant Professor of Supply Chain and Analytics, holding the Dean R. Wellington ’83 (Junior) Professorship in Management at the Lally School of Management. Professor Souyris obtained his Ph.D. in information, risk, and operations management from The University of Texas at Austin in 2019. He joined Lally in 2022 from the University of Illinois Urbana-Champaign, where he was a visiting assistant professor at Gies College of Business. In addition, he obtained an M.Phil. in operations management from New York University, and a bachelor’s (industrial engineering) and master’s (operations management) degree from the University of Chile. Sebastian’s research broadly addresses issues related to the challenges and the means of achieving environmental and human sustainability from an operations management perspective, combining data-driven optimization, machine learning, and econometrics. His work has been published in Operations Research, Production and Operations Management, the European Journal of Operations Research, and the INFORMS Journal on Applied Analytics, among other outlets. In addition, he is an INFORMS Franz Edelman Laureate, a finalist of the EURO Excellence in Practice Award, and a prizewinner of the INFORMS Revenue Management and Pricing Practice Award.",
    "education": "Ph.D. in Information, Risk, and Operations Management, The University of Texas at Austin. M.Phil. in Operations Management, New York University. M.S. in Operations Management, University of Chile. B.S. in Industrial Engineering, University of Chile.",
    "linkedin": "https://www.linkedin.com/in/sebastian-souyris/",
    "name": "Sebastian Souyris",
    "office": "Pittsburgh Building 1210",
    "office-hours": "Office Hours Thursdays 12:00 - 13:00 pm",
    "orcid": "0000-0003-3580-8205",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-10/souyrs%40rpi.edu_Sebastian_Souyris_Square_1.jpg",
    "primary-area": "Sustainability, supply chain management, media analytics, data-driven optimization, machine learning.",
    "title": "Assistant Professor of Supply Chain and Analytics, Dean R. Wellington ’83 (Junior) Professor, Lally School of Management",
    "website": "https://faculty.rpi.edu/sebastian-souyris"
  },
  "/selma-cohen": {
    "name": "Selma Cohen",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "School of Architecture"
  },
  "/selmer-bringsjord": {
    "biography": "See http://www.rpi.edu/~brings for Bio.",
    "name": "Selmer Bringsjord",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/Selmer-Bringsjord.jpg",
    "primary-area": "Logic-based AI & CogSci; Formal & Philosophical Foundations of AI & CogSci",
    "title": "Professor, Lab Director, Cognitive Science",
    "website": "http://www.rpi.edu/~brings/"
  },
  "/shaowu-pan": {
    "biography": "Shaowu Pan received his B.E. in Aerospace Engineering and B.S. in Applied Mathe matics from Beihang University, China in 2013. After that, he received M.S. and Ph.D. in Aerospace Engineering and Scientific Computing from the University of Michigan, Ann Arbor in April 2021. Then he started as a Postdoctoral Scholar in the AI Institute in Dynamic Systems at the University of Washington, Seattle from 2021 to 2022. His research interests lie in the intersection between computational fluid dynamics, data-driven modeling of complex systems, scientific machine learning, and dynamical systems. He has published his work in journals like the Journal of Fluid Mechanics, AIAA Journal, SIAM Applied Dynamical Systems, Chaos, Computer Methods in Applied Mechanics and Engineering, Computational Mechanics, etc.",
    "education": "Ph.D., University of Michigan, 2021 M.S.E., University of Michigan, 2015 B.S. & B.E., Beihang University, 2013",
    "name": "Shaowu Pan",
    "office": "JEC 2032",
    "office-hours": "Office Hours M: 2-4pm, JEC 2032",
    "orcid": "0000-0002-2462-362X",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-09/WeChat%20Image_20220914114417-min.jpg",
    "primary-area": "Scientific Machine Learning, Reduced Order Modeling, Turbulence Modeling and Simulation",
    "research": "I'm interested in solving challenging modeling problems in large-scale complex dynamical systems using rigorous mathematical theory combined with scalable computational mathematics. Applications range from UAVs, blood flows, and robotics to rockets. Currently, our group is working on Reduced order modeling of large-scale dynamical systems Physics-informed machine learning Data-driven control of dynamical systems with Koopman operator",
    "teaching": "I am interested in teaching machine learning for science numerical methods fluid dynamics turbulence aerodynamics",
    "title": "Assistant Professor, Mechanical, Aerospace and Nuclear Engineering",
    "website": "http://www.shaowupan.com"
  },
  "/shep-salon": {
    "biography": "Sheppard Salon Graduated with a BE in Engineering Science from the State University of New York at Stony Brook, a Masters Degree in Electrical Engineering from Carnegie Mellon University and a PhD in Electrical Engineering from the University of Pittsburgh. From 1970 to 1978 he was with Westinghouse Electric Corporation in the Large Rotating Apparatus Division in Pittsburgh Pennsylvania. He joined RPI in 1978 where he is now Professor of Electric Power Engineering. Dr. Salon is a registered professional engineer and a Fellow of IEEE.",
    "name": "Shep Salon",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/shepsalon.jpg",
    "title": "Professor Emeritus, Electrical, Computer, and Systems Engineering",
    "website": "http://www.rpi.edu/~salons/"
  },
  "/simona-bortis-schultz": {
    "biography": "Simona Bortis-Schultz is an art director, designer, illustrator, and educator. Her client experience has included advertising, branding and marketing work for national and international clients such as Adidas, Alvin Ailey, Beekman 1802, Blue Q, Pitney Bowes, Nike, and Scholastic Education among others. Having established her design studio, Figure 8, in 2007, she has amassed client work for a range of clients both regionally and globally which have included: APIThinking, The Austen Riggs Center, Callisto Media, Clover Living, Creative Communication Associates/Noodle, The Guthrie Center, Nomad Coworks, Pacific Retail Capital Partners, The Portland Stamp Company, and Storey Publishing. Simona has received numerous awards for art direction, design and illustration both nationally and internationally including: Communication Arts Illustration Annual 2022 (short list), AIGA Upstate NY State of Design, Print Magazine’s Design Annual, FABRICA/Benetton Workshop in Treviso, Italy, The Portland Creative Conference's Rosey Awards, and AIGA Best of Oregon Traveling Design Exhibition. Ms. Bortis-Schultz earned a double Bachelor of Arts in Advertising and Visual Design, from the University of Oregon. She has recently garnered a Masters of Fine Art, October 2022, from The Vermont College of Fine Art in graphic design, working with acclaimed design critics, Natalia Ilyin and Ian Lynam. Simona’s thesis work consisting of research, exhibition and writing, revolves around Women’s Work: The Semiotics of the Romanian Blouse. The Romanian folk garment’s symbols echo Neolithic beginnings as protective signs that chant of preservation, fortitude and survival. Forging ahead and continuing to this day to create a momentous canon of design that unveils the power of the feminine and an unwavering, anthem of resilience. Ms. Bortis-Schultz’s personal work focuses on capturing the magic of visual narrative per community and commercial projects involving supergraphics, surface design, motion design, and any other available mediums. It is Ms. Bortis-Schultz’s wish that more sensitive, mindful, aesthetic experiences could be delivered through visual communication – that graphic design can contribute to creating brighter, more engaged worlds, experiences and communities.",
    "name": "Simona Bortis-Schultz",
    "office": "Troy, NY",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-09/sbortissportrait.jpg",
    "title": "Lecturer, Communication and Media",
    "website": "http://www.figure8design.net/"
  },
  "/stefanie-reay": {
    "biography": "Programs Taught Business Intelligence, Production Analytics Bio Stefanie G. Reay is an analytics and data science professional who specializes in statistical modeling to address business problems. She started her career as an analyst for an internet advertising startup and has since worked and consulted in data analytics, statistical modeling, and information technology in multiple industries. Stefanie completed her Ph.D. as a non-traditional student which uniquely positions her to understand the needs and goals of Rensselaer at Work students.",
    "education": "Ph.D., Information Technology, Capella University M.S., Statistics, University of Connecticut B.S., Mathematics and Statistics, University of Connecticut",
    "linkedin": "https://linkedin.com/in/stefaniegreay",
    "name": "Stefanie Reay",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-08/Stefanie%20Reay_0.jpg",
    "title": "Instructor Mentor, Engineering and Science"
  },
  "/steve-derby": {
    "name": "Steve Derby",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Professor Emeritus, Mechanical, Aerospace and Nuclear Engineering"
  },
  "/steven-cramer": {
    "area": "Bioseparations, Bioprocessing, Chromatography, Proteomics, Microfluidics, Multiscale modeling, Affinity precipitation, Biosensors",
    "biography": "Professor Steven Cramer is the William Weightman Walker Professor of Polymer Engineering at Rensselaer Polytechnic Institute, Troy, New York. His lab is currently conducting research on several areas related to protein-surface interactions and molecular bioprocessing. Many of the past contributions from Professor Cramer and his students to the field of Chromatographic Bioprocessing have had dramatic impacts on the state of the art of this technology and its successful implementation for the biomanufacturing of biological products. Their development of adsorption isotherm models of various classes of protein chromatography (in particular his steric mass action (SMA) model for ion exchange) have enabled the prediction of non-linear protein chromatographic behavior in a range of adsorption systems. These models have been widely employed in academic research and have been utilized worldwide by the biotechnology industry. Their invention of low molecular weight displacers for protein purification represented a paradigm shift in displacement chromatography and included several new modes of mass action and chemically selective displacement chromatography. Their development of a Quantitative Combinatorial Design (QCD) approach has resulted in the discovery of a range of novel displacers and affinity ligands. The Cramer lab was one of the first to employ high throughput screening (HTS) for developing chromatographic bioprocesses which has had a dramatic impact on the way bioprocess development in now carried out in the industry. Their work on the purification of antibodies using both protein A and mimetic resin systems produced a series of papers that had a major impact on the field of antibody purification. Prof. Cramer and his students also pioneered a new methodology for the a-priori prediction of protein binding in chromatographic systems from crystal structure which is now being incorporated by many biopharmaceutical companies for process development. The Cramer lab’s multidisciplinary work using a combination of biophysics, molecular dynamics simulations and chromatography with protein libraries has provided significant insights into the design of novel multimodal chromatographic systems. Recent work on integrated biomanufacturing and expedited process development is having a dramatic impact on how bioprocess development is carried out in the industry. The Cramer lab is now actively involved in several gene therapy downstream biomanufacturing projects, continuous mRNA processing, and several big data modeling efforts. In addition to his focus on downstream bioprocessing, Professor Cramer is known worldwide for his expertise in separations in general. He served as the Editor-in-Chief of the International journal Separations, Science and Technology for 20 years. Professor Cramer has won numerous awards including the ACS National Award in Separations Science and Technology, the ACS BIOT Division’s Michaels Award in the Recovery of Biological Products, and several awards from RPI including the Wiley Distinguished Faculty Award and the School of Engineering Outstanding Professor and Research Excellence Awards. In addition, he has been elected a member of the National Academy of Engineering and a fellow of the American Association for the Advancement of Science, American Institute of Chemical Engineers, the American Chemical Society, and the American Institute for Medical and Biological Engineering. Cramer holds 11 patents and has published extensively in the top peer-reviewed journals in the field with 228 publications and an h index of 54 and 9007 citations. Importantly, the 55 Ph.D. graduates from the Cramer lab have had a significant impact with many of his former students now playing key leadership roles in the state of the art of industrial bioprocessing at most of the major biopharmaceutical and bioseparations companies worldwide as well as academia.",
    "name": "Steven Cramer",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2023-02/cramex.jpg",
    "title": "William Weightman Walker Professor, NAE, Chemical and Biological Engineering",
    "website": "http://www.rpi.edu/~crames"
  },
  "/steven-roecker": {
    "area": "Geophysics, Seismology, Inverse Problems, Subsurface Imaging",
    "biography": "Hello! I am a faculty member (Professor) of the Earth and Environmental Sciences at Rensselaer Polytechnic Institute. Most of what I do academically falls within the realm of Geophysics. Geophysical observations and data analysis techniques are the most effective tools for determining what lies beneath the surface of the Earth. They can be applied at a spectrum of scales, from a few meters to thousands of kilometers, to address a variety of objectives from the detection of salt water invading an aquifer to fundamental questions about how the Earth works. My primary interests in both teaching and research center on the development and application of these geophysical techniques. We have ongoing research projects in a number of fields pertaining to geophysical data analysis and a substantial inventory of equipment for graduate and undergraduate use. We offer courses in field methods that include instruction in both the theory of geophysical data analysis and the application of this theory to problems in the real world. One of these courses is devoted primarily to the evaluation of groundwater problems such as the contamination of aquifers and the identification of buried channels. Others address larger scale problems such as the formation of basins in the western United States and the large mountain belts of central Asia. Among the techniques that we learn about and apply are potential field methods (gravity and magnetics), electrical methods (resistivity and electromagnetism) and seismologic methods (using both controlled sources and earthquakes) and modern surveying techniques using the Global Positioning System. Students are encouraged to become involved in the actual collection, reduction and interpretation of geophysical data. Over the past few years both undergraduate and graduate students have been involved in research projects directed at understanding collisional processes in Taiwan, the Pakistan Himalayas and the Tien Shan, in determining the motion of the Philippine Sea plate, in understanding the evolution of the Basin and Range, and the details of earthquake processes in California. They also have been involved in projects to map underground water channels in upstate New York, waste site evaluations and investigations for evidence of recent seismic activity on the borders of the Adirondacks.",
    "education": "B.S., Georgia Institute of Technology Ph.D., Massachusetts Institute of Technology",
    "name": "Steven Roecker",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/steve_roecker.jpg",
    "title": "Professor, Earth and Environmental Sciences"
  },
  "/thomas-ingram": {
    "name": "Thomas Ingram",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Adjunct Professor, Communication and Media"
  },
  "/todd-przybycien": {
    "name": "Todd Przybycien",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/todd-p.jpg",
    "title": "Professor, Chemical and Biological Engineering"
  },
  "/toh-ming-lu": {
    "area": "Novel materials for advanced electronics and energy applications, Epitaxy of 3D semiconductors on 2D substrates",
    "biography": "Dr. Lu joined RPI in 1982. His interest is on the creation of novel materials for advanced electronics and energy applications. His honors include the 2004 Materials Research Society Medal Award and the 2005 SRC Faculty Leadership Award. He is Fellow of four major societies: American Physical Society, American Vacuum Society, American Association for the Advancement of Sciences, and the Materials Research Society. He served as the Chairman of the Department of Physics, Applied Physics and Astronomy, Rensselaer Polytechnic Institute from 1992 to 1997. Dr. Lu published over 580 papers, 9 books, 12 patents, and graduated 49 Ph.D. students, who have assumed leadership positions in semiconductor companies such as IBM, Intel, AMD, Motorola, Analog, GE, and Chartered Semiconductor.",
    "education": "Ph.D., University of Wisconsin, Madison (Physics)",
    "name": "Toh-Ming Lu",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/Lu.jpg",
    "title": "Ray Palmer Baker Distinguished Professor, Physics, Applied Physics & Astronomy",
    "website": "http://homepages.rpi.edu/~lut/"
  },
  "/victor-robles-sanchez": {
    "name": "Victor Robles Sanchez",
    "portrait": "https://faculty.rpi.edu/modules/custom/rpifaculty/img/user.jpg",
    "title": "Assistant Professor, Physics, Applied Physics & Astronomy"
  },
  "/w-randolph-franklin": {
    "area": "parallel computing, computational geometry, geographic information science, computer aided design, modeling terrain, quantum computing",
    "biography": "W. Randolph Franklin develops and implements fast parallel algorithms on very large geometric datasets in CAD and GIS. He's also modeled and processed large terrain databases, e.g., to compress, to compute hydrography and visibility, and to site observers, and compressed 5D environmental data sets. The algorithms are the fastest in their class. His current research hobby is designing and implementing small, simple, and fast data structures and algorithms for large geometric datasets. Note that efficiency in both space and time can become more important as machines get faster. This research is applicable to computational cartography, computer graphics, computational geometry, and geographic information science. He is now currently studying parallel CAD operations, such as overlaying 3D triangulations (tetrahedrulations). 3D-EPUG-Overlay is an algorithm for exactly computing the intersection (it can also compute general overlays) of pairs of 3D triangulated meshes. Each input mesh may represent a single solid or a more complex polygonal subdivision (representing multiple solids, each one identified by a label). 3D-EPUG-Overlay employs a combination of several techniques to ensure its correctness and efficiency. His last major NSF research project was to understand the mathematics of terrain. Another recent NSF project, together with Cutler and Zimmie, was analyzing how levees erode when overtopped, and testing models in a geotechnical centrifuge. Subprojects include compressing terrain while preserving slope, compressing multidimensional environmental data, and extending partial hydrological data to a complete and consistent river network. Another major project compressed and operated on terrain for DARPA/DSO/GeoStar. The operations included multiple observer siting and path planning. His longterm uneachable goal is to establish terrain modeling on a proper formal foundation that respects its physical properties. Previous positions include: Visitor at Georgia Tech, spring 2016, Program Director, Numeric, Symbolic, and Geometric Computation Program, CISE, National Science Foundation, 2000—2002, visiting positions at Genoa, Laval, CSIRO Canberra, National University of Singapore, 1992—1993, and Visiting Professor, UC Berkeley, 1985—1986. Long resume. Google scholar profile. RPI articles about Franklin and his students. Past students. Publications. Teaching",
    "education": "Ph.D. Applied Mathematics (Harvard University, 1978), A.M. Applied Mathematics (Harvard University, 1975), B.Sc. Computer Science (University of Toronto, 1973), 3 short courses from the Government Affairs Institute at Georgetown University, 2001-2002.",
    "linkedin": "https://www.linkedin.com/in/wrfranklin/",
    "name": "W Randolph Franklin",
    "orcid": "0000-0001-9894-2001",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-08/wrf2013d.jpg",
    "primary-area": "efficient parallel and GPU algorithms for large geometric and spatial datasets",
    "title": "Professor, Electrical, Computer, and Systems Engineering",
    "website": "https://wrfranklin.org/"
  },
  "/wayne-roberge": {
    "biography": "Current interests: evolution of ices in the interstellar medium and solar nebula; computer simulations of multifluid, magnetohydrodynamic (MHD) shock waves; analytic and numerical methods for multifluid MHD; physics of interstellar dust. Funding history: NASA, NSF, NIST, Semiconductor Research Corp. and others.",
    "name": "Wayne Roberge",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-10/Roberge.jpg",
    "primary-area": "origin of life",
    "title": "Professor Emeritus, Physics, Applied Physics & Astronomy",
    "website": "http://www.rpi.edu/~roberw"
  },
  "/william-bill-pearlman": {
    "biography": "Since 1979 Dr. Pearlman has been with the ECSE Department at Rensselaer Polytechnic Institute where he is currently Professor. He had been Director of the Center for Next Generation Video Research, but has relinquished that post to serve as Director of the Center for Image Processing Research (CIPR). During the 1985-1986 academic year, and again for the spring semester in 1993, he was on sabbatical leave as Visiting Professor and Lady Davis Scholar in the Department of Electrical Engineering at the Technion-Israel Institute of Technology, Haifa, Israel. He also held a Visiting Professor Chair at Delft University of Technology in Delft, the Netherlands in 1993, and has been an IBM Visiting Scientist in the IBM-Rio Scientific Center in Rio de Janeiro, Brazil in 1988. During the Summer of 2001, he was in residence as Visiting Professor at the University of Hannover in Hannover, Germany. His research interests are in information theory, source coding theory, image, video and audio coding, and image processing.",
    "name": "William (Bill) Pearlman",
    "orcid": "0000-0002-4978-6812",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2021-12/billpearlman.jpg",
    "title": "Professor Emeritus, Electrical, Computer, and Systems Engineering",
    "website": "http://www.ecse.rpi.edu/~pearlman/"
  },
  "/yinan-wang": {
    "education": "Ph.D., Industrial and Systems Engineering, Virginia Tech., 2022. M.S., Electrical Engineering, Columbia University, 2019. B.S., Electrical Engineering and Automation, Xi’an Jiaotong University, 2017.",
    "name": "Yinan Wang",
    "office": "CII 5213",
    "orcid": "0000-0002-4079-1658",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2022-08/Yinan_Wang.jpg",
    "primary-area": "Engineering-driven machine learning, deep learning, system intelligence, advanced manufacturing.",
    "title": "Assistant Professor, Industrial and Systems Engineering",
    "website": "http://yinanw-rpi.com"
  },
  "/yong-zheng": {
    "name": "Yong Zheng",
    "office": "Low Center for Industrial Innovation (CII) 6125",
    "portrait": "https://faculty.rpi.edu/sites/default/files/2023-03/yongzheng_headshot.jpg",
    "title": "Assistant Professor, Physics, Applied Physics & Astronomy",
    "website": "https://yzhenggit.github.io/yongzheng/"
  }
}