{
  "CSCI-4963": {
    "subj": "CSCI",
    "crse": "4963",
    "name": "APPLICATION PROG USING JAVA",
    "description": "Java is one of the most popular general-purpose modern programming languages in industry. This course focuses on advanced Java features widely employed in practice. Roughly one-third of the course covers object-oriented features of Java and how to use them in software design, as well as corresponding tools that help to establish and maintain the software development life cycle. The second third of the course covers parallel programming, how it can be implemented in Java, and its advantages and limitations. Finally, the third part of the course discusses different database models and provides specific details on how to create Java applications that can use different databases as a data storage option. Special attention is given to noSQL graph databases that, when combined with Java, allow building solutions that are capable of storing, manipulating, and analyzing billion-node scale networks."
  },
  "CSCI-4965": {
    "subj": "CSCI",
    "crse": "4965",
    "name": "AI IN FICTION AND FACT",
    "description": "The class will explore some current AI topics through reading, writing and watching some of the classic fiction that has former people's (mis)perceptions of machine intelligence.  In particular, in her new book, Robotics Through Science Fiction, award-winning roboticist Robin Murphy explores issues in modern AI research through the lens of six famous science fiction stories.  This book presents six classic science fiction stories and commentary that illustrate and explain key algorithms or principles of artificial intelligence. The book is designed to let students grapple with two questions that stir debate even today: how are intelligent robots programmed? and what are the limits of autonomous robots? The stories-by Isaac Asimov, Vernor Vinge, Brian Aldiss, and Philip K. Dick-cover telepresence, behavior-based robotics, deliberation, testing, human-robot interaction, the \"uncanny valley,\" natural language understanding, machine learning, and the ethics of AI and robots."
  },
  "CSCI-4966": {
    "subj": "CSCI",
    "crse": "4966",
    "name": "Learning and Advanced Game AI",
    "description": "Digital gaming is one of the most rapidly developing fields. The effort required for developing games is not trivial. To make a game fun to play, the design of the game levels and/or the AI-driven opponents need to be intelligent and adaptive to the players' strategies and skills. In this course, students will learn and explore using machine learning techniques to automate the design process of digital games. The course will cover basic and advanced topics in Artificial Intelligence and Learning, such as Decision Trees, Neural Networks, Genetic Algorithms, and Reinforcement Learning. Students will gain hands-on experience in applying these techniques in computer games. The course will also introduce psychological theories and studies about people's decision-making and emotional processes and how they are related to the players' experience in games. This course will take the form of a combination of lectures, presentations by students, class discussions, and independent study."
  }
}
