{
  "CSCI-4961": {
    "subj": "CSCI",
    "crse": "4961",
    "name": "MACHINE LEARNING AND OPTIMIZATION",
    "description": "This course provides an introduction to basic concepts in the design and analysis of randomized algorithms, motivated by a focus on the efficient solution of machine learning and optimization problems in the big data setting. Topics: probability distributions, discrete and continuous random variables, independence and conditioning, Chernoff bounds, hashing, Markov Chains and random walks, Monte Carlo methods, dimensionality reduction and low-rank approximation, stochastic gradient descent and quasi-Newton methods."
  },
  "CSCI-6961": {
    "subj": "CSCI",
    "crse": "6961",
    "name": "MACHINE LEARNING AND OPTIMIZATION",
    "description": "This course provides an introduction to basic concepts in the design and analysis of randomized algorithms, motivated by a focus on the efficient solution of machine learning and optimization problems in the big data setting. Topics: probability distributions, discrete and continuous random variables, independence and conditioning, Chernoff bounds, hashing, Markov Chains and random walks, Monte Carlo methods, dimensionality reduction and low-rank approximation, stochastic gradient descent and quasi-Newton methods."
  },
  "CSCI-4964": {
    "subj": "CSCI",
    "crse": "4964",
    "name": "INTRODUCTION TO NETWORK SCIENCE",
    "description": "Networks are everywhere. This course is an interdisciplinary introduction to the emerging science of complex networks and their applications. Topics to be covered include the mathematics of networks, data analysis, network visualization, and applications to ecology, biology, sociology, technology, and other fields. Students will learn about the ongoing research in the field, and ultimately apply their knowledge to conduct their own analysis of a real network data set of their choosing as part of the final project."
  },
  "CSCI-4966": {
    "subj": "CSCI",
    "crse": "4966",
    "name": "Programming for Cognitive Science and Artificial Intelligence",
    "description": "Research in Cognitive Science and Artificial Intelligence (AI) is driven by data. Researchers in these fields collect, manipulate, model and analyze data generated by real-world processes.  Since the amount of data available has grown exponentially, the ability to automate these tasks through computer programs is essential. Specifically, probabilistic and statistical computing are needed to learn from the data. The objectives of this course are for the student to perform exploratory data analysis and to acquire the basics of statistical and machine learning in order to model real-world datasets."
  },
  "CSCI-4968": {
    "subj": "CSCI",
    "crse": "4968",
    "name": "Game AI",
    "description": "This course introduces students to basic concepts and methods of artificial intelligence and their applications in computer games. The topics include decision making, movement, path finding, and AI for human-like characters. This course will take the form of a combination of lectures, presentations by students, class discussions, and independent study."
  },
  "CSCI-4970": {
    "subj": "CSCI",
    "crse": "4970",
    "name": "Learning and Advanced Game AI",
    "description": "Digital gaming is one of the most rapidly developing fields. The effort required for developing games is not trivial. To make a game fun to play, the design of the game levels and/or the AI-driven opponents need to be intelligent and adaptive to the players' strategies and skills. In this course, students will learn and explore using machine learning techniques to automate the design process of digital games. The course will cover basic and advanced topics in Artificial Intelligence and Learning, such as Decision Trees, Neural Networks, Genetic Algorithms, and Reinforcement Learning. Students will gain hands-on experience in applying these techniques in computer games. The course will also introduce psychological theories and studies about people's decision-making and emotional processes and how they are related to the players' experience in games. This course will take the form of a combination of lectures, presentations by students, class discussions, and independent study."
  }
}
