{
  "ARCH-1200": {
    "crse": "1200",
    "description": "Two-week introduction to architecture for rising high school juniors and seniors includes morning programs and introductory lectures in history and theory of architecture, computing and simulation, freehand and extreme drawing, building ecologies, building conservation, and construction systems. There will be field trips and career counseling. Afternoons will have individually critiqued (tutored) design studios, group and individual projects, reviews, and public presentation. Acts as an opportunity for career discovery to decide whether a design education in architecture is appropriate. Summer term annually. Dates TBA. 9:00 am - 4:00 pm.",
    "name": "Beginners Architecture Career Discovery Program",
    "source": "Acalog",
    "subj": "ARCH"
  },
  "ARCH-6860": {
    "crse": "6860",
    "description": "This course covers the fundamentals of psychoacoustics with a focus on Architectural Acoustics. Topics include the functional overview of the auditory system, loudness, pitch, timbre perception, masking, binaural hearing, auditory scene analysis, multi-modal integration, and auditory perception in rooms. Required signal processing methods will be covered as well. The graduate-level course requires an extensive individual project and more advanced analysis.",
    "name": "Applied Psychoacoustics",
    "source": "Acalog",
    "subj": "ARCH"
  },
  "ARTS-6160": {
    "crse": "6160",
    "description": "This course assumes knowledge and experience in computer music applications and performance. It is directed to undergraduate students as an upper-level seminar guiding their progress through the composition of a significant musical work. The class is divided between a group seminar, focusing on aesthetic, theoretical, and technical issues, and a workshop/lab in performance, computer applications, and composition.",
    "name": "Advanced Computer Music Composition and Performance",
    "source": "Acalog",
    "subj": "ARTS"
  },
  "BIOL-4700": {
    "crse": "4700",
    "description": "Freshwater ecology is the quantitative examination of major biological fresh water communities. Course discussions will delineate the physical and chemical regimes under which aquatic organisms exist. Basic limnological processes are studied to define aquatic systems of differing physical characteristics. Nutrient chemistry analyses of waters of varying acidity, alkalinity, and chemical loadings are related to their trophic status. Lecture and Laboratory are taught at the Darrin Fresh Water Institute at Lake George with field activities at various locations in the Adirondacks. The course includes extensive hands-on laboratory work, as well as the writing of in-depth reports. This is a communication-intensive course.",
    "name": "Freshwater Ecology",
    "source": "Acalog",
    "subj": "BIOL"
  },
  "BUSN-6300": {
    "crse": "6300",
    "description": "In this course, students develop their capacity as leaders in a dynamic world, planning and executing strategy to achieve organizational objectives. Students develop frameworks for making decisions that enhance the value creation of their organization while demonstrating full commitment to ethical decisions and outcomes. Students learn to plan and execute to achieve goals fully and effectively. Students develop their mentorship capacities to manage and lead the human elements of their organizations. NOTE: Students must attend a Rensselaer Leadership Experience (RLE) as part of this course",
    "name": "Leaders and Strategy",
    "source": "Acalog",
    "subj": "BUSN"
  },
  "CHME-4460": {
    "crse": "4460",
    "description": "This course will focus on 1) designing, engineering, and selecting proteins and other biomolecules with desired functional and biophysical properties (high thermal stability, high solubility, low propensity to aggregate), and 2) characterizing thermodynamic and kinetic properties (folding, oligomerization, and self-association) of these biomolecules.",
    "name": "Biomolecular Engineering",
    "source": "Acalog",
    "subj": "CHME"
  },
  "CIVL-6900": {
    "crse": "6900",
    "description": "Civil and environmental engineering graduate students present seminars about their research to an audience composed of students and faculty, and participate in discussions about the research of others. The course consists of one-hour weekly meetings. The faculty member in charge of the course helps the students develop their presentation and communication skills. M.S. and Ph.D. students are required to take this course once before completion of their terminal degree. This course is not required for M. Eng. students not doing a thesis or project.",
    "name": "Civil and Environmental Engineering Graduate Seminar",
    "source": "Acalog",
    "subj": "CIVL"
  },
  "CSCI-4030": {
    "crse": "4030",
    "description": "State-of-the-art in contemporary algorithm design, randomized algorithms are algorithms that use randomness as part of their functioning. They are typically simple, often easy to analyze, and work well in practice. They have numerous applications in many fields of computer science and mathematics. Randomized algorithms represent an active and vibrant research area with many exciting new results contributed every year.",
    "name": "Randomized Algorithms",
    "source": "Acalog",
    "subj": "CSCI"
  },
  "ECON-4290": {
    "crse": "4290",
    "description": "Students will learn about markets related to healthcare, insurance, biopharmaceuticals, and medical devices. Examine economic issues, models and quantitative analysis related to firms' activities in areas such as innovation, R&D expenditures, patenting, pricing, mergers and acquisitions, and competition in markets. Examine the role played by health insurance systems. Study the economic implications of regulations, such as those by the U.S. FDA. Economic and policy aspects will be examined within the context of the U.S. healthcare sector, along with selected comparisons to European national healthcare systems.",
    "name": "Economics of Biotech and Medical Innovations",
    "source": "Acalog",
    "subj": "ECON"
  },
  "ECSE-4560": {
    "crse": "4560",
    "description": "A broad introduction to modern communication systems, with applications to emerging wireless communication technologies. Fundamental principles of wireless channel modeling; performance limits of communication systems; analog and digital modulation techniques; source and channel coding; multi-antenna communication systems; multi-carrier modulation; multi-user communication systems. Emerging wireless technologies such as MIMO and OFDM, with applications to cellular and wireless LAN communication standards. Complemented with computational exercises.",
    "name": "Modern Communication Systems",
    "source": "Acalog",
    "subj": "ECSE"
  },
  "ENGR-4100": {
    "crse": "4100",
    "description": "Investigates business-related considerations in successfully commercializing new technology in a new venture or within an existing enterprise: market and customer analysis, beating the competition, planning and managing for profitability, high-tech marketing and sales, and business partnerships and acquisitions. Not a general management course; focuses explicitly on what is relevant for engineers and scientists working in a commercial environment. For junior/senior undergraduate or graduate students.",
    "name": "Business Issues for Engineers and Scientists",
    "source": "Acalog",
    "subj": "ENGR"
  },
  "ERTH-6230": {
    "crse": "6230",
    "description": "Climate change is driving an increase in extreme weather events (storms, drought, wildfire). These events manifest as episodic disturbances to affected ecosystems that can alter carbon and nutrient fluxes and reorganize biogeochemical cycles. This course is an in-depth study of current, peer-reviewed literature addressing biogeochemical responses to environmental disturbance and extreme events across varied spatial and temporal scales.",
    "name": "Biogeochemical Impacts of Extreme Events",
    "source": "Acalog",
    "subj": "ERTH"
  },
  "ISCI-4610": {
    "crse": "4610",
    "description": "Students taking the Minor in Astrobiology are required to complete 3 credits of research in an Astrobiology-related discipline with a RARE-affiliated faculty member. Concurrent or in a later semester, students will enroll in ISCI 4610 with the same faculty member to prepare their research results for dissemination.",
    "name": "Capstone in Astrobiology",
    "source": "Acalog",
    "subj": "ISCI"
  },
  "LANG-4455": {
    "crse": "4455",
    "description": "This course introduces students to the techniques and socio-cultural significance of Chinese calligraphy as they explore its history, aesthetics, and practice. Students will gain hands-on practice with brush and ink, developing fundamental calligraphic skills as they analyze historical and contemporary examples of the art from both cultural studies and artistic perspectives. Finally, they will learn about the wellness benefits of calligraphic practice, including improved mental health, concentration, posture, and spiritual calmness. Taught in English, this course requires no prior knowledge of Chinese.",
    "name": "Chinese Calligraphy",
    "source": "Acalog",
    "subj": "LANG"
  },
  "MANE-4780": {
    "crse": "4780",
    "description": "Climatology, Solar vs. Wind Energy, Earth's rotational and Coriolis effects, Wind Speed Statistics: Histograms, Weibull, Available Energy, Aerodynamics, Wake effects, Thrust and Power with objects in Wind flow, Betz Limit, Wind Shear and Ground Effects; Blade aero/structural design, and manufacture; OEM Wind Turbine Designs/Architectures, and capturing Wind Energy via Direct Drive-Generators/Gearbox-driven; Pitch/Yaw Controls, Tower designs. The back-end interface with the Grid, Wind Farm development and Supervisory Controls; Cost Of Energy: Wind vs. Fossil Fuel technologies.",
    "name": "Wind Energy Engineering",
    "source": "Acalog",
    "subj": "MANE"
  },
  "MATH-4100": {
    "crse": "4100",
    "description": "The theory underlying vector spaces, algebra of subspaces, bases; linear transformations, dual spaces; eigenvectors, eigenvalues, minimal polynomials, canonical forms of linear transformations; inner products, adjoints, orthogonal projections, and complements.",
    "name": "Linear Algebra",
    "source": "Acalog",
    "subj": "MATH"
  },
  "MGMT-4390": {
    "crse": "4390",
    "description": "This course presents the concepts, techniques, and tools for managing global projects. The role of the project manager is examined, together with techniques for controlling cost, schedules, and performance parameters. Course deliverables are designed to develop fundamental skills needed by project managers in today's global competitive business environment. Topics include project leadership, project lifecycle methodology, business process development, benchmarking, project planning, execution and control, procurement, communications, organizational change, customer acceptance, performance metrics and project closure. This is a communication-intensive course.",
    "name": "International Project Management",
    "source": "Acalog",
    "subj": "MGMT"
  },
  "MGMT-7730": {
    "crse": "7730",
    "description": "Main course objective is to introduce students to basic economics principles and establish economics as a managerial decision-making framework. The course will draw on economic analysis of such concepts as cost, demand, profit, competition, pricing strategy, and market protection and tie them to operational business decisions.",
    "name": "Economics and Institutions",
    "source": "Acalog",
    "subj": "MGMT"
  },
  "PHIL-4990": {
    "crse": "4990",
    "description": "Students conduct original scholarly projects: original research, theoretical or analytical reviews of the literature, or computer simulations. Working either alone or in groups, students prepare written reports relating to this project, under the supervision of a faculty member.",
    "name": "Capstone Experience in Philosophy",
    "source": "Acalog",
    "subj": "PHIL"
  },
  "STSO-4560": {
    "crse": "4560",
    "description": "In this course, students will engage with a variety of perspectives in science and technology studies, feminist theory, queer and transgender theory, cultural studies, science fiction, and other fields that explore how science and technology reciprocally contribute to and are shaped by cultural norms around gender. Students reflect on their own experiences with gender expectations and formulate their own questions and develop a research project over the course of the semester.",
    "name": "Gender, Science, and Technology",
    "source": "Acalog",
    "subj": "STSO"
  },
  "ECSE-4964": {
    "subj": "ECSE",
    "crse": "4964",
    "name": "Computational Creativity",
    "description": "Creative applications of generative artificial intelligence have exploded in the past year, including image generation tools like Stable Diffusion and DALLE-2 and text generation tools like Chat-GPT3.  This course will survey the theoretical foundations of these tools, focusing on generative models and self-supervised learning, as well as explore the historical and ethical considerations involving the procedural generation of art.  Students will apply cutting-edge tools for generating creative content and critique each other’s work."
  },
  "PHIL-4960": {
    "subj": "PHIL",
    "crse": "4960",
    "name": "Non-Classical Logic",
    "description": "This course provides an introduction to the philosophical and formal aspects of several families of non-classical logics that provide alternatives to classical (Russell-Frege) logic. Emphases will include philosophical objections to particular components of classical logic and how alternative formalizations of reasoning have emerged in order to accommodate these objections. In particular, topics to be covered will include logics of strict implication, intuitionistic logic, relevant logic, and fuzzy logic."
  },
  "CSCI-2960": {
    "crse": "2960",
    "description": "Cross-listed from: ITWS 2110 [see RPI catalog]",
    "name": "Web Systems Development",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-2961": {
    "crse": "2961",
    "description": "RCOS (Rensselaer Center for Open Source) is an eclectic group of undergraduate students that embark on individual and team-based open source projects, primarily software, but also open hardware projects. Many new projects are introduced each semester, though many ongoing and \"higher-profile\" projects are also undertaken. Overall, students are required to work on and contribute to open source projects, in particular through multiple commits (commit early, commit often), maintaining a blog, presenting their work and/or specific technical talks, mentoring other projects, etc. This project-based \"course\" may be taken multiple semesters, with grades based on clear effort and contributions rather than a project that meets all of its requirements.",
    "name": "Rcos",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4960": {
    "crse": "4960",
    "description": "The course will explore advanced topics in machine learning, including current research and emerging techniques. The seminar will consist of both lectures and discussion sessions, where students will have the opportunity to explore current research papers and present on a research topic of their choice or their own findings. The seminar will also provide students with the opportunity to develop their research and presentation skills. By the end of the seminar, students will have gained a deeper understanding of advanced topics in machine learning and developed the skills necessary to contribute to ongoing research in the field. If you have not passed the prerequisite and are interested in taking this course, please contact the instructor in August.",
    "name": "Machine Learning Seminar",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4961": {
    "crse": "4961",
    "description": "This course is an interdisciplinary introduction to network resilience and its applications in both science and engineering. Classes will interchangeably present the chapters from these textbooks with an emphasis on the current active research papers related to network resilience, robustness, stability, and control. Topics to be covered include the network theory, dynamical systems, data analysis, and applications to biology, ecology, sociology, technology, and other fields. Students will learn about the ongoing research in the area and ultimately apply their knowledge to conduct their research by analyzing real network data set of their choosing as part of the final project.",
    "name": "Network Resilience",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4962": {
    "crse": "4962",
    "description": "This course is a second course in machine learning that provides an in-depth introduction to the optimization algorithms and neural network architectures used in modern large-scale machine learning and optimization.",
    "name": "Machine Learning And Optimization",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4963": {
    "crse": "4963",
    "description": "This is an introductory course on the theory and practice of reinforcement learning (RL). We will start by discussing the RL/control problem as it applies to autonomous systems. We will cover Markov decision processes, policy/value iteration, policy gradient methods, actor-critic, deep RL, as well as on-policy and off-policy learning. We will also discuss some supervised learning settings such as linear regression and deep learning, especially as they pertain to deep RL. Students taking this course will get exposure to image classification and several reinforcement learning benchmarks, such as mountain car and the inverted pendulum.",
    "name": "Reinforcement Learning",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4964": {
    "crse": "4964",
    "description": "This research seminar-oriented course will explore the synergistic combination of Artificial Intelligence (AI) and Blockchain technologies. A primary focus of the course is to identify the disruptors in the two technologies from a research lens. Specifically, we intend to discuss how leveraging blockchain technology can benefit AI and how applying AI can enhance the capabilities of blockchain technology. Furthermore, students are encouraged to think about the impact of these two technologies on society. Topics discussed in the course include blockchain fundamentals, smart contracts, web3, federated machine learning, and decentralized applications that combine AI and blockchain technologies.",
    "name": "Ai And Blockchain",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4965": {
    "crse": "4965",
    "description": "This course will study the application of artificial intelligence techniques to problems in environmental conservation. While a variety of modalities will be considered, the focus will primarily be on image and video data, gathered from a variety of sources. The entire sequence of activities will be discussed - problem formulation, data collection and curation, algorithm training and testing, and system deployment. Along the way, FAIR and CARE principles for AI and data will be discussed, and other societal impacts will be addressed. Conservation applications will also be used to examine the state of the art in AI. Students enrolled in the course are expected to have taken a course in AI and/or Machine Learning. Requirements will include active class participation, short homework assignments, a formal presentation, and a final technical project.",
    "name": "Ai For Conservation",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4966": {
    "crse": "4966",
    "description": "This is a research-oriented seminar course on the theory and application of computational techniques and computational thinking in preference representation and aggregation. Applications include but are not limited to: voting, fair division, rating systems, recommender systems, learning to rank.",
    "name": "Economics And Computation",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4967": {
    "crse": "4967",
    "description": "Cybersecurity is one of the fastest growing fields in computer science. Modern Binary Exploitation will focus on teaching practical offensive security skills in binary exploitation and reverse engineering. Through a combination of interactive lectures, hands on labs, and guest speakers from industry, the course will offer students a rare opportunity to explore involved subjects in a rapidly evolving field. The course will start off by covering basic x86 reverse engineering, vulnerability analysis, and classical forms of Linux-based userland binary exploitation. It will then transition into defenses found on modern systems (Canaries, DEP, ASLR, RELRO, Fortify Source, etc) and the techniques used to defeat them. Time permitting, the course will also cover other subjects in exploitation including kernel-land and Windows based exploitation, as well as static analysis of binaries.",
    "name": "Modern Binary Exploitation",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4969": {
    "crse": "4969",
    "description": "Cross-listed as: COGS 4962",
    "name": "Information Retrieval",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4970": {
    "crse": "4970",
    "description": "The class will explore some current AI topics through reading, writing and watching some of the classic fiction that has former people's (mis)perceptions of machine intelligence.  In particular, in her new book, Robotics Through Science Fiction, award-winning roboticist Robin Murphy explores issues in modern AI research through the lens of six famous science fiction stories.  This book presents six classic science fiction stories and commentary that illustrate and explain key algorithms or principles of artificial intelligence. The book is designed to let students grapple with two questions that stir debate even today: how are intelligent robots programmed? and what are the limits of autonomous robots? The stories-by Isaac Asimov, Vernor Vinge, Brian Aldiss, and Philip K. Dick-cover telepresence, behavior-based robotics, deliberation, testing, human-robot interaction, the \"uncanny valley,\" natural language understanding, machine learning, and the ethics of AI and robots.",
    "name": "Ai In Fiction And Fact",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4971": {
    "crse": "4971",
    "description": "This course is a broad introduction to the interface of theoretical computer science and game theory, and will focus especially on game theory in network and computer science applications. The emphasis will be on conceptual ideas and algorithmic techniques.  No prior knowledge of game theory or economics will be assumed, but a high level of comfort with proofs and mathematical concepts will be required. Please email the instructor if you wish to be enrolled into the course.",
    "name": "Algorithmic Game Theory",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4972": {
    "crse": "4972",
    "description": "Cross-listed from: PHIL 4140/4961",
    "name": "Intermediate Formal Logic & Ai",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4974": {
    "crse": "4974",
    "description": "TBD",
    "name": "Neurosymbolic Knowledge Graphs",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4975": {
    "crse": "4975",
    "description": "Deep Learning on Graphs is a course to explore state-of-the-art techniques in graph representation learning, with a particular emphasis on the emerging potential of Graph Neural Networks (GNNs). Graphs are widely used to represent data across various domains, including social science, linguistics, chemistry, biology, and physics, and GNNs have proven to be highly effective in facilitating computational tasks on these graphs. This course will cover topics such as network embedding, GNNs, properties of GNNs, and diverse applications of GNNs. In addition to lectures, students will be expected to read and discuss relevant literature, deliver presentations, and participate in research projects related to the subject matter.",
    "name": "Deep Learning On Graphs",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6960": {
    "crse": "6960",
    "description": "The course will explore advanced topics in machine learning, including current research and emerging techniques. The seminar will consist of both lectures and discussion sessions, where students will have the opportunity to explore current research papers and present on a research topic of their choice or their own findings. The seminar will also provide students with the opportunity to develop their research and presentation skills. By the end of the seminar, students will have gained a deeper understanding of advanced topics in machine learning and developed the skills necessary to contribute to ongoing research in the field. If you have not passed the prerequisite and are interested in taking this course, please contact the instructor in August.",
    "name": "Machine Learning Seminar",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6961": {
    "crse": "6961",
    "description": "This course is an interdisciplinary introduction to network resilience and its applications in both science and engineering. Classes will interchangeably present the chapters from these textbooks with an emphasis on the current active research papers related to network resilience, robustness, stability, and control. Topics to be covered include the network theory, dynamical systems, data analysis, and applications to biology, ecology, sociology, technology, and other fields. Students will learn about the ongoing research in the area and ultimately apply their knowledge to conduct their research by analyzing real network data set of their choosing as part of the final project.",
    "name": "Network Resilience",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6962": {
    "crse": "6962",
    "description": "This course is a second course in machine learning that provides an in-depth introduction to the optimization algorithms and neural network architectures used in modern large-scale machine learning and optimization.",
    "name": "Machine Learning And Optimization",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6963": {
    "crse": "6963",
    "description": "This is an introductory course on the theory and practice of reinforcement learning (RL). We will start by discussing the RL/control problem as it applies to autonomous systems. We will cover Markov decision processes, policy/value iteration, policy gradient methods, actor-critic, deep RL, as well as on-policy and off-policy learning. We will also discuss some supervised learning settings such as linear regression and deep learning, especially as they pertain to deep RL. Students taking this course will get exposure to image classification and several reinforcement learning benchmarks, such as mountain car and the inverted pendulum.",
    "name": "Reinforcement Learning",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6964": {
    "crse": "6964",
    "description": "This research seminar-oriented course will explore the synergistic combination of Artificial Intelligence (AI) and Blockchain technologies. A primary focus of the course is to identify the disruptors in the two technologies from a research lens. Specifically, we intend to discuss how leveraging blockchain technology can benefit AI and how applying AI can enhance the capabilities of blockchain technology. Furthermore, students are encouraged to think about the impact of these two technologies on society. Topics discussed in the course include blockchain fundamentals, smart contracts, web3, federated machine learning, and decentralized applications that combine AI and blockchain technologies.",
    "name": "Ai And Blockchain",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6965": {
    "crse": "6965",
    "description": "This course will study the application of artificial intelligence techniques to problems in environmental conservation. While a variety of modalities will be considered, the focus will primarily be on image and video data, gathered from a variety of sources. The entire sequence of activities will be discussed - problem formulation, data collection and curation, algorithm training and testing, and system deployment. Along the way, FAIR and CARE principles for AI and data will be discussed, and other societal impacts will be addressed. Conservation applications will also be used to examine the state of the art in AI. Students enrolled in the course are expected to have taken a course in AI and/or Machine Learning. Requirements will include active class participation, short homework assignments, a formal presentation, and a final technical project.",
    "name": "Ai For Conservation",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6966": {
    "crse": "6966",
    "description": "This is a research-oriented seminar course on the theory and application of computational techniques and computational thinking in preference representation and aggregation. Applications include but are not limited to: voting, fair division, rating systems, recommender systems, learning to rank.",
    "name": "Economics And Computation",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6968": {
    "crse": "6968",
    "description": "TBD",
    "name": "Neurosymbolic Knowledge Graphs",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6971": {
    "crse": "6971",
    "description": "This course is a broad introduction to the interface of theoretical computer science and game theory, and will focus especially on game theory in network and computer science applications. The emphasis will be on conceptual ideas and algorithmic techniques.  No prior knowledge of game theory or economics will be assumed, but a high level of comfort with proofs and mathematical concepts will be required. Please email the instructor if you wish to be enrolled into the course.",
    "name": "Algorithmic Game Theory",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6975": {
    "crse": "6975",
    "description": "Deep Learning on Graphs is a course to explore state-of-the-art techniques in graph representation learning, with a particular emphasis on the emerging potential of Graph Neural Networks (GNNs). Graphs are widely used to represent data across various domains, including social science, linguistics, chemistry, biology, and physics, and GNNs have proven to be highly effective in facilitating computational tasks on these graphs. This course will cover topics such as network embedding, GNNs, properties of GNNs, and diverse applications of GNNs. In addition to lectures, students will be expected to read and discuss relevant literature, deliver presentations, and participate in research projects related to the subject matter.",
    "name": "Deep Learning On Graphs",
    "source": "CSCI topics",
    "subj": "CSCI"
  }
}