{
  "ARCH-1200": {
    "crse": "1200",
    "description": "Two-week introduction to architecture for rising high school juniors and seniors includes morning programs and introductory lectures in history and theory of architecture, computing and simulation, freehand and extreme drawing, building ecologies, building conservation, and construction systems. There will be field trips and career counseling. Afternoons will have individually critiqued (tutored) design studios, group and individual projects, reviews, and public presentation. Acts as an opportunity for career discovery to decide whether a design education in architecture is appropriate. Summer term annually. Dates TBA. 9:00 am - 4:00 pm.",
    "name": "Beginners Architecture Career Discovery Program",
    "source": "Acalog",
    "subj": "ARCH"
  },
  "ARCH-6860": {
    "crse": "6860",
    "description": "This course covers the fundamentals of psychoacoustics with a focus on Architectural Acoustics. Topics include the functional overview of the auditory system, loudness, pitch, timbre perception, masking, binaural hearing, auditory scene analysis, multi-modal integration, and auditory perception in rooms. Required signal processing methods will be covered as well. The graduate-level course requires an extensive individual project and more advanced analysis.",
    "name": "Applied Psychoacoustics",
    "source": "Acalog",
    "subj": "ARCH"
  },
  "ARTS-6160": {
    "crse": "6160",
    "description": "This course assumes knowledge and experience in computer music applications and performance. It is directed to undergraduate students as an upper-level seminar guiding their progress through the composition of a significant musical work. The class is divided between a group seminar, focusing on aesthetic, theoretical, and technical issues, and a workshop/lab in performance, computer applications, and composition.",
    "name": "Advanced Computer Music Composition and Performance",
    "source": "Acalog",
    "subj": "ARTS"
  },
  "BIOL-4700": {
    "crse": "4700",
    "description": "Freshwater ecology is the quantitative examination of major biological fresh water communities. Course discussions will delineate the physical and chemical regimes under which aquatic organisms exist. Basic limnological processes are studied to define aquatic systems of differing physical characteristics. Nutrient chemistry analyses of waters of varying acidity, alkalinity, and chemical loadings are related to their trophic status. Lecture and Laboratory are taught at the Darrin Fresh Water Institute at Lake George with field activities at various locations in the Adirondacks. The course includes extensive hands-on laboratory work, as well as the writing of in-depth reports. This is a communication-intensive course.",
    "name": "Freshwater Ecology",
    "source": "Acalog",
    "subj": "BIOL"
  },
  "BUSN-6300": {
    "crse": "6300",
    "description": "In this course, students develop their capacity as leaders in a dynamic world, planning and executing strategy to achieve organizational objectives. Students develop frameworks for making decisions that enhance the value creation of their organization while demonstrating full commitment to ethical decisions and outcomes. Students learn to plan and execute to achieve goals fully and effectively. Students develop their mentorship capacities to manage and lead the human elements of their organizations. NOTE: Students must attend a Rensselaer Leadership Experience (RLE) as part of this course",
    "name": "Leaders and Strategy",
    "source": "Acalog",
    "subj": "BUSN"
  },
  "CHME-4460": {
    "crse": "4460",
    "description": "This course will focus on 1) designing, engineering, and selecting proteins and other biomolecules with desired functional and biophysical properties (high thermal stability, high solubility, low propensity to aggregate), and 2) characterizing thermodynamic and kinetic properties (folding, oligomerization, and self-association) of these biomolecules.",
    "name": "Biomolecular Engineering",
    "source": "Acalog",
    "subj": "CHME"
  },
  "CIVL-6900": {
    "crse": "6900",
    "description": "Civil and environmental engineering graduate students present seminars about their research to an audience composed of students and faculty, and participate in discussions about the research of others. The course consists of one-hour weekly meetings. The faculty member in charge of the course helps the students develop their presentation and communication skills. M.S. and Ph.D. students are required to take this course once before completion of their terminal degree. This course is not required for M. Eng. students not doing a thesis or project.",
    "name": "Civil and Environmental Engineering Graduate Seminar",
    "source": "Acalog",
    "subj": "CIVL"
  },
  "CSCI-4030": {
    "crse": "4030",
    "description": "State-of-the-art in contemporary algorithm design, randomized algorithms are algorithms that use randomness as part of their functioning. They are typically simple, often easy to analyze, and work well in practice. They have numerous applications in many fields of computer science and mathematics. Randomized algorithms represent an active and vibrant research area with many exciting new results contributed every year.",
    "name": "Randomized Algorithms",
    "source": "Acalog",
    "subj": "CSCI"
  },
  "ECON-4290": {
    "crse": "4290",
    "description": "Students will learn about markets related to healthcare, insurance, biopharmaceuticals, and medical devices. Examine economic issues, models and quantitative analysis related to firms' activities in areas such as innovation, R&D expenditures, patenting, pricing, mergers and acquisitions, and competition in markets. Examine the role played by health insurance systems. Study the economic implications of regulations, such as those by the U.S. FDA. Economic and policy aspects will be examined within the context of the U.S. healthcare sector, along with selected comparisons to European national healthcare systems.",
    "name": "Economics of Biotech and Medical Innovations",
    "source": "Acalog",
    "subj": "ECON"
  },
  "ECSE-4560": {
    "crse": "4560",
    "description": "A broad introduction to modern communication systems, with applications to emerging wireless communication technologies. Fundamental principles of wireless channel modeling; performance limits of communication systems; analog and digital modulation techniques; source and channel coding; multi-antenna communication systems; multi-carrier modulation; multi-user communication systems. Emerging wireless technologies such as MIMO and OFDM, with applications to cellular and wireless LAN communication standards. Complemented with computational exercises.",
    "name": "Modern Communication Systems",
    "source": "Acalog",
    "subj": "ECSE"
  },
  "ENGR-4100": {
    "crse": "4100",
    "description": "Investigates business-related considerations in successfully commercializing new technology in a new venture or within an existing enterprise: market and customer analysis, beating the competition, planning and managing for profitability, high-tech marketing and sales, and business partnerships and acquisitions. Not a general management course; focuses explicitly on what is relevant for engineers and scientists working in a commercial environment. For junior/senior undergraduate or graduate students.",
    "name": "Business Issues for Engineers and Scientists",
    "source": "Acalog",
    "subj": "ENGR"
  },
  "ERTH-6230": {
    "crse": "6230",
    "description": "Climate change is driving an increase in extreme weather events (storms, drought, wildfire). These events manifest as episodic disturbances to affected ecosystems that can alter carbon and nutrient fluxes and reorganize biogeochemical cycles. This course is an in-depth study of current, peer-reviewed literature addressing biogeochemical responses to environmental disturbance and extreme events across varied spatial and temporal scales.",
    "name": "Biogeochemical Impacts of Extreme Events",
    "source": "Acalog",
    "subj": "ERTH"
  },
  "ISCI-4610": {
    "crse": "4610",
    "description": "Students taking the Minor in Astrobiology are required to complete 3 credits of research in an Astrobiology-related discipline with a RARE-affiliated faculty member. Concurrent or in a later semester, students will enroll in ISCI 4610 with the same faculty member to prepare their research results for dissemination.",
    "name": "Capstone in Astrobiology",
    "source": "Acalog",
    "subj": "ISCI"
  },
  "LANG-4455": {
    "crse": "4455",
    "description": "This course introduces students to the techniques and socio-cultural significance of Chinese calligraphy as they explore its history, aesthetics, and practice. Students will gain hands-on practice with brush and ink, developing fundamental calligraphic skills as they analyze historical and contemporary examples of the art from both cultural studies and artistic perspectives. Finally, they will learn about the wellness benefits of calligraphic practice, including improved mental health, concentration, posture, and spiritual calmness. Taught in English, this course requires no prior knowledge of Chinese.",
    "name": "Chinese Calligraphy",
    "source": "Acalog",
    "subj": "LANG"
  },
  "MANE-4780": {
    "crse": "4780",
    "description": "Climatology, Solar vs. Wind Energy, Earth's rotational and Coriolis effects, Wind Speed Statistics: Histograms, Weibull, Available Energy, Aerodynamics, Wake effects, Thrust and Power with objects in Wind flow, Betz Limit, Wind Shear and Ground Effects; Blade aero/structural design, and manufacture; OEM Wind Turbine Designs/Architectures, and capturing Wind Energy via Direct Drive-Generators/Gearbox-driven; Pitch/Yaw Controls, Tower designs. The back-end interface with the Grid, Wind Farm development and Supervisory Controls; Cost Of Energy: Wind vs. Fossil Fuel technologies.",
    "name": "Wind Energy Engineering",
    "source": "Acalog",
    "subj": "MANE"
  },
  "MATH-4100": {
    "crse": "4100",
    "description": "The theory underlying vector spaces, algebra of subspaces, bases; linear transformations, dual spaces; eigenvectors, eigenvalues, minimal polynomials, canonical forms of linear transformations; inner products, adjoints, orthogonal projections, and complements.",
    "name": "Linear Algebra",
    "source": "Acalog",
    "subj": "MATH"
  },
  "MGMT-4390": {
    "crse": "4390",
    "description": "This course presents the concepts, techniques, and tools for managing global projects. The role of the project manager is examined, together with techniques for controlling cost, schedules, and performance parameters. Course deliverables are designed to develop fundamental skills needed by project managers in today's global competitive business environment. Topics include project leadership, project lifecycle methodology, business process development, benchmarking, project planning, execution and control, procurement, communications, organizational change, customer acceptance, performance metrics and project closure. This is a communication-intensive course.",
    "name": "International Project Management",
    "source": "Acalog",
    "subj": "MGMT"
  },
  "MGMT-7730": {
    "crse": "7730",
    "description": "Main course objective is to introduce students to basic economics principles and establish economics as a managerial decision-making framework. The course will draw on economic analysis of such concepts as cost, demand, profit, competition, pricing strategy, and market protection and tie them to operational business decisions.",
    "name": "Economics and Institutions",
    "source": "Acalog",
    "subj": "MGMT"
  },
  "PHIL-4990": {
    "crse": "4990",
    "description": "Students conduct original scholarly projects: original research, theoretical or analytical reviews of the literature, or computer simulations. Working either alone or in groups, students prepare written reports relating to this project, under the supervision of a faculty member.",
    "name": "Capstone Experience in Philosophy",
    "source": "Acalog",
    "subj": "PHIL"
  },
  "STSO-4560": {
    "crse": "4560",
    "description": "In this course, students will engage with a variety of perspectives in science and technology studies, feminist theory, queer and transgender theory, cultural studies, science fiction, and other fields that explore how science and technology reciprocally contribute to and are shaped by cultural norms around gender. Students reflect on their own experiences with gender expectations and formulate their own questions and develop a research project over the course of the semester.",
    "name": "Gender, Science, and Technology",
    "source": "Acalog",
    "subj": "STSO"
  },
  "CSCI-2960": {
    "crse": "2960",
    "description": "In this class, students will delve into the essential building blocks of machine learning, focusing on topics in linear algebra, continuous probability, and statistics. These mathematical foundations are the bedrock upon which machine learning is constructed. By mastering these fundamental concepts, students will gain a powerful understanding of machine learning algorithms and predictive modeling. Moreover, this course is on track to becoming a prerequisite for all machine learning classes in the Computer Science department.",
    "name": "Mathematical Foundations Of Machine Learning",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4960": {
    "crse": "4960",
    "description": "Cross-listed from: COGS 4960",
    "name": "Social Computing",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4961": {
    "crse": "4961",
    "description": "This course delves deeply into the transformative world of deep learning. Throughout the semester, we will cover (1) Essential architectures: feedforward neural networks, convolutional neural networks (CNNs), recurrent neural networks (RNNs), generative adversarial networks (GANs), and Transformers. (2) Fundamental concepts and algorithms:  backpropagation, loss functions, optimization strategies, regularization, data augmentation. (3) Diverse applications: computer vision, natural language processing.",
    "name": "Deep Learning",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4962": {
    "crse": "4962",
    "description": "Machine learning (ML) has demonstrated superior performance in many areas and has increasingly been deployed in real-world critical applications. However, the vulnerabilities and privacy risks of ML models could put public safety and user privacy in danger. Existing studies have shown that the ML applications such as financial analytics and autonomous vehicles are vulnerable to attacks that can manipulate the models to their malicious ends. This course will introduce potential vulnerabilities of ML models, recent research and future directions about the security and privacy problems in real-world machine learning systems. We will cover different types of attacks against computer systems leveraging ML as well as defense techniques, privacy-preserving ML, and robustness and fairness in ML. Students will familiarize themselves with the emerging body of literature on each topic, understand different algorithms, analyze security vulnerabilities, and develop the ability to conduct research projects on related topics.",
    "name": "Security And Privacy Of Ml",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4963": {
    "crse": "4963",
    "description": "This course will introduce students to data mining, machine learning, and other algorithmic techniques for analyzing social and biological networks, web crawls, and similar real-world graph-based datasets. Course topics will include an introduction to general graph computations, analysis and mining algorithms, graph analysis frameworks, random graph models, graph visualization, and graph computations via matrix operations. Students will learn about research challenges related to the computational study of large graphs on modern systems. Prospective students should have some background knowledge in algorithms and be comfortable with C/C++ and Python-based programming.",
    "name": "Graph Mining",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4964": {
    "crse": "4964",
    "description": "A structured, intensive research experience for students interested in Machine Learning, AI and Data. Students will focus on a single research project through the semester to answer a novel research question within an open source, open science framework. Projects will use data from a variety of application domains including medical (e.g. disease modeling), environment, finance, text, image, etc. The primary outcomes for students will be open source tools and research publications in peer-reviewed venues.",
    "name": "Machine Learning Open Source, Open Science -- Ml(Os)^2",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4965": {
    "crse": "4965",
    "description": "A time series is a sequence (xt) of data where the subscript t indicates the time at which the data xt was observed. The course provides an introduction to the theory and practice of statistical time series analysis. Topics covered include stationary and non-stationary stochastic processes, autoregressive and moving average (ARMA) models, model selection and estimation, state-space models and the Kalman filter, forecasting and forecast evaluation,  an outline of spectral techniques. While these fundamental techniques are remarkably successful, availability of large time series data sets motivates application of AI/ML methods. Thus we will cover various deep neural networks that are relevant to time series data including RNN, LSTM.",
    "name": "Time Series Analysis",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4967": {
    "crse": "4967",
    "description": "This course will expose students to applying their knowledge of ML and AI to real-world problems using real-world datasets. Larger focus of the course is on Deep Learning and its applications. Students will learn and implement ML concepts by creating small- and medium-sized projects throughout the course.",
    "name": "Projects In Mach Learning & Ai",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4968": {
    "crse": "4968",
    "description": "Machine-learned models now routinely outperform humans at a variety of tasks. That accuracy comes implicitly at the cost of other socially and ethically desirable properties; these trade-offs limit the arenas in which ML may be deployed. This seminar course covers recent approaches towards measuring and ensuring such properties in machine-learned models. The properties considered include (i) fairness: models should not discriminate on the basis of protected attributes; (ii) robustness: models’ predictions should not change irrationally in response to imperceptible changes in their inputs; and (iii) privacy: models should not leak sensitive information on individuals.",
    "name": "Trustworthy Machine Learning",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4969": {
    "crse": "4969",
    "description": "Cross-listed from: ECSE 4490",
    "name": "Robotics Ii",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4970": {
    "crse": "4970",
    "description": "RCOS (Rensselaer Center for Open Source) is an eclectic group of undergraduate students that embark on individual and team-based open source projects, primarily software, but also open hardware projects. Many new projects are introduced each semester, though many ongoing and \"higher-profile\" projects are also undertaken. Overall, students are required to work on and contribute to open source projects, in particular through multiple commits (commit early, commit often), maintaining a blog, presenting their work and/or specific technical talks, mentoring other projects, etc. This project-based \"course\" may be taken multiple semesters, with grades based on clear effort and contributions rather than a project that meets all of its requirements.",
    "name": "Rcos",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4971": {
    "crse": "4971",
    "description": "This research seminar-oriented course will explore the synergistic combination of Artificial Intelligence (AI) and Blockchain technologies. A primary focus of the course is to identify the disruptors in the two technologies from a research lens. Specifically, we intend to discuss how leveraging blockchain technology can benefit AI and how applying AI can enhance the capabilities of blockchain technology. Furthermore, students are encouraged to think about the impact of these two technologies on society. Topics discussed in the course include blockchain fundamentals, smart contracts, web3, federated machine learning, and decentralized applications that combine AI and blockchain technologies.",
    "name": "Ai And Blockchain",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6960": {
    "crse": "6960",
    "description": "TBD",
    "name": "Ai For Drug Discovery",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6961": {
    "crse": "6961",
    "description": "This course delves deeply into the transformative world of deep learning. Throughout the semester, we will cover (1) Essential architectures: feedforward neural networks, convolutional neural networks (CNNs), recurrent neural networks (RNNs), generative adversarial networks (GANs), and Transformers. (2) Fundamental concepts and algorithms:  backpropagation, loss functions, optimization strategies, regularization, data augmentation. (3) Diverse applications: computer vision, natural language processing.",
    "name": "Deep Learning",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6962": {
    "crse": "6962",
    "description": "Machine learning (ML) has demonstrated superior performance in many areas and has increasingly been deployed in real-world critical applications. However, the vulnerabilities and privacy risks of ML models could put public safety and user privacy in danger. Existing studies have shown that the ML applications such as financial analytics and autonomous vehicles are vulnerable to attacks that can manipulate the models to their malicious ends. This course will introduce potential vulnerabilities of ML models, recent research and future directions about the security and privacy problems in real-world machine learning systems. We will cover different types of attacks against computer systems leveraging ML as well as defense techniques, privacy-preserving ML, and robustness and fairness in ML. Students will familiarize themselves with the emerging body of literature on each topic, understand different algorithms, analyze security vulnerabilities, and develop the ability to conduct research projects on related topics.",
    "name": "Security And Privacy Of Ml",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6963": {
    "crse": "6963",
    "description": "This course will introduce students to data mining, machine learning, and other algorithmic techniques for analyzing social and biological networks, web crawls, and similar real-world graph-based datasets. Course topics will include an introduction to general graph computations, analysis and mining algorithms, graph analysis frameworks, random graph models, graph visualization, and graph computations via matrix operations. Students will learn about research challenges related to the computational study of large graphs on modern systems. Prospective students should have some background knowledge in algorithms and be comfortable with C/C++ and Python-based programming.",
    "name": "Graph Mining",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6965": {
    "crse": "6965",
    "description": "A time series is a sequence (xt) of data where the subscript t indicates the time at which the data xt was observed. The course provides an introduction to the theory and practice of statistical time series analysis. Topics covered include stationary and non-stationary stochastic processes, autoregressive and moving average (ARMA) models, model selection and estimation, state-space models and the Kalman filter, forecasting and forecast evaluation,  an outline of spectral techniques. While these fundamental techniques are remarkably successful, availability of large time series data sets motivates application of AI/ML methods. Thus we will cover various deep neural networks that are relevant to time series data including RNN, LSTM.",
    "name": "Time Series Analysis",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6967": {
    "crse": "6967",
    "description": "This course will expose students to applying their knowledge of ML and AI to real-world problems using real-world datasets. Larger focus of the course is on Deep Learning and its applications. Students will learn and implement ML concepts by creating small- and medium-sized projects throughout the course.",
    "name": "Projects In Mach Learning & Ai",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6968": {
    "crse": "6968",
    "description": "Machine-learned models now routinely outperform humans at a variety of tasks. That accuracy comes implicitly at the cost of other socially and ethically desirable properties; these trade-offs limit the arenas in which ML may be deployed. This seminar course covers recent approaches towards measuring and ensuring such properties in machine-learned models. The properties considered include (i) fairness: models should not discriminate on the basis of protected attributes; (ii) robustness: models’ predictions should not change irrationally in response to imperceptible changes in their inputs; and (iii) privacy: models should not leak sensitive information on individuals.",
    "name": "Trustworthy Machine Learning",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6971": {
    "crse": "6971",
    "description": "This research seminar-oriented course will explore the synergistic combination of Artificial Intelligence (AI) and Blockchain technologies. A primary focus of the course is to identify the disruptors in the two technologies from a research lens. Specifically, we intend to discuss how leveraging blockchain technology can benefit AI and how applying AI can enhance the capabilities of blockchain technology. Furthermore, students are encouraged to think about the impact of these two technologies on society. Topics discussed in the course include blockchain fundamentals, smart contracts, web3, federated machine learning, and decentralized applications that combine AI and blockchain technologies.",
    "name": "Ai And Blockchain",
    "source": "CSCI topics",
    "subj": "CSCI"
  }
}