{
  "CHME-6540": {
    "crse": "6540",
    "description": "A review of basic concepts of mass, momentum, and energy conservation as related to convective heat transfer. The analysis of laminar and turbulent forces and free convection problems in both internal and external flows. Also a study of the current state of the art in boiling and condensation heat transfer.",
    "name": "Convective Heat Transfer",
    "subj": "CHME"
  },
  "CHME-6570": {
    "crse": "6570",
    "description": "Classical solution thermodynamics, equations of state, and topics in chemical reaction and phase equilibria. Emphasis is on the rigorous formulation of equilibrium problems, and on the measurement, reduction, correlation, and interpretation of experimental data.",
    "name": "Chemical and Phase Equilibrium",
    "subj": "CHME"
  },
  "CHME-6610": {
    "crse": "6610",
    "description": "Development and application of mathematical methods for the solution of chemical engineering problems. Classical solution methods for ordinary and partial differential equations. Major emphasis is given to the mathematical implications of describing and solving representation of chemical reactors and other systems. Case studies relevant to other departmental graduate courses and ongoing research activities are discussed. The mathematical methods include series solutions, special function representations, boundary-value problems, and operational calculus.",
    "name": "Mathematical Methods in Chemical Engineering I",
    "subj": "CHME"
  },
  "CHME-6620": {
    "crse": "6620",
    "description": "Modern solution techniques including semi-analytical, approximation, and numerical methods are introduced and applied to linear and nonlinear transport phenomena problems and chemical engineering systems. Similarity theory and integral methods, perturbation techniques, and orthogonal collocation, indispensable to chemical engineering, are discussed.",
    "name": "Mathematical Methods in Chemical Engineering II",
    "subj": "CHME"
  },
  "CHME-6640": {
    "crse": "6640",
    "description": "Analysis of ideal and nonideal chemical reactor operation with simple and multiple homogeneous, heterogeneous, and catalytic reactions. Interplay of chemical and mass and energy and momentum transport processes in model reactors and catalytic particles. Topics include transient and steady-state operation, residence time distribution, multiplicity, stability, selectivity control, and catalyst deactivation.",
    "name": "Advanced Chemical Reactor Design",
    "subj": "CHME"
  },
  "CHME-6650": {
    "crse": "6650",
    "description": "Application of modern control theory to chemical processes. Introduction to on-line data acquisition and computer control. Real-time process optimization and optimal control theory. Estimation theory and adaptive control. Introduction to stochastic control and to the control of large-scale distribution systems. Case studies via computer-aided design programs.",
    "name": "Advanced Process Control",
    "subj": "CHME"
  },
  "CHME-6670": {
    "crse": "6670",
    "description": "Process synthesis with applications to heat exchange networks, energy-integrated separation sequences, and reactor networks. Analysis, design, and optimization of large-scale systems.",
    "name": "Advanced Process Design",
    "subj": "CHME"
  },
  "CHME-6830": {
    "crse": "6830",
    "description": "Review of fundamentals of thermodynamics, chemical kinetics, fluid mechanics, and modern diagnostics. Discussion of flame propagation, thermal and chain explosions, stirred reactors, detonations, droplet combustion, and turbulent jet flames. Â",
    "name": "Combustion",
    "subj": "CHME"
  },
  "CHME-6840": {
    "crse": "6840",
    "description": "This course is intended to give students a state-of-the-art understanding about single and multicomponent boiling and condensation heat transfer phenomena. Applications include the analysis of nuclear reactors, oil wells, and chemical process equipment. Students satisfactorily completing this course are expected to be able to thoroughly understand the current thermal-hydraulics literature on multiphase heat and mass transfer and be able to conduct independent research in this field.",
    "name": "An Introduction to Multiphase Flow and Heat Transfer I",
    "subj": "CHME"
  },
  "CHME-6850": {
    "crse": "6850",
    "description": "This course is intended to give students a state-of-the-art understanding in multicomponent flow phenomena. Applications in the chemical process, petroleum recovery, and fossil/nuclear power industries will be given. Specific areas of coverage include two-phase: fluid mechanics, pressure drop, modeling and analysis, stability analysis, critical flow and dynamic waves, flow regime analysis, and phase separation and distribution phenomena.",
    "name": "An Introduction to Multiphase Flow and Heat Transfer II",
    "subj": "CHME"
  },
  "CHME-6900": {
    "crse": "6900",
    "description": "This seminar-based graduate level course provides a broad exposure to the chemical and biological engineering discipline. Attending and participating in seminars from recognized experts will form the core of the course. Topics include energy and the environment, nano and biotechnologies, computational molecular science, polymers and advanced materials, synthetic biology, metabolic engineering, and the future of our discipline. The course is required for chemical engineering Ph.D. students. Â",
    "name": "Chemical and Biological Engineering Seminar",
    "subj": "CHME"
  },
  "CHME-6940": {
    "crse": "6940",
    "description": "",
    "name": "Readings in Chemical Engineering",
    "subj": "CHME"
  },
  "CHME-6960": {
    "crse": "6960",
    "description": "State-of the-art formal courses in specialized areas suitable for masterâs and doctoral programs. Usually two topics offered per term. Typical topics include colloidal dynamics, dispersion and mixing, fluidation, heterogeneous catalysis, polymer reaction engineering, stochastic processes, and statistical mechanics.",
    "name": "Topics in Chemical Engineering",
    "subj": "CHME"
  },
  "CHME-6970": {
    "crse": "6970",
    "description": "Active participation in a semester-long project, under the supervision of a faculty adviser. A Professional Project often serves as a culminating experience for a Professional Masterâs program but, with departmental or school approval, can be used to fulfill other program requirements. With approval, students may register for more than one Professional Project. Professional Projects must result in documentation established by each department or school, but are not submitted to the Office of Graduate Education and are not archived in the library. Grades of A, B, C, or F are assigned by the faculty adviser at the end of the semester. If not completed on time, a formal Incomplete grade may be assigned by the faculty adviser, listing the work remaining to be completed and the time limit for completing this work.",
    "name": "Professional Project",
    "subj": "CHME"
  },
  "CHME-6990": {
    "crse": "6990",
    "description": "Active participation in research, under the supervision of a faculty adviser, leading to a master's thesis. Grades of S or U are assigned by the adviser each term to reflect the student's research progress for the given semester. Once the thesis has been presented, approved by the adviser, and accepted by the Office of Graduate Education, it will be archived in a standard format in the library.",
    "name": "Master's Thesis",
    "subj": "CHME"
  },
  "CHME-9990": {
    "crse": "9990",
    "description": "Active participation in research, under the supervision of a faculty adviser, leading to a doctoral dissertation. Grades of IP are assigned until the dissertation has been publicly defended, approved by the doctoral committee, and accepted by the Office of Graduate Education to be archived in a standard format in the library. Grades will then be listed as S.",
    "name": "Dissertation",
    "subj": "CHME"
  },
  "CIVL-1100": {
    "crse": "1100",
    "description": "Deals with the practice of civil and environmental engineering. Not a highly analytical course, as the course is primarily intended for first year students.Â Some topics include: history of civil engineering; present practice; typical employers; typical projects; design philosophy; professional topics including organizations, registrations, ethics.Â Discuss case histories, bring in outside speakers.Â Students attend CE Capstone presentations.",
    "name": "Introduction to Civil and Environmental Engineering",
    "subj": "CIVL"
  },
  "CIVL-1200": {
    "crse": "1200",
    "description": "An introduction to the elements of computer aided design for civil and environmental engineers using AutoCAD Civil 3D. Students will be introduced to basic AutoCAD drafting techniques as well as learn the key features of Civil 3D that aid site development design and analysis. Topics covered will include general AutoCAD techniques, existing conditions development and analysis using field collected survey data and GIS information, pipe network design, grading design, and roadway corridor layout.",
    "name": "Engineering Graphics for Civil Engineers",
    "subj": "CIVL"
  },
  "CIVL-1300": {
    "crse": "1300",
    "description": "This course teaches elementary programming concepts using the Python environment.Â Students are expected to have little or no prior programming experience.Â Topics include Python language syntax, variables, looping, function calls, manipulating arrays, perfoming statistical calculations, and plotting results.",
    "name": "Beginning Programming in Civil and Environmental Engineering",
    "subj": "CIVL"
  },
  "CIVL-2030": {
    "crse": "2030",
    "description": "Introduction to basic concepts in transportation engineering including planning, design, and operations. Introduces the challenges and issues in modeling transportation problems. Studies of various concepts related to the design of highway facilities, level of service, and demand for transportation services. Concepts related to signal optimization. Policy implications. Basics of transportation planning.",
    "name": "Introduction to Transportation Engineering",
    "subj": "CIVL"
  },
  "CIVL-2040": {
    "crse": "2040",
    "description": "Contract essentials; types of contracts for construction and for engineering services. Bidding procedure, surety bonds, insurance, litigation. Standard contract documents, the compilation of specifications. Engineering ethical principles and codes.",
    "name": "Professional Practice",
    "subj": "CIVL"
  },
  "CIVL-2050": {
    "crse": "2050",
    "description": "Hydrostatics; Pressure Measurement; Fluid Properties; Application of Control Volume Analysis to Conservation of Mass, Energy and Momentum Principles; Bernoulli Equation for Ideal Flow; Dimensional Analysis; Pipe Flow and Pipe Networks; Pump Performance; Pipes in Pipelines. Â A laboratory component will illustrate the topics studied.Â Â",
    "name": "Fluid Mechanics for Civil and Environmental Engineering",
    "subj": "CIVL"
  },
  "CIVL-2060": {
    "crse": "2060",
    "description": "This course provides a foundational treatment of water resources engineering through theory, analysis and design. Hydrologic cycle, water resources sustainability, and water resources planning. Pipe flow and pipe networks, withÂ application to distribution systems. Hydraulics of open-channel flow and control structures such as culverts, gates, weirs, spillways and stilling basins. Reservoir routing and design of storage. Contemporary issues including green infrastructure, storm surge and climate change. Experimental laboratory sessions reinforce lectures and provide handsâon learning opportunities.",
    "name": "Water Resources Engineering",
    "subj": "CIVL"
  },
  "CIVL-2630": {
    "crse": "2630",
    "description": "The application of the basic laws and phenomena of science to particulate matter, specifically soils. Basic physical and mechanical structural characteristics of soil. Equilibrium and movement of water. Flow through porous media. Effective stress. Stress-strain-time relations. Basic laboratory work as related to practice.",
    "name": "Introduction to Geotechnical Engineering",
    "subj": "CIVL"
  },
  "CIVL-2670": {
    "crse": "2670",
    "description": "Introduction to the elastic behavior of structural components. Analysis of statically determinate systems. Deflection calculations by virtual work and elastic load methods. Analysis of simple statically indeterminate structures. Influence lines. Interaction of structural components. Typical structural engineering loads.",
    "name": "Introduction to Structural Engineering",
    "subj": "CIVL"
  },
  "CIVL-2940": {
    "crse": "2940",
    "description": "",
    "name": "Readings in Civil Engineering",
    "subj": "CIVL"
  },
  "CIVL-4010": {
    "crse": "4010",
    "description": "Subsurface investigation. The application of the principles of soil mechanics to the design of footings, retaining walls, pile foundations, bulkheads, cofferdams, bridge piers and abutments, and underpinnings.",
    "name": "Foundation Engineering",
    "subj": "CIVL"
  },
  "CIVL-4020": {
    "crse": "4020",
    "description": "The seminar will be interdisciplinary with students from both architecture and civil engineering departments.Â The content of the lectures bears direct relation to practical experience and is considered to be supplementary to the other courses in the respective engineering and architecture schools. Specific types of structures will be examined with the help of suitable existing project examples clarifying and critically analyzing the basic engineering principles behind them.Â Students will be exposed to the collaborative methods inherent within the architect/engineer relationship.",
    "name": "Bedford Seminar",
    "subj": "CIVL"
  },
  "CIVL-4070": {
    "crse": "4070",
    "description": "Analysis and design of metal structures. Structural materials and loads. Design of beams, columns, bolted and welded connections. Composite construction.",
    "name": "Steel Design",
    "subj": "CIVL"
  },
  "CIVL-4080": {
    "crse": "4080",
    "description": "Analysis and design of reinforced concrete structures using ultimate strength methods. Design of beams, columns, slabs, and footings. Development and anchorage of reinforcing bars. Laboratory testing of hardened concrete mechanical properties.",
    "name": "Concrete Design",
    "subj": "CIVL"
  },
  "CIVL-4140": {
    "crse": "4140",
    "description": "The application of geotechnical engineering to the environmental area. Deals with waste disposal, waste containment systems, waste stabilization, and landfills. Emphasis on design of such facilities. Includes related topics necessary for design, e.g., geosynthetics, groundwater, contaminant transport, and slurry walls. Some field trips are possible. (Students cannot receive credit for both this course and CIVL 6550.)",
    "name": "Geoenvironmental Engineering",
    "subj": "CIVL"
  },
  "CIVL-4150": {
    "crse": "4150",
    "description": "Second course in geotechnical engineering, emphasizing the use of Laboratory obtained soil properties (consolidation, compressibility, and shear strength) in the design of geotechnical systems such as slope stability, soil structure systems, foundation settlement, etc.",
    "name": "Geotechnical Design",
    "subj": "CIVL"
  },
  "CIVL-4240": {
    "crse": "4240",
    "description": "An introductory course in use of the Finite Element Method (FEM) to solve one-and two-dimensional problems in fluid mechanics, heat transfer, and elasticity. The methods are developed using weighted residuals. Algorithms for the construction and solution of the governing equations are also covered. Students will be exposed to the use of commercial finite element software.",
    "name": "Introduction to Finite Elements",
    "subj": "CIVL"
  },
  "CIVL-4270": {
    "crse": "4270",
    "description": "Application of engineering principles to planning construction operations. Network scheduling (CPM, PERT), resource allocation. Cost engineering and control.",
    "name": "Construction Management",
    "subj": "CIVL"
  },
  "CIVL-4280": {
    "crse": "4280",
    "description": "Design of systems to consider foundations, structures, and constructability; foundation alternatives; structural design to simplify erection; prefabrication, modulation of structures; material handling on a construction site; crane selection and placement; temporary works.",
    "name": "Design for Constructability",
    "subj": "CIVL"
  },
  "CIVL-4440": {
    "crse": "4440",
    "description": "Principles of displacement-based structural analysis; development of element and structure stiffness matrices; direct stiffness method for matrix structural analysis of trusses, beams, and frames; computer analysis of structures; introduction to finite element method.",
    "name": "Matrix Structural Analysis",
    "subj": "CIVL"
  },
  "CIVL-4450": {
    "crse": "4450",
    "description": "This course covers concepts of structural systems. The course is aimed at understanding behavior of different structural systems and how they respond to various loading conditions. The concept of load transfer, shaping, and form finding is of particular interest. This concept is reinforced through analytical, digital, and physical modeling intended to foster intuitive thinking. The course includes the following: approximate analyses of statically indeterminate beams, rigid frames, and vierendeel frames; cable suspended structures, arch supported structures; masonry structures, space frame, and folded plate structures; spherical, cylindrical, and hyperbolic shells; net and tent structures; air-supported and air-inflated structures, and hybrid structural systems. The course includes guest lectures, project, computer simulation, and testing physical models.",
    "name": "Conceptual Structural Systems",
    "subj": "CIVL"
  },
  "CIVL-4570": {
    "crse": "4570",
    "description": "This course is an applications-oriented course covering basic analytical tools for modeling and optimization of large-scale civil and environmental engineering systems. Application domains thatÂ will be discussed include: scheduling in large systems, construction management, multi-purpose reservoir operation, transportation and logistics planning, as well as other civil and environmental engineering systems. An overview of different optimization techniques, with a particular focus on network flow problems and introductory stochastic analysis will be provided. Software to solve these problems will be used throughout the course.Â",
    "name": "System Modeling for Civil and Environmental Engineering",
    "subj": "CIVL"
  },
  "CIVL-4620": {
    "crse": "4620",
    "description": "The basic concepts of planning, design, and operation of urban mass transit systems. Topics include travel demand, network configurations, communication and control systems, power systems, vehicle technology, guideway and vehicle support, and guidance technology, routing, and scheduling, operating practice, marketing and financing of transit service, interface design, and implementation. These topics are discussed with relation to bus transit systems, guided transit systems, and several new systems. Several case studies examined.",
    "name": "Mass Transit Systems",
    "subj": "CIVL"
  },
  "CIVL-4640": {
    "crse": "4640",
    "description": "Introduction to the analysis and planning of transportation systems. Study of the basic interaction between transportation supply and demand. Role of transportation systems analysis in the social, environmental, and policy making. Trip generation. Trip distribution. Mode split. Traffic Assignment. Computer applications (meets with CIVL 6250 Transportation System Planning). Students cannot obtain credit for this course and CIVL 6250.",
    "name": "Transportation System Planning",
    "subj": "CIVL"
  },
  "CIVL-4660": {
    "crse": "4660",
    "description": "Basic characteristics of traffic flow, including driver, vehicle, volume, speed, delay, capacity, and accidents; traffic regulation and control, signs, markings, signals, and signal systems; basic traffic flow theory; study methods and analysis procedures to solve traffic engineering and control problems.",
    "name": "Traffic Engineering",
    "subj": "CIVL"
  },
  "CIVL-4670": {
    "crse": "4670",
    "description": "Principles of geometric design of highways, intersections, interchanges, and terminals. Practical issues of vertical and horizontal curvature, highway evaluation, driver and vehicle dynamics, and traffic safety are also addressed. Computer-aided design and modeling.",
    "name": "Highway Engineering",
    "subj": "CIVL"
  },
  "CIVL-4920": {
    "crse": "4920",
    "description": "Open-ended design project in which students work in teams. Oral presentations and written reports cover alternates considered, design assumptions, cost, safety, and feasibility. This is a communication-intensive course.",
    "name": "Civil Engineering Capstone Design",
    "subj": "CIVL"
  },
  "CIVL-4940": {
    "crse": "4940",
    "description": "",
    "name": "Readings in Civil Engineering",
    "subj": "CIVL"
  },
  "CIVL-4960": {
    "crse": "4960",
    "description": "",
    "name": "Topics in Civil Engineering",
    "subj": "CIVL"
  },
  "CIVL-6170": {
    "crse": "6170",
    "description": "This course provides an introduction to the mechanics of solids from a continuum perspective. Topics covered in this course include: vector and tensor analysis, coordinate systems and calculus in curvilinear coordinate systems, kinematics (motion, deformation and strain), stress and momentum balance, energy principles and balance laws, linear isotropic and anisotropic elasticity, thermoelasticity, method of solutions for 2-D and 3-D linear elastic boundary value problems, applications to simple structures.",
    "name": "Mechanics of Solids",
    "subj": "CIVL"
  },
  "CIVL-6180": {
    "crse": "6180",
    "description": "Micromechanics of elastic heterogeneous solids. Plasticity of composite materials. Thermoelastic and thermoplastic behavior. Mechanics of distributed damage. Mechanical behavior.",
    "name": "Mechanics of Composite Materials",
    "subj": "CIVL"
  },
  "CIVL-6190": {
    "crse": "6190",
    "description": "This graduate level course will introduce two types of advanced models related to travel demand forecasting: the land use models and the activity-based models. This project-based course will allow students to obtain sound knowledge of advanced modeling techniques, and to have some preliminary experience with building, estimating, and applying advanced transportation models.",
    "name": "Advanced Transportation Models",
    "subj": "CIVL"
  },
  "CIVL-6200": {
    "crse": "6200",
    "description": "Preliminaries on linear, three-dimensional elasticity theory. Reduction of the elasticity theory to theories of plates and shells. Anisotropy. Nonlinear theories. Applications.",
    "name": "Plates and Shells",
    "subj": "CIVL"
  },
  "CIVL-6210": {
    "crse": "6210",
    "description": "Concepts of stability pertaining to structural and mechanical systems. Static and dynamic theories of stability. Configurations include bars, plates, shells, and structural complexes.",
    "name": "Structural Stability",
    "subj": "CIVL"
  },
  "CIVL-6220": {
    "crse": "6220",
    "description": "To provide the students with a broad understanding of cutting edge methodologies in transportation modeling and economics not thoroughly covered in other coursesÂ and emerging issues pertaining to transportation research and practice.",
    "name": "Critical Issues in Transportation",
    "subj": "CIVL"
  },
  "CIVL-6230": {
    "crse": "6230",
    "description": "Review of economic concepts and their application to transportation. Economic basis of transportation demand. Estimation of aggregate and disaggregate demand functions. Value of time. Supply functions. Cost functions, production functions. Transportation externalities. Valuation techniques. Cost/benefit analysis and multi-criteria approaches.",
    "name": "Transportation Economics",
    "subj": "CIVL"
  },
  "CIVL-6240": {
    "crse": "6240",
    "description": "The course discusses Intelligent Transportation Systems (ITS) technologies and theirÂ application areas. ITS technologies. ITS Architecture. ITS applications. A number of outside speakers will complement the lectures. The students are expected to give at least two technical presentations and write a final paper on an ITS topic of their choosing.",
    "name": "Intelligent Transportation Systems",
    "subj": "CIVL"
  },
  "CIVL-6250": {
    "crse": "6250",
    "description": "ï»¿ ï»¿The analysis and planning of transportation systems. Study of the basic interaction between transportation supply and demand. Role of transportation systems analysis in social, environmental, and policy making. Trip generation. Trip distribution. Mode split. Traffic assignment. Computer applications.Â Students cannotÂ obtain creditÂ for this course and CIVL 4640.Â",
    "name": "Transportation Systems Planning",
    "subj": "CIVL"
  },
  "CIVL-6260": {
    "crse": "6260",
    "description": "Fundamentals of transportation network analysis, including graph representations of transportation networks, shortest path search algorithms, static traffic assignment and user equilibrium, and dynamic traffic assignment. Focus on how basic mathematical analysis tools such as linear and nonlinear programming can be used to analyze transportation network problems. The objective of this course is to introduce students to transportation network analysis fundamentals so that they are equipped with basic skills to analyze related problems in this area.",
    "name": "Transportation Network Analysis",
    "subj": "CIVL"
  },
  "CIVL-6270": {
    "crse": "6270",
    "description": "Topics on traffic control systems such as signals and ramp metering; sensor-aided and data-oriented traffic modeling; fundamentals and applications of microscopic traffic simulation. State of the art signal design and traffic simulation tools will be used throughout the class.",
    "name": "Traffic Control and Simulation",
    "subj": "CIVL"
  },
  "CIVL-6280": {
    "crse": "6280",
    "description": "The fundamentals of dynamic equilibrium with applications to planning and real-time operations in transportation systems. A network optimization approach to dynamic models including time dependent shortest path algorithms, analytical and simulation models for dynamic traffic assignment. Applications of these approaches to network wide real-time control. Emphasis on implementation of algorithms using programming languages.",
    "name": "Dynamic Traffic Models",
    "subj": "CIVL"
  },
  "CIVL-6290": {
    "crse": "6290",
    "description": "Background and socio-economic aspects of freight transportation. Freight policy and planning objectives. Distribution system and participating agents. Behavior of freight agents. Short-medium term operational improvements: Land use and traffic related. Short-medium term operational improvements: System level strategies. System perspective of freight activity. Strategic freight transportation planning and freight demand modeling.",
    "name": "Freight Transportation Systems",
    "subj": "CIVL"
  },
  "CIVL-6300": {
    "crse": "6300",
    "description": "This graduate level course will introduce a number of econometric models to analyze transportation data, ranging from count of crash occurrence to household trip frequency. Students will learn to specify, estimate, and interpret models to study various transportation issues.",
    "name": "Transportation Statistical Modeling",
    "subj": "CIVL"
  },
  "CIVL-6310": {
    "crse": "6310",
    "description": "Advanced analysis and design of reinforced concrete structures. Design of deep beams, slender columns, two-way floor systems. Deflection computations. Design for torsion. Prestressed concrete fundamentals.",
    "name": "Advanced Concrete Structures",
    "subj": "CIVL"
  },
  "CIVL-6320": {
    "crse": "6320",
    "description": "Advanced analysis and design of complex metal structures. Flexible, semi-rigid, and rigid connections. Plate girders, torsional design. Effects of semi-rigid connections on structural stability.",
    "name": "Advanced Steel Design",
    "subj": "CIVL"
  },
  "CIVL-6340": {
    "crse": "6340",
    "description": "Open-ended design project in which students work in teams of four (two engineers and two architects) to replicate the Architecture/Structural Engineering integrated design of buildings.Â Oral presentations and written reports and studio critics cover alternatives considered, design assumptions, and cost estimates. This is a communication-intensive course.",
    "name": "Bedford Design Studio",
    "subj": "CIVL"
  },
  "CIVL-6350": {
    "crse": "6350",
    "description": "To develop a general familiarity with the structural design of masonry elements and structures.Â This includes exposure to the historical development of design specifications as well as specific design procedures unique to this material.",
    "name": "Masonry Design",
    "subj": "CIVL"
  },
  "CIVL-6360": {
    "crse": "6360",
    "description": "To develop a general familiarity with the structural design of wood elements and structures.Â This includes exposure to the historical development of design specifications as well as specific design procedures unique to this material.",
    "name": "Timber Design",
    "subj": "CIVL"
  },
  "CIVL-6380": {
    "crse": "6380",
    "description": "Mechanics of concrete failure under uniaxial and multiaxial stress states.Â Strain-softening behavior and damage localization in tension and compression. Nonlinear strain-hardening behavior under triaxial compression. Tensile fracture and size-effect. Constitutive modeling of concrete mechanical behavior. Cohesive crack model. Plasticity models, damage models, microplane models, and discrete models. Â",
    "name": "Advanced Concrete Mechanics",
    "subj": "CIVL"
  },
  "CIVL-6390": {
    "crse": "6390",
    "description": "This course will develop understanding and integrate skills across the fields of fluid mechanics, meteorology, climatology, bluff-body aerodynamics, structural dynamics, code provisions for design, wind tunnel testing, and damage documentation.",
    "name": "Wind Engineering",
    "subj": "CIVL"
  },
  "CIVL-6440": {
    "crse": "6440",
    "description": "Matrix formulation of nonlinear structural analysis problems; analysis of structures with geometric and material nonlinearities; elastic and inelastic buckling; plastic analysis of beams and frames; computer analysis of nonlinear structure.",
    "name": "Nonlinear Structural Analysis",
    "subj": "CIVL"
  },
  "CIVL-6450": {
    "crse": "6450",
    "description": "Analysis of elastic and inelastic single and multiple degree-of-freedom structural systems under time-dependent loads including harmonic, impulse, earthquake, and other general dynamic loads. Development of equations of motion. Analytical and numerical evaluation of free and forced vibration response. Identification of dynamic system properties. Modal analysis. Vibration isolation and force transmissibility. Dynamic measurement sensors. Shock loading spectrum. Frequency-domain analysis.",
    "name": "Structural Dynamics",
    "subj": "CIVL"
  },
  "CIVL-6460": {
    "crse": "6460",
    "description": "Stochastic response of lumped parameter and continuous systems to random excitation, wave propagation, power spectral densities, covariance and cross covariance functions, transfer functions, application of procedure to wind and earthquake engineering. Review of current literature.",
    "name": "Advanced Structural Dynamics",
    "subj": "CIVL"
  },
  "CIVL-6480": {
    "crse": "6480",
    "description": "Civil Engineering applications of geosynthetics including geotextiles, geogrids, geonets, geomembranes, geosynthetic clay liners, geopipe, and geocomposites. Designing by function, including separation, reinforcement, filtration, drainage, liquid barrier, and combined functions. Applications in the areas of landfills, groundwater drains, geotextile reinforced walls and slopes, roadways, and other civil engineered type structures.",
    "name": "Designing with Geosynthetics",
    "subj": "CIVL"
  },
  "CIVL-6490": {
    "crse": "6490",
    "description": "Measurement and characterization of earthquake ground motion and structural response in time and frequency domains. Linear and nonlinear response history and response spectrum analysis of structures subject to earthquake loading. Seismic analysis and design of structural systems using building codes and design specifications.",
    "name": "Earthquake Engineering",
    "subj": "CIVL"
  },
  "CIVL-6510": {
    "crse": "6510",
    "description": "An intensive study of the fundamentals of soil mechanics at the graduate level. Transmission of stresses between particles. Soils in which the pore water is either stationary or flowing under steady conditions. Soils in which pore pressures are influenced by applied loads, and hence the pore water is flowing under transient conditions.",
    "name": "Advanced Geotechnical Engineering",
    "subj": "CIVL"
  },
  "CIVL-6520": {
    "crse": "6520",
    "description": "The applications of the principles of soil mechanics to the design of foundations, at the graduate level. Subsurface investigation. Design of footings, retaining walls, pile foundations, flexible retaining structures, anchor tie-backs, bridge piers, abutments, embankments, and natural slopes. Slope stability analysis and landslide prevention. Earthquake effects. Case studies.",
    "name": "Advanced Foundations and Earth Structures",
    "subj": "CIVL"
  },
  "CIVL-6530": {
    "crse": "6530",
    "description": "Introduction to groundwater hydrology, well hydraulics, permeability, seepage, flow nets, filter criteria, dewatering, slope stabilization, practical applications.",
    "name": "Seepage, Drainage, and Groundwater",
    "subj": "CIVL"
  },
  "CIVL-6540": {
    "crse": "6540",
    "description": "Basics of dynamic response of soil and soil-foundation systems, including applications to earthquake engineering and machine foundations. Systems studies include shallow and deep foundations, buried structures, earth structures, slopes, and earthquake site response.",
    "name": "Dynamics of Soil and Soil-Foundation Systems",
    "subj": "CIVL"
  },
  "CIVL-6550": {
    "crse": "6550",
    "description": "An intensive study of the application of geotechnical engineering to the environmental area. Deals with waste disposal, waste containment systems, waste stabilization, and landfills. Emphasis on design of such facilities. Includes related topics necessary for design, e.g., geosynthetics, groundwater, contaminant transport, and slurry walls. Some field trips are possible. This course meets concurrently with CIVL 4140. CIVL 6550 students are required to do a term paper and/or project, read additional professional papers and publications, and do additional laboratory experiments. (Students cannot receive credit for both this course and CIVL 4140.)",
    "name": "Advanced Geoenvironmental Engineering",
    "subj": "CIVL"
  },
  "CIVL-6660": {
    "crse": "6660",
    "description": "Graduate-level course on the fundamental concepts and technologies underlying finite element methods for the numerical solution of continuum problems. The course emphasizes the construction of integral weak forms for elliptic partial differential equations and the construction of the elemental level matrices using multi-dimensional shape functions, element level mappings, and numerical integration. The basic convergence properties of the finite element method will be given. This course serves as preparation for students working on finite element methods.",
    "name": "Fundamentals of Finite Elements",
    "subj": "CIVL"
  },
  "CIVL-6670": {
    "crse": "6670",
    "description": "The formulations and solution strategies for finite element analysis of nonlinear problems are developed. Topics include the sources of nonlinear behavior (geometric, constitutive, boundary condition), derivation of the governing discrete equations for nonlinear systems such as large displacement, nonlinear elasticity, rate independent and dependent plasticity and other nonlinear constitutive laws, solution strategies for nonlinear problems (e.g., incrementation, iteration), and computational procedures for large systems of nonlinear algebraic equations.",
    "name": "Nonlinear Finite Element Methods",
    "subj": "CIVL"
  },
  "CIVL-6680": {
    "crse": "6680",
    "description": "Examines the implementation of finite element methods. Consideration is first given to the techniques used in classic finite element programs. Attention then focuses on development of a general geometry-based code which effectively supports higher order adaptive technique. Technical areas covered include: effective construction of element matrices for p-version finite elements, ordering of unknowns, automatic mesh generation, adaptive mesh improvement, program and database structures. Implementation of automated adaptive techniques on parallel computers is also covered.",
    "name": "Finite Element Programming",
    "subj": "CIVL"
  },
  "CIVL-6690": {
    "crse": "6690",
    "description": "This course focuses on generalized weighted residual methods and multifield variational principles for constructing approximate solutions to sets of governing differential equations and associated boundary conditions. Topics include hybrid and mixed methods, boundary element formulations, p-version finite elements, global/local procedures, and penalty methods. Problem areas include solid mechanics (nearly incompressible solids, plates, and shells), fluid mechanics including compressible flows, and heat transfer.",
    "name": "Advanced Finite Element Formulations",
    "subj": "CIVL"
  },
  "CIVL-6700": {
    "crse": "6700",
    "description": "Solutions to the free vibration and transient dynamic responses of two-and three-dimensional structures by the finite element method are considered. The governing finite element matrix equations are derived and numerical aspects of solving these time-dependent equations considered. Topics include the formulation of the eigenvalue problem, algorithms for eigenvalue extraction, time integration methods including stability and accuracy analysis, and finite elements in time. Modal analysis and direct time integration techniques are compared for a variety of two-and three-dimensional problems.",
    "name": "Finite Element Methods in Structural Dynamics",
    "subj": "CIVL"
  },
  "CIVL-6780": {
    "crse": "6780",
    "description": "State-of-the-art in computational modeling of failure processes in materials. Topics include numerical modeling of discrete defects, distributed damage, and multiscale computational techniques including multiple scale perturbation techniques, boundary layer techniques, and various global-local approaches.",
    "name": "Numerical Modeling of Failure Processes in Materials",
    "subj": "CIVL"
  },
  "CIVL-6900": {
    "crse": "6900",
    "description": "Civil and environmental engineering graduate students present seminars about their research to an audience composed of students and faculty, and participate in discussions about the research of others. The course consists of one-hour weekly meetings. The faculty member in charge of the course helps the students develop their presentation and communication skills. M.S. and Ph.D. students are required to take this course once before completion of their terminal degree. This course is not required for M. Eng. students not doing a thesis or project.",
    "name": "Civil and Environmental Engineering Graduate Seminar",
    "subj": "CIVL"
  },
  "CIVL-6910": {
    "crse": "6910",
    "description": "Seminars by distinguished guest speakers. All undergraduates and graduates are strongly encouraged to attend as many lectures as possible.",
    "name": "Colloquium Series",
    "subj": "CIVL"
  },
  "CIVL-6940": {
    "crse": "6940",
    "description": "",
    "name": "Readings in Civil Engineering",
    "subj": "CIVL"
  },
  "CIVL-6960": {
    "crse": "6960",
    "description": "",
    "name": "Topics in Civil Engineering",
    "subj": "CIVL"
  },
  "CIVL-6970": {
    "crse": "6970",
    "description": "Active participation in a semester-long project, under the supervision of a faculty adviser. A Professional Project often serves as a culminating experience for a Professional Master's program but, with departmental or school approval, can be used to fulfill other program requirements. With approval, students may register for more than one Professional Project. Professional Projects must result in documentation established by each department or school, but are not submitted to the Office of Graduate Education and are not archived in the library. Grades of A, B, C, or F are assigned by the faculty adviser at the end of the semester. If not completed on time, a formal Incomplete grade may be assigned by the faculty adviser, listing the work remaining to be completed and the time limit for completing this work.",
    "name": "Professional Project",
    "subj": "CIVL"
  },
  "CIVL-6980": {
    "crse": "6980",
    "description": "Active participation in a master's-level project, under the supervision of a faculty adviser, leading to a master's project report. Grades S or U are assigned at the end of the semester. If recommended by the adviser, the master's project may be accepted by the Office of Graduate Education to be archived in the library.",
    "name": "Master's Project",
    "subj": "CIVL"
  },
  "CIVL-6990": {
    "crse": "6990",
    "description": "Active participation in research, under the supervision of a faculty adviser, leading to a master's thesis. Grades of S or U are assigned by the adviser each term to reflect the student's research progress for the given semester. Once the thesis has been presented, approved by the adviser, and accepted by the Office of Graduate Education, it will be archived in a standard format in the library.",
    "name": "Master's Thesis",
    "subj": "CIVL"
  },
  "CIVL-9990": {
    "crse": "9990",
    "description": "Active participation in research, under the supervision of a faculty adviser, leading to a doctoral dissertation. Grades of IP are assigned until the dissertation has been publicly defended, approved by the doctoral committee, and accepted by theÂ Office of Graduate EducationÂ to be archived in a standard format in the library. Grades will then be listed as S.",
    "name": "Dissertation",
    "subj": "CIVL"
  },
  "COGS-2120": {
    "crse": "2120",
    "description": "This course is an introduction to the new and quickly growing field of cognitive science. Cognitive Science is a highly interdisciplinary field of study of mind at the intersection of philosophy, psychology, computer science, neuroscience, linguistics, and anthropology.Â",
    "name": "Introduction to Cognitive Science",
    "subj": "COGS"
  },
  "COGS-2340": {
    "crse": "2340",
    "description": "This course offers a survey of scientific and applied approaches to the study of human language, highlighting the endlessly surprising nature of this sophisticated mode of communication. A sampling of the topics to be covered: phonology, morphology, syntax, semantics, lexicography, psycholinguistics, and historical linguistics. Lecture course. Â",
    "name": "Introduction to Linguistics",
    "subj": "COGS"
  },
  "COGS-4210": {
    "crse": "4210",
    "description": "Recent advances in Cognitive Science, Computer Science and Mathematics, have resulted in the ability to develop computer programs that implement Probabilistic Cognitive Models (PCMs). The cognitive models that this course covers are based on approximate Bayesian Inference implemented by Markov Chain Monte Carlo and Variational techniques that have made this approach tractable. The objective of this course is to enable the student to develop models of cognition in a Bayesian framework. Â",
    "name": "Cognitive Modeling",
    "subj": "COGS"
  },
  "COGS-4220": {
    "crse": "4220",
    "description": "In this course, students will deepen their understanding of research principles and experimental practices in cognitive and behavioral science, and they will gain experience in applying concepts often discussed in human-oriented contexts (e.g., learning, theory of mind) to the animal world. In addition, they will be prepared to participate in revolutionizing our treatment of both the animals and the people with whom we share our lives. Â",
    "name": "Animal Cognition and Interaction with Humans",
    "subj": "COGS"
  },
  "COGS-4330": {
    "crse": "4330",
    "description": "This survey course is intended as an introduction to Cognitive Neuroscience. The topics covered will focus on exploring the neural underpinnings for cognitive processes, such as sensation, language, attention, motor control, executive functions, social communication, emotions, consciousness, and learning/memory. Basic aspects of nervous system function and neuroanatomy, brain development/evolution, structural and functional imaging techniques, and other research methods used in Cognitive Neuroscience will be discussed. Â",
    "name": "Introduction to Cognitive Neuroscience",
    "subj": "COGS"
  },
  "COGS-4340": {
    "crse": "4340",
    "description": "This course will explore how linguistics, the scientific study of the properties of human language and languages, can be applied to the development of intelligent agents that can fluently and meaningfully communicate with people in natural language. It will focus on linguistic phenomena that have so far been particularly resistant to effective machine processing, such as lexical ambiguity resolution, reference resolution, ellipsis, indirect speech acts, implicature, and non-literal language (e.g., metaphor and irony).Â",
    "name": "The Linguistics of Computational Linguistics",
    "subj": "COGS"
  },
  "COGS-4360": {
    "crse": "4360",
    "description": "This course is an introduction to the role of physiological mechanisms in behavioral processes. There will be detailed examination and discussion of the involvement of biological systems in feeding and drinking, sexual behavior, sleep and arousal, learning and memory, psychopathology and psychopharmacology.",
    "name": "Behavioral Neuroscience",
    "subj": "COGS"
  },
  "COGS-4410": {
    "crse": "4410",
    "description": "Research in Cognitive Science and Artificial Intelligence (AI) is driven by data. Researchers in these fields collect, manipulate, model and analyze data generated by real-world processes. Â Since the amount of data available has grown exponentially, the ability to automate these tasks through computer programs is essential. Specifically, probabilistic and statistical computing are needed to learn from the data. The objectives of this course are for the student to perform exploratory data analysis and to acquire the basics of statistical and machine learning in order to model real-world datasets. Â",
    "name": "Programming for Cognitive Science and Artificial Intelligence",
    "subj": "COGS"
  },
  "COGS-4420": {
    "crse": "4420",
    "description": "This course introduces students to basic concepts and methods of artificial intelligence and their applications in computer games. The topics include decision making, movement, path finding, and AI for human-like characters. This course will take the form of a combination of lectures, presentations by students, class discussions, and independent study.",
    "name": "Game AI",
    "subj": "COGS"
  },
  "COGS-4430": {
    "crse": "4430",
    "description": "Digital gaming is one of the most rapidly developing fields. The effort required for developing games is not trivial. To make a game fun to play, the design of the game levels and/or the AI-driven opponents need to be intelligent and adaptive to the players' strategies and skills. In this course, students will learn and explore using machine learning techniques to automate the design process of digital games. The course will cover basic and advanced topics in Artificial Intelligence and Learning, such as Decision Trees, Neural Networks, Genetic Algorithms, and Reinforcement Learning. Students will gain hands-on experience in applying these techniques in computer games. The course will also introduce psychological theories and studies about people's decision-making and emotional processes and how they are related to the players' experience in games. This course will take the form of a combination of lectures, presentations by students, class discussions, and independent study. Â",
    "name": "Learning and Advanced Game AI",
    "subj": "COGS"
  },
  "COGS-4440": {
    "crse": "4440",
    "description": "\"Sensibilities\"âa special ART_X@Rensselaer (Art Across the Curriculum) seminarâdraws from the tremendous resource of EMPAC to inspire students to cultivate writing skills through the cross-disciplinary theme of the senses/perception. During the semester students will have opportunities to observe unique art/science presentations and performances in an intimate setting at EMPAC, providing rich experiences for discussions and writing. Classes include reading science and art texts, as well as writing workshops to develop authorial voice and experimentation. Â",
    "name": "Sensibilities",
    "subj": "COGS"
  },
  "COGS-4560": {
    "crse": "4560",
    "description": "This course will explore the different strategies used by different languages to fulfill the same needs of human communication. A sampling of topics: quickly learning the basics of a new language using linguistic principles; cross-linguistic knowledge elicitation and engineering;Â principles of generative grammar; space, time, agency, and other linguistic phenomena viewed cross-linguistically.",
    "name": "Cross-linguistic Perspectives",
    "subj": "COGS"
  },
  "COGS-4600": {
    "crse": "4600",
    "description": "Perception and thought are considered in terms of processes represented in the brain. The localization and lateralization of function are examined, drawing upon research on the behavioral effects of brain damage as well as brain-imaging studies and other approaches. Examples of topics include object recognition, memory, language, emotion, spatial ability, and motor processes.",
    "name": "Cognition and the Brain",
    "subj": "COGS"
  },
  "COGS-4610": {
    "crse": "4610",
    "description": "This seminar course is a detailed examination of the mind-brain relationship, through study of the stress response. Stress is simply defined as any challenge to an individual's homeostasisÂ or balance. This course will explore the neurobiological underpinnings of the stress response, with particular focus on how stressors can alter perception, affective and cognitive processing in the individual, which can in turn feedback to alter the general health of the individual (body and mind/brain).Â Â",
    "name": "Stress and the Brain",
    "subj": "COGS"
  },
  "COGS-4620": {
    "crse": "4620",
    "description": "Covers cognitive theory from an applied perspective to understand and predict the interactions among human cognition, artifact (i.e., tools), and task. Cognitive task analysis techniques will be taught and used throughout the course, as will techniques for collecting and analyzing fine-grained behavioral data. Topics covered may include visual search and visual attention, cognitive skill and its acquisition, hard and soft constraints on interactive behavior, human error, soft constraints on judgment and decision-making, and experts and expertise.",
    "name": "Cognitive Engineering",
    "subj": "COGS"
  },
  "COGS-4640": {
    "crse": "4640",
    "description": "This course introduces various computational approaches for creating intelligent conversational agents. This course will take the form of a combination of lectures, presentations by students, class discussions, and independent study.",
    "name": "Intelligent Virtual Agents",
    "subj": "COGS"
  },
  "COGS-4700": {
    "crse": "4700",
    "description": "This course will examine hormone and brain/behavior relationships across the lifespan.Â Hormones are molecules that are secreted by glands (the majority of which are located outside the brain) and have distal effects on their targets, such as the brain, throughout development.Â A focus will be on hormones' effects, mechanisms, and brain regions of interest for behavior and cognitive processes, such as perception, learning/memory, social cognition, motivation, and emotion. Â",
    "name": "Hormones, Brain, and Behavior",
    "subj": "COGS"
  },
  "COGS-4780": {
    "crse": "4780",
    "description": "This course will serve as a seminar for advanced students of linguistics. The material to be covered will be selected collaboratively by the instructor and each cohort of students. Students, who ideally will have taken at least two linguistics-oriented courses previously, will be guided in pursuing topics that they have found particularly compelling in previous courses.Â",
    "name": "Advanced Topics in Linguistics",
    "subj": "COGS"
  },
  "COGS-4880": {
    "crse": "4880",
    "description": "This course will concentrate on the knowledge-based modeling of intelligent agents, with a special emphasis on semantically-oriented language processing. Theoretical and conceptual discussions will be balanced by practical work within the implemented OntoAgent cognitive architecture. It will discuss the modeling of decision-making, the various aspects of natural-language processing, and the art of knowledge engineering.",
    "name": "Language-Endowed Intelligent Agents",
    "subj": "COGS"
  },
  "COGS-4940": {
    "crse": "4940",
    "description": "An individually arranged independent study course under the supervision of a member of the Cognitive Science Department. The topic is selected by consultation between student and faculty member.",
    "name": "Readings in Cognitive Science",
    "subj": "COGS"
  },
  "COGS-4960": {
    "crse": "4960",
    "description": "An advanced course concerned with selected topics in cognitive science.",
    "name": "Topics in Cognitive Science",
    "subj": "COGS"
  },
  "COGS-4990": {
    "crse": "4990",
    "description": "Students conduct original scholarly projects: original research, theoretical or analytical reviews of the literature, or computer simulations. Students prepare written reports relating to this project, under the supervision of a faculty member.Â",
    "name": "Undergraduate Thesis",
    "subj": "COGS"
  },
  "COGS-6100": {
    "crse": "6100",
    "description": "Integrated cognitive systems comprise human cognitive, perception, and motor subsystems in coordinated action with interactive devices. Examples may be as simple as a human using a VCR or as complex as the behavior exhibited by Air Force pilots. This course will introduce students to the cognitive theory behind integrated cognitive systems, the techniques for collecting and analyzing data such as eye movements and action protocols, as well as the software tools available for the representation of interactive behavior.",
    "name": "Seminar in Cognitive Engineering",
    "subj": "COGS"
  },
  "COGS-6200": {
    "crse": "6200",
    "description": "This course covers reasoning, decision making, and behavioral game theory, which are major domains in human higher order cognition. Each topic begins with normative theories and continues through formal and mathematical models, and the introduction of empirical studies. The course emphasizes integrations of competing approaches within a domain, integration between reasoning and decision making, and integration between individual decision making and game-theoretic interactions. Each year, the course has a theme. The theme for this year is quantum cognition, which applies quantum theory in cognitive modeling. This course is designed as self-contained, and has no prerequisites. A middle term presentation and a final term paper are required for each student. Graduate students only.",
    "name": "Cognition",
    "subj": "COGS"
  },
  "COGS-6210": {
    "crse": "6210",
    "description": "This is a graduate level course that introduces the student to computational cognitive modeling. Cognitive modeling is the simulation of human cognitive, perceptual, and motor processes based on a cognitive architecture. The benefit of cognitive modeling is that it facilitates the testing of ideas about human processes through comparison of model data with empirical data. This course covers ACT-R, a symbolic architecture and LEABRA, a neural-level architecture.",
    "name": "Cognitive Modeling I",
    "subj": "COGS"
  },
  "COGS-6220": {
    "crse": "6220",
    "description": "This is a graduate level course that extends the objectives of Cognitive Modeling I to additional cognitive architectures. The first part of the course is a survey of cognitive modeling paradigms. The second part will be a more in-depth coverage ofÂ two or three architectures and will be done by teams of students. Each team will study one architecture including the development of a model.",
    "name": "Cognitive Modeling II",
    "subj": "COGS"
  },
  "COGS-6240": {
    "crse": "6240",
    "description": "This course is about the connection between logic and artificial intelligence (AI). It may be partitioned into three general sections: 1) the straightforward application of first order logic (FOL) in AI; 2) the broadening of FOL to enable a robot to reason in a commonsense way (nonmonotonic reasoning, induction, etc.) and to formalize a robot agent's belief and knowledge system (modal logics, etc.); and 3) using a logical approach to the Frame Problem and to building a planner.",
    "name": "Logic and Artificial Intelligence",
    "subj": "COGS"
  },
  "COGS-6340": {
    "crse": "6340",
    "description": "This course will explore how linguistics, the scientific study of the properties of human language and languages, can be applied to the development of intelligent agents that can fluently and meaningfully communicate with people in natural language. It will focus on linguistic phenomena that have so far been particularly resistant to effective machine processing, such as lexical ambiguity resolution, reference resolution, ellipsis, indirect speech acts, implicature, and non-literal language (e.g., metaphor and irony).Â",
    "name": "The Linguistics of Computational Linguistics",
    "subj": "COGS"
  },
  "COGS-6410": {
    "crse": "6410",
    "description": "This course is a graduate course that teaches Cognitive Science and Artificial Intelligence concepts by enabling the student to develop and understand computer programs that implement them. It covers data collection and analysis, task environments, natural language, cognitive architectures, and learning. Some previous programming experience is very beneficial but not required.",
    "name": "Programming for Cognitive Science and Artificial Intelligence",
    "subj": "COGS"
  },
  "COGS-6420": {
    "crse": "6420",
    "description": "This course is a graduate level introduction to the topic of perception and action, and will focus on the significance of perception, motor control, and perceptual-motor learning as they relate to the performance of routine and skilled tasks. It will explore perception and action from information processing, computational, dynamical systems, and ecological perspectives, review current empirical and computational research, and consider some applications, including training, rehabilitation, human-machine interaction, and robotics.",
    "name": "Perception and Action",
    "subj": "COGS"
  },
  "COGS-6430": {
    "crse": "6430",
    "description": "Digital gaming is one of the most rapidly developing fields. The effort required for developing games is not trivial. To make a game fun to play, the design of the game levels and/or the AI-driven opponents need to be intelligent and adaptive to the players' strategies and skills. In this course, students will learn and explore using machine learning techniques to automate the design process of digital games. The course will cover basic and advanced topics in Artificial Intelligence and Learning, such as Decision Trees, Neural Networks, Genetic Algorithms, and Reinforcement Learning. Students will gain hands-on experience in applying these techniques in computer games. The course will also introduce psychological theories and studies about people's decision-making and emotional processes and how they are related to the players' experience in games. This course will take the form of a combination of lectures, presentations by students, class discussions, and independent study.",
    "name": "Learning and Advanced Game AI",
    "subj": "COGS"
  },
  "COGS-6560": {
    "crse": "6560",
    "description": "This course will explore the different strategies used by different languages to fulfill the same needs of human communication. A sampling of topics: quickly learning the basics of a new language using linguistic principles; cross-linguistic knowledge elicitation and engineering; principles of generative grammar; space, time, agency, and other linguistic phenomena viewed cross-linguistically.Â",
    "name": "Cross-linguistic Perspectives",
    "subj": "COGS"
  },
  "COGS-6570": {
    "crse": "6570",
    "description": "An accelerated course covering important behavioral statistical concepts including probability, sampling distributions, hypothesis resting, ANOVA, and multiple regression. Course requires usage of statistical software package and is taught using the general linear model framework.",
    "name": "Advanced Behavioral Statistics",
    "subj": "COGS"
  },
  "COGS-6640": {
    "crse": "6640",
    "description": "This course introduces various computational approaches for creating intelligent conversational agents. This course will take the form of a combination of lectures, presentations by students, class discussions, and independent study.",
    "name": "Intelligent Virtual Agent",
    "subj": "COGS"
  },
  "COGS-6690": {
    "crse": "6690",
    "description": "An in-depth study of quasi-experimental and experimental design of behavioral research. Topics include test construction and development, factor analysis, meta-analysis, repeated measures, and MANOVA.",
    "name": "Seminar in Research Design",
    "subj": "COGS"
  },
  "COGS-6780": {
    "crse": "6780",
    "description": "This course will serve as a seminar for advanced students of linguistics. The material to be covered will be selected collaboratively by the instructor and each cohort of students. Students, who ideally will have taken at least two linguistics-oriented courses previously, will be guided in pursuing topics that they have found particularly compelling in previous courses.Â",
    "name": "Advanced Topics in Linguistics",
    "subj": "COGS"
  },
  "COGS-6880": {
    "crse": "6880",
    "description": "This course will concentrate on the knowledge-based modeling of intelligent agents, with a special emphasis on semantically-oriented language processing. Theoretical and conceptual discussions will be balanced by practical work within the implemented OntoAgent cognitive architecture. The course will cover the modeling of decision-making, the various aspects of natural-language processing, and the art of knowledge engineering.Â",
    "name": "Language-Endowed Intelligent Agents",
    "subj": "COGS"
  },
  "COGS-6940": {
    "crse": "6940",
    "description": "An individually arranged independent study course under the supervision of a member of the Cognitive Science Department. The topic is selected by consultation between student and faculty member.",
    "name": "Readings in Cognitive Science",
    "subj": "COGS"
  },
  "COGS-6960": {
    "crse": "6960",
    "description": "An advanced course concerned with selected topics in cognitive science.",
    "name": "Topics in Cognitive Science",
    "subj": "COGS"
  },
  "COGS-6980": {
    "crse": "6980",
    "description": "Active participation in a master's-level project, under the supervision of a faculty adviser, leading to a master's project report. Grades S or U are assigned at the end of the semester. If recommended by the adviser, the master's project may be accepted by the Office of Graduate Education to be archived in the library.",
    "name": "Master's Project",
    "subj": "COGS"
  },
  "COGS-6990": {
    "crse": "6990",
    "description": "Active participation in research, under the supervision of a faculty adviser, leading to a masterâs thesis. Grades of S or U are assigned by the adviser each term to reflect the student's research progress for the given semester. Once the thesis has been presentend, approved by the adviser, and accepted by the Office of Graduate Education, it will be archived in a standard format in the library.",
    "name": "Masterâs Thesis",
    "subj": "COGS"
  },
  "COGS-9990": {
    "crse": "9990",
    "description": "Active participation in research, under the supervision of a faculty adviser, leading to a doctoral dissertation. Grades of S or U are assigned by the adviser each term to reflect the student's research progress for the given semester. Once the dissertation has been publicly defended, approved by the doctoral committee, and accepted by the Office of Graduate Education, it will be archived in a standard format in the library.",
    "name": "Doctoral Thesis",
    "subj": "COGS"
  },
  "COMM-2410": {
    "crse": "2410",
    "description": "This course helps students understand the meaning and emotional complexity of visual images in their culture. Students examine photographic imagery through three perspectives. The firstâformalâaddresses the design components of the image, such as vantage point and contrast. The secondâpsychodynamicâconcerns the emotional dynamics of viewing. The thirdâsocial politicalâ explores photographs as instruments for preserving or challenging cultural values. No technical knowledge of photography is needed.",
    "name": "Perspectives on Photography",
    "subj": "COMM"
  },
  "COMM-2440": {
    "crse": "2440",
    "description": "Does documentary film depict reality or is it just another form of storytelling? This course takes a broad, historical look at documentary media, exposing students to a wide range of works that in some sense stand on claims to truth. Students are invited to develop a critical stance toward documentary modes of social representation, through viewing and analyzing colonial photography and cinema, ethnographic, propaganda, cinema verite, experimental, and even \"fake\" documentaries.",
    "name": "Documentary Film",
    "subj": "COMM"
  },
  "COMM-2520": {
    "crse": "2520",
    "description": "This course introduces students to basic topics in communication theory and research. It includes topics in interpersonal, group, organizational, mediated, and mass communication. Students will study and apply theories to real world situations and events and explore the social and cultural impact of new media technology.Â",
    "name": "Communication Theory and Practice",
    "subj": "COMM"
  },
  "COMM-2570": {
    "crse": "2570",
    "description": "Typography studies the form and function of alphabetic and pictographic systems in English-speaking society. The course aims to imbue in students a critical perspective on the role typography plays in the history and sustenance of civilization and the propagation of ideas throughout society. Students will read historical, theoretical, and evidence-based literature to glean principles for designing communicatively effective type. Verbal and visual assignments will enforce understanding of typographic principles and grammar for use in print and digital interfaces.",
    "name": "Typography",
    "subj": "COMM"
  },
  "COMM-2616": {
    "crse": "2616",
    "description": "This course engages students with the transmedial genre of superheroes, which has become one the most influential genres in film, television, video games, toys, and of course comicsânot to mention the cultural artifacts that are associated with its iconography. Through an examination of the genre's origins and history, its economic and aesthetic aspects, and the ideological issues that surround its narrativesâincluding representational dynamics of race, class, gender, sexuality and other vectors of identityâstudents in this course will become more critically aware consumers of popular culture media. Â",
    "name": "Superheroes in the Classroom",
    "subj": "COMM"
  },
  "COMM-2660": {
    "crse": "2660",
    "description": "This course introduces students to the practice of graphic design with a variety of hands-on projects. Studies include the principles and theories of 2D design and the integration of form, color, type, image, and content. Students will develop a heightened visual awareness and an understanding of how design influences meaning. The course emphasizes strategic and critical thinking in the solving of graphic design problems for the purposes of professional communication across a range of media platforms.Â",
    "name": "Introduction to Graphic Design",
    "subj": "COMM"
  },
  "COMM-2750": {
    "crse": "2750",
    "description": "This course engages students in a critical examination of television and its historical and present status as a dominant popular culture medium. Television in this context is broadly understood as an evolving medium for motion pictures in the age of technological convergence. Using a variety of analytical and theoretical approaches, we'll consider the significant influence television has on individual, social, and cultural experiencesâaddressing questions of representation, identity, economics, and ideology. The class uses a collaborative learning process, allowing students to influence the content and emphasis of the class and thereby reflecting the democratic nature of popular culture media.Â Â",
    "name": "Critical Television",
    "subj": "COMM"
  },
  "COMM-2940": {
    "crse": "2940",
    "description": "Readings and projects adapted to the needs of individual students.",
    "name": "Communication Studies",
    "subj": "COMM"
  },
  "COMM-2960": {
    "crse": "2960",
    "description": "Experimental courses tried out in one or two terms.",
    "name": "Topics in Communication",
    "subj": "COMM"
  },
  "COMM-4188": {
    "crse": "4188",
    "description": "The purpose of this course is to introduce the basics of strategic communication in digital and social media platforms, with a specific interest in the applications of digital and social media for communication professionals. In this course, students will learn key principles and techniques for digital content creation and promotion. Students will brainstorm, conceptualize, and develop an online presence and apply writing, research, and critical thinking to the practice of strategic communication.Â Â",
    "name": "Social Media & Strategic Communication",
    "subj": "COMM"
  },
  "COMM-4320": {
    "crse": "4320",
    "description": "This studio course explores new directions in art and design that include visual poetry (visual expression in which they shape an arrangement of text, images, symbols to convey the message) and interactive narrative. Visual poetics and narrative appear in advertisement, music videos, and other forms of communication. Students will experiment with these forms of communication and learn how these concepts apply in artistic and commercial contexts. The class format includes lectures, discussions, and studio work.",
    "name": "Visual Poetics and Narrative",
    "subj": "COMM"
  },
  "COMM-4420": {
    "crse": "4420",
    "description": "In this course, students will consider methods of gathering users' requirements for product functions and information, ways to test products and information for usability and suitability, and procedures for incorporating the results learned through testing. Students will design and conduct usability tests on products, documents, and interfaces of interest.",
    "name": "Foundations of HCI Usability",
    "subj": "COMM"
  },
  "COMM-4460": {
    "crse": "4460",
    "description": "This course introduces students to the theoretical and practical use of graphics as a form of visual communication. Discussions include topics such as the psychology of visual perception, design theory, creative process, formatted text, and graphics. Students have an opportunity to put theory into practice using computer graphics.",
    "name": "Visual Design: Theory and Application",
    "subj": "COMM"
  },
  "COMM-4470": {
    "crse": "4470",
    "description": "This course examines the design of technical information systems and their output in useful and well-designed documents and interfaces. The course includes the history of data visualization, visual rhetoric, and information systems such as DITA. Â",
    "name": "Information Design",
    "subj": "COMM"
  },
  "COMM-4530": {
    "crse": "4530",
    "description": "This course considers the sociopolitical and ethical dimensions of reality television and post-factual media content. An analysis of a variety of \"reality\" and news formats allows students to understand the evolution, economics, and, above all, the cultural and political significance of modern media. Topics include: simulation; social representation; commercialization; social media; surveillance; nationalism; and globalization.",
    "name": "Reality TV and Post-Factual Media",
    "subj": "COMM"
  },
  "COMM-4540": {
    "crse": "4540",
    "description": "HumansÂ inhabit a culture of visual images.Â Images bombardÂ them on television, the Internet, and in films; they surroundÂ everyone as architecture and fashion; they provide essential resource data in science, engineering, and business. This course will help students better understand how images communicate information, arouseÂ emotions, and shapeÂ values. Students will primarily do readings in cultural history/theory with some viewing of films.Â",
    "name": "Visual Culture",
    "subj": "COMM"
  },
  "COMM-4550": {
    "crse": "4550",
    "description": "How are religious fundamentalists using new media? Can religious conversion take place in a theme park? How are religious \"crossover\" films transforming political and popular cultural landscapes? This course maps the complex intersections of religion, culture, and media in the global transformations of religious traditions and explores, through a media frame, \"the return of religion\" within the secular consensus of modernity.",
    "name": "Religion in the Media",
    "subj": "COMM"
  },
  "COMM-4580": {
    "crse": "4580",
    "description": "An examination of the cultural impact of advertising in various media: TV, radio, print, and the Web. How does advertising inform human experience and identity? How has it shaped the culture? Who pays for it and why? Note: This is not a How-To course. The focus is critical analysis, not acquiring skills for producing advertising.Â",
    "name": "Advertising and Culture",
    "subj": "COMM"
  },
  "COMM-4690": {
    "crse": "4690",
    "description": "This course covers theory, research, and practice in interactive, multimedia interface design. Topics include visual perception, information architecture, rapid prototyping, usability testing, cross-cultural design, interactive data visualization, augmented reality, and intellectual property.Â Â",
    "name": "Interface Design: Hypermedia Theory and Application",
    "subj": "COMM"
  },
  "COMM-4730": {
    "crse": "4730",
    "description": "A brand is more than just a cool logo design. \"A brand is a perception or set of associations consumers have of a business.\" - (Felicia C. Sullivan) These perceptions originate from a consistent verbal and visual story communicated through a multitude of media platforms. In this class we'll define the brand story, create messaging, and design the logo, stationery, signage, packaging, advertising, schwag, motion graphics etc. The course culminates with the design of an identity standards manual defining the rules and principles to effectively communicate a consistent brand image.Â Â",
    "name": "Brand Identity Design",
    "subj": "COMM"
  },
  "COMM-4780": {
    "crse": "4780",
    "description": "This course introduces students to narrative theory andÂ interactive narratives in a variety of genres such as oral story-telling, literature, poetry, film, artists' books, historical narrative, hypertext fiction, Net Art, social media narratives, and computer games. Students will have the opportunity to design and develop an original interactive narrative.",
    "name": "Interactive Narrative",
    "subj": "COMM"
  },
  "COMM-4880": {
    "crse": "4880",
    "description": "The course covers interactive, multimedia interface design (for Web sites and apps) for data visualization or other forms of interactive information design. Innovative designs that explore new directions in interactive data design are highlighted. Topics include multisensory information design using graphics, sound, touch, and large-scale data projection. Interface design topics include user-centered design, information architecture, rapid prototyping, cross-cultural design, and intellectual property. Students may choose the applications they want to design for the class project.",
    "name": "Interactive Data Visualization",
    "subj": "COMM"
  },
  "COMM-4930": {
    "crse": "4930",
    "description": "Designed for first-semester senior Communication, Media, and Design majors, Pro-Seminar is the capstone course for the development of the Senior Project.Â Students will create a professional portfolio piece that showcases their work in the diverse disciplines of communication and media Â",
    "name": "Pro-Seminar in Communication, Media, and Design",
    "subj": "COMM"
  },
  "COMM-4940": {
    "crse": "4940",
    "description": "Readings and projects adapted to the needs of individual students.",
    "name": "Communication Studies",
    "subj": "COMM"
  },
  "COMM-4960": {
    "crse": "4960",
    "description": "Experimental courses tried out in one or two terms.",
    "name": "Topics in Communication",
    "subj": "COMM"
  },
  "COMM-4970": {
    "crse": "4970",
    "description": "This course is a hands-on investigation into communicating effectively using motion graphics. Students will learn the art of communicating in a time-based medium using typography, graphics, photos, illustrations, video, and audio. Investigations include logo and brand animations, title sequences, graphic and typographic narratives, and researching, interpreting, and animating data to communicate real-world problems.Â Â Â",
    "name": "2D Motion Graphics",
    "subj": "COMM"
  },
  "COMM-6200": {
    "crse": "6200",
    "description": "Technical communication today has a remarkably broad scope, including almost every area of life that involves technology, such as health, business, government, and scientific communication. This course addresses an essential part of communication studies and human-computer interaction: the authorship of the signifying level of interface design. Technical communication has grown way beyond people sitting in front of beige boxes writing manuals on how to operate other beige boxes. Instead, it has emerged as a central collection of skills aimed at how to get the right information to the right people at the right time, in a usable form. It has as much to do with information architecture, knowledge management, and information design as with writing reports and instructions. In addition, RPI has a long-standing heritage in technical communication, as the first academic degree in the field was offered here. In technical communication, RPI still maintains a high level of respect and market value for students and faculty at other institutions. Â",
    "name": "Foundations of Technical Communication",
    "subj": "COMM"
  },
  "COMM-6320": {
    "crse": "6320",
    "description": "This studio course explores new directions in art and design that include visual poetry (visual expression in which the shape and arrangement of text, images, and symbols covey the message) and interactive narrative. Visual poetics and narrative appear in advertisement, music videos, and other forms of communication. Students will experiment with these forms of communication and learn how these concepts apply in artistic and commercial contexts. The class format includes lectures, discussions, and studio work.Â",
    "name": "Visual Poetics and Narrative",
    "subj": "COMM"
  },
  "COMM-6420": {
    "crse": "6420",
    "description": "This course will consider methods for gathering users' requirements for product functions and information, ways to test products and information for usability and suitability, and procedures for incorporating the results learned through testing.Â Students will design and conduct usability tests on products, documents, and interfaces of interest.",
    "name": "Foundations of Human-Computer Interaction Usability",
    "subj": "COMM"
  },
  "COMM-6510": {
    "crse": "6510",
    "description": "Provides students an opportunity to enact communication practice from a strong foundation of textual and visual communication theory. Focuses on theories of text-making and distribution across media, qualitative and quantitative approaches to communication research, and applied rhetoric. Â",
    "name": "Communication Theory and Practice",
    "subj": "COMM"
  },
  "COMM-6530": {
    "crse": "6530",
    "description": "This course considers the sociopolitical and ethical dimensions of reality television, one of the most significant developments in recent popular culture. An analysis of a variety of reality formats allows students to understand the evolution, economics, and, above all, the cultural and political significance of modern media. Topics include post-truth or post-factual communication; the representation of gender, class, and race; celebrity; advertising and commercialization; audience interaction; surveillance; mediation and reality. Â",
    "name": "Reality TV and Post-Factual Media",
    "subj": "COMM"
  },
  "COMM-6560": {
    "crse": "6560",
    "description": "This course introduces students to the theoretical and practical use of graphics as a form of visual communication. Discussions include such topics as visual perception, design theory, formatted text, and graphics. Students have an opportunity to put theory into practice using computer graphics software.",
    "name": "Visual Design: Theory and Application",
    "subj": "COMM"
  },
  "COMM-6700": {
    "crse": "6700",
    "description": "Photography is the first modern visual technology that is reproducible yet still has an aura of \"objectivity,\" and its study addresses issues that are central to all forms of contemporary image-making, from art and architecture to politics, social media, and game design. Using the rhetorical triad of producer, photographer, and audience, the course introduces students across HASS to various methodologies of visual analysis through semiotics, phenomenology, neuropsychology, and psychodynamics of affect.",
    "name": "Rhetoric of the Photograph",
    "subj": "COMM"
  },
  "COMM-6730": {
    "crse": "6730",
    "description": "A brand is more than just a cool logo design. \"A brand is a perception or set of associations consumers have of a business.\" -(Felicia C. Sullivan)Â These perceptions originate from a consistent verbal and visual story communicated through a multitude of media platforms. In this class, we'll define the brand story, create messaging, and design the logo, stationery, signage, packaging, advertising, schwag, motion graphics, etc. The course culminates with the design of an identity standards manual defining the rules and principles to effectively communicate a consistent brand image. Â",
    "name": "Brand Identity Design",
    "subj": "COMM"
  },
  "COMM-6780": {
    "crse": "6780",
    "description": "This course introduces students to narrative theory andÂ interactive narratives in a variety of genres such as oral story-telling, literature, poetry, film, artists' books, historical narrative, hypertext fiction, Net Art, social media narratives, and computer games. Students will have the opportunity to design and develop an original interactive narrative.",
    "name": "Interactive Narrative",
    "subj": "COMM"
  },
  "COMM-6880": {
    "crse": "6880",
    "description": "This course covers interactive, multimedia interface design (for Web sites and apps) for data visualization or other forms of interactive information design. Innovative designs that explore new directions in interactive data design are highlighted. Topics include multisensory information design using graphics, sound, touch, and large-scale data projection. Interface design topics include user-centered design, information architecture, rapid prototyping, cross-cultural design, and intellectual property. Students may choose the applications they want to design for the class project.Â",
    "name": "Interactive Data Visualization",
    "subj": "COMM"
  },
  "COMM-6940": {
    "crse": "6940",
    "description": "Readings and projects adapted to the needs of individual students.",
    "name": "Communication Studies",
    "subj": "COMM"
  },
  "COMM-6960": {
    "crse": "6960",
    "description": "Experimental courses tried out in one or two terms.",
    "name": "Topics in Communication",
    "subj": "COMM"
  },
  "COMM-6990": {
    "crse": "6990",
    "description": "Active participation in research, under the supervision of a faculty adviser, leading to a master's thesis. Grades of S or U are assigned by the adviser each term to reflect the student's research progress for the given semester. Once the thesis has been presented, approved by the adviser, and accepted by the Office of Graduate Education, it will be archived in a standard format in the library.",
    "name": "Master's Thesis",
    "subj": "COMM"
  },
  "COMM-9990": {
    "crse": "9990",
    "description": "Active participation in research, under the supervision of a faculty adviser, leading to a doctoral dissertation. Grades of IP are assigned until the dissertation has been publicly defended, approved by the doctoral committee, and accepted by theÂ Office of Graduate EducationÂ to be archived in a standard format in the library. Grades will then be listed as S.",
    "name": "Dissertation",
    "subj": "COMM"
  },
  "CSCI-1100": {
    "crse": "1100",
    "description": "An introduction to computer programming algorithm design and analysis. Additional topics include basic computer organization; internal representation of scalar and array data; use of top-down design and subprograms to tackle complex problems; abstract data types. Enrichment material as time allows. Interdisciplinary case studies, numerical and nonnumerical applications. Students who have passed CSCI 1200 cannot register for this course.",
    "name": "Computer Science I",
    "subj": "CSCI"
  },
  "CSCI-1190": {
    "crse": "1190",
    "description": "This course teaches elementary programming concepts using the MATLAB environment for engineering students with little or no prior programming experience. Concepts include variables, looping, and function calls. Students cannot get credit for CSCI 1190 after earning credit for CSCI 1100 or any higher-level CSCI course.",
    "name": "Beginning Programming for Engineers",
    "subj": "CSCI"
  },
  "CSCI-1200": {
    "crse": "1200",
    "description": "Programming concepts: functions, parameter passing, pointers, arrays, strings, structs, classes, templates. Mathematical tools: sets, functions, and relations, order notation, complexity of algorithms, proof by induction. Data structures and their representations: data abstraction and internal representation, sequences, trees, binary search trees, associative structures. Algorithms: searching and sorting, generic algorithms, iterative and recursive algorithms. Methods of testing correctness and measuring performance.",
    "name": "Data Structures",
    "subj": "CSCI"
  },
  "CSCI-2200": {
    "crse": "2200",
    "description": "This course introduces important mathematical and theoretical tools for computer science, including topics from set theory, combinatorics, and probability theory, and then proceeds to automata theory, the Turing Machine model of computation, and notions of computational complexity. The course will emphasize formal reasoning and proof techniques.",
    "name": "Foundations of Computer Science",
    "subj": "CSCI"
  },
  "CSCI-2300": {
    "crse": "2300",
    "description": "Data structures and algorithms, and the mathematical techniques necessary to design and analyze them. Basic data structures: lists, associative structures, trees. Mathematical techniques for designing algorithms and analyzing worst-case and expected-case algorithm efficiency. Advanced data structures: balanced trees, tries, heaps, priority queues, graphs. Searching, sorting. Algorithm design techniques: dynamic programming, greedy algorithms, divide-and-conquer, backtracking. Example graph, string, geometric, and numeric algorithms.",
    "name": "Introduction to Algorithms",
    "subj": "CSCI"
  },
  "CSCI-2500": {
    "crse": "2500",
    "description": "Introduction to computer organization, assembler language, and operating systems. Computer systems organization: processors, memory, I/O. Digital logic: gates, Boolean algebra, digital logic circuits, memory, buses. Microprogramming. Machine level: instruction formats, addressing modes, instruction types, flow of control. Operating systems: virtual memory, virtual I/O instructions, processes, interprocess communication. Numeric representation. Assembler language: the assembly process, macros, linking, loading. Advanced architectures: RISC architectures, parallel architectures.",
    "name": "Computer Organization",
    "subj": "CSCI"
  },
  "CSCI-2600": {
    "crse": "2600",
    "description": "A study of important concepts in software design, implementation, and testing. Topics include specification, abstraction with classes, design principles and patterns, testing, refactoring, the software development process, GUI and event-driven programming, and cloud-based programming. The course also introduces implementation and testing tools, including IDEs, revision control systems, and other frameworks. The overarching goal of the course is for students to learn how to write correct and maintainable software.",
    "name": "Principles of Software",
    "subj": "CSCI"
  },
  "CSCI-4020": {
    "crse": "4020",
    "description": "This course presents fundamental ideas and techniques of modern algorithm design and analysis. After completing this course, students should be able to formally analyze and design efficient algorithms for a variety of computational problems. Topics covered include Greedy Algorithms, Dynamic Programming, Network Flow, NP-Completeness, Linear Programming, Network Algorithms, as well as probabilistic and approximate algorithms.",
    "name": "Design and Analysis of Algorithms",
    "subj": "CSCI"
  },
  "CSCI-4030": {
    "crse": "4030",
    "description": "State-of-the-art in contemporary algorithm design, randomized algorithms are algorithms that use randomness as part of their functioning. They are typically simple, often easy to analyze, and work well in practice. They have numerous applications in many fields of computer science and mathematics. Randomized algorithms represent an active and vibrant research area with many exciting new results contributed every year.",
    "name": "Randomized Algorithms",
    "subj": "CSCI"
  },
  "CSCI-4040": {
    "crse": "4040",
    "description": "Algorithms with provable guarantees on the quality of their solutions are a powerful way of dealing with intractable problems. This course covers fundamental techniques for designing approximation algorithms. Possible topics include: semi-definite and linear programming, inapproximability and the PCP theorem, randomized rounding, metrics and cuts, primal-dual methods, and online algorithms.",
    "name": "Approximation Algorithms",
    "subj": "CSCI"
  },
  "CSCI-4100": {
    "crse": "4100",
    "description": "Introduction to the theory, algorithms, and applications of machine learning (supervised, reinforcement, and unsupervised) from data: What is learning? Is learning feasible? How can we do it? How can we do it well? The course offers a mix of theory, technique, and application with additional selected topics chosen from Pattern Recognition,Â Decision Trees, Neural Networks, RBF's, Bayesian Learning, PAC Learning, Support Vector Machines, Gaussian processes, and Hidden Markov Models.",
    "name": "Machine Learning from Data",
    "subj": "CSCI"
  },
  "CSCI-4110": {
    "crse": "4110",
    "description": "Introduction to the computational and algorithmic aspects of social processes. Topics covered will be selected to illustrate the diverse challenges in algorithmic social process analysis: social networks and their dynamics; information flow; hidden networks. Algorithms involving social and selfish agents, social choice theory, voting, and auctions. Ranking actors in networks, recommendation systems, peer-review, and aggregation of rankings/reviews.",
    "name": "Computational Social Processes",
    "subj": "CSCI"
  },
  "CSCI-4120": {
    "crse": "4120",
    "description": "Introduction to the computational and mathematical techniques for practical financial applications. The course will emphasize the algorithmic side of finance. Topics will be selected from pricing (options and derivatives), trading, risk-evaluation, selfish agents, sequential decisions, and portfolio optimization. Examples of the mathematical and algorithmic techniques covered are martingale measures, risk-neutral pricing and Monte Carlo, dynamic programing, and stochastic processes.",
    "name": "Computational Finance",
    "subj": "CSCI"
  },
  "CSCI-4150": {
    "crse": "4150",
    "description": "Topics and techniques of artificial intelligence using the language LISP. Topics include search, knowledge representation, expert systems, theorem proving, natural language interfaces, learning, game playing, and computer vision. Techniques include pattern matching, data-driven programming, substitution rules, frames, heuristic search, transition networks, neural networks, and evolutionary computation. Development of programming proficiency in LISP is emphasized.",
    "name": "Introduction to Artificial Intelligence",
    "subj": "CSCI"
  },
  "CSCI-4210": {
    "crse": "4210",
    "description": "Discussion of various aspects of computer operating systems design and implementation. Topics include I/O programming, concurrent processes and synchronization problems, process management and scheduling of processes, virtual memory management, device management, file systems, deadlock problems, system calls, and interprocess communication. Programming projects are required.",
    "name": "Operating Systems",
    "subj": "CSCI"
  },
  "CSCI-4220": {
    "crse": "4220",
    "description": "Programming with an overview of the principles of computer networks, including a detailed look at the OSI reference model and various popular network protocol suites. Concentration on Unix interprocess communication (IPC), network programming using TCP and UDP, as well as client-side and mobile programming. Programming projects are required.",
    "name": "Network Programming",
    "subj": "CSCI"
  },
  "CSCI-4230": {
    "crse": "4230",
    "description": "A self-contained course that includes topics from number theory, basic cryptography, and protocol security.Â This is a hybrid course with sufficient depth in both theory and hands-on experience with network protocols. Topics include: Classical Cryptography, Block Ciphers (DES, AES), Information Theoretical Cryptography, Randomness, RNG and Stream Ciphers, Hash and MAC Algorithms, Public-Key Cryptography, Elliptic Curve Cryptography, Digital Signatures and Identification, Internet Attacks, Web Security, SSL and PGP.Â This is a communication-intensive course.",
    "name": "Cryptography and Network Security I",
    "subj": "CSCI"
  },
  "CSCI-4250": {
    "crse": "4250",
    "description": "This course will offer an introduction to network science and a review of current research in this area. Classes will interchangeably present chapters from the textbook and related current research. The emphasis will be on the mathematical background of network science: graphs and networks; random networks and various types of scale-free networks; network properties such as assortativity, mobility, robustness, social networks, and communities; and dynamics of spreading in networks.",
    "name": "Frontiers of Network Science",
    "subj": "CSCI"
  },
  "CSCI-4260": {
    "crse": "4260",
    "description": "Fundamental concepts and methods of graph theory and its applications to computing and the social and natural sciences. Topics include graphs as models, representation of graphs, trees, distances, matchings, connectivity, flows in networks, graph colorings, Hamiltonian cycles, traveling salesman problem, planarity. All concepts, methods, and applications are presented through a sequence of exercises and problems, many of which are done with the help of novel software systems for combinatorial computing.",
    "name": "Graph Theory",
    "subj": "CSCI"
  },
  "CSCI-4270": {
    "crse": "4270",
    "description": "The goal of this course is to introduce students to the problems, challenges, and applications of computer vision from a computational perspective.Â Topics include camera modeling and image formation, feature extraction, object and face recognition, image mosaic construction, stereo and three-dimensional imaging, motion, and tracking.Â Machine learning methods, including deep convolutional neural networks, will be studied and applied throughout the course.",
    "name": "Computational Vision",
    "subj": "CSCI"
  },
  "CSCI-4310": {
    "crse": "4310",
    "description": "This course introduces Linux kernel programming basics and starts by examining how Berkeley sockets bridge the user-kernel gap. The remainder of the course is spent looking into transport layer (e.g., TCP) and network layer (e.g., IP) implementations. Students do both individual and group programming projects. In addition to coding, there are detailed write-ups and peer reviews in this course.Â This is a communication-intensive course.",
    "name": "Networking in the Linux Kernel",
    "subj": "CSCI"
  },
  "CSCI-4320": {
    "crse": "4320",
    "description": "Techniques and methods for parallel programming: models of parallel machines and programs, efficiency and complexity of parallel algorithms. Paradigms of parallel programming and corresponding extensions to sequential programming languages. Overview of parallel languages and coordination languages and models; programming on networks of workstations. Basic parallel algorithms: elementary computation, matrix multiplication, sorting; sample scientific application.",
    "name": "Parallel Programming",
    "subj": "CSCI"
  },
  "CSCI-4340": {
    "crse": "4340",
    "description": "This course provides an introduction to ontologies, their uses, and an overview of their application in semantically enabled systems. Ontologies encode term meanings and are used to improve communication and enable computer programs to function more effectively. Class participants learn how to use ontologies in Web-based applications and evaluate ontologies for reuse. Participants read relevant papers, learn how to critically review ontology papers and ontologies, and participate in group project(s) designing, using, and evaluating ontologies.",
    "name": "Ontologies",
    "subj": "CSCI"
  },
  "CSCI-4350": {
    "crse": "4350",
    "description": "Data science is advancing the inductive conduct of science and is driven by the greater volumes, complexity, and heterogeneity of data being made available over the Internet. It combines aspects of data management, library science, computer science, and physical science. It is changing the way all of these disciplines do both their individual and collaborative work. Key methodologies in application areas based on real research experience are taught.",
    "name": "Data Science",
    "subj": "CSCI"
  },
  "CSCI-4370": {
    "crse": "4370",
    "description": "Data and Society provides a broad overview of how society is leveraging and responding to the social, organizational, policy, and technical opportunities and challenges of a data-driven world. Course themes focus on various aspects of the data ecosystem, data and innovation, and data and the broader community. Assignments build writing, presentation, and critical thinking, and assessment skills, all of which are important for professional success.Â This is a communication-intensive course.",
    "name": "Data and Society",
    "subj": "CSCI"
  },
  "CSCI-4380": {
    "crse": "4380",
    "description": "Discussion of the state of practice in modern database systems, with an emphasis on relational systems. Topics include database design, database system architecture, SQL, normalization techniques, storage structures, query processing, concurrency control, recovery, security, and new directions such as object-oriented and distributed database systems. Students gain hands-on experience with commercial database systems and interface building tools. Programming projects are required.",
    "name": "Database Systems",
    "subj": "CSCI"
  },
  "CSCI-4390": {
    "crse": "4390",
    "description": "This course will provide an introductory survey of the main topics in data mining and knowledge discovery in databases (KDD), including: classification, clustering, association rules, sequence mining, similarity search, deviation detection, and so on. Emphasis will be on the algorithmic and system issues in KDD, as well as on applications such as Web mining, multimedia mining, bioinformatics, geographical information systems, etc.",
    "name": "Data Mining",
    "subj": "CSCI"
  },
  "CSCI-4400": {
    "crse": "4400",
    "description": "Informatics covers a broad range of disciplines addressing challenges in the explosion of data and information resources. Xinformatics provides commonality for implementations in specific disciplines, e.g. X=astro, geo. Informatics' theoretical bases are information and computer science, cognitive science, social science, library science, aggregating these studies and adding the practice of information processing, and the engineering of information systems. This course grounds the material that students will learn in discipline areas by coursework and project assignments.",
    "name": "X-informatics",
    "subj": "CSCI"
  },
  "CSCI-4420": {
    "crse": "4420",
    "description": "This course covers basic concepts and results in mathematical logic and computability theory, including decision procedures, automated theorem proving techniques for truth-functional and first-order logic, axiomatizations of set theory and arithmetic, Turing Machines, Abacus Machines, recursive functions, the Church-Turing Thesis, the halting problem, undecidability of first-order logic, undecidability of arithmetic, and Godel's incompleteness results.",
    "name": "Computability and Logic",
    "subj": "CSCI"
  },
  "CSCI-4430": {
    "crse": "4430",
    "description": "This course is a study of the important concepts found in current programming languages. Topics include language processing (lexical analysis, parsing, type-checking, interpretation and compilation, run-time environment), the role of abstraction (data abstraction and control abstraction), programming paradigms (procedural, functional, object-oriented, logic-oriented, generic), and formal language definition.",
    "name": "Programming Languages",
    "subj": "CSCI"
  },
  "CSCI-4440": {
    "crse": "4440",
    "description": "Software system design methodology emphasizing use of object oriented modeling of application domains and of software systems and emphasizing the roles of written and oral communication in software engineering. Project management and software testing. Individual and team projects include specification, software architecture, user interfaces, and documentation of the phases of a project. This is a communication-intensive course.",
    "name": "Software Design and Documentation",
    "subj": "CSCI"
  },
  "CSCI-4450": {
    "crse": "4450",
    "description": "The goal of this course is to introduce students to program analysis and its many applications in software engineering, particularly in improving software quality and software productivity. Concretely, students who successfully complete this course should be able to: (1) understand and apply program analysis techniques, such as dataflow analysis and type-based analysis; (2) implement program analysis; (3) understand and apply software testing techniques, such as black-box testing and white-box testing; and (4) understand and apply refactoring techniques.",
    "name": "Principles of Program Analysis",
    "subj": "CSCI"
  },
  "CSCI-4460": {
    "crse": "4460",
    "description": "This course focuses on software development techniques in support of large-scale software projects and maintenance. Specific topics include various programming paradigms and techniques, approaches to testing and automation, debugging, refactoring, and inheriting code. Individual and team assignments are required, including programming assignments. Project topics include text processing, building a search engine, and the like.Â This is a communication-intensive course.",
    "name": "Large-Scale Programming and Testing",
    "subj": "CSCI"
  },
  "CSCI-4470": {
    "crse": "4470",
    "description": "Open source communities are proven development engines for creating large diverse user-focused software; however, these communities are not easily supported by traditional models of software development. Expected behaviors, tools, and licensing are uniquely adapted to the needs of an often volunteer workforce, distributed and asynchronous development, and meritocracy. In this course, students use and develop open source software, create open source repositories, and participate in open source communities.",
    "name": "Open Source Software",
    "subj": "CSCI"
  },
  "CSCI-4480": {
    "crse": "4480",
    "description": "A survey of the fundamental issues necessary for the design, analysis, control, and implementation of robotic systems. The mathematical description of robot manipulators in terms of kinematics and dynamics. Hardware components of a typical robot arm. Path following, control, and sensing. Examples of several currently available manipulators.Â Â",
    "name": "Robotics I",
    "subj": "CSCI"
  },
  "CSCI-4500": {
    "crse": "4500",
    "description": "This course will enable students to understand and apply theoretical foundations of programming concurrent, distributed, and mobile computing systems, namely process calculi, actors, join calculus, and mobile ambients. In the practical part, students will compare communication and synchronization aspects in concurrent programming languages following these theoretical models. Students will also review current research on distributed computing over the Internet, on topics including but not limited to coordination, mobility, heterogeneity, security, fault tolerance, scalability, programmability, and verification.",
    "name": "Distributed Computing Over The Internet",
    "subj": "CSCI"
  },
  "CSCI-4510": {
    "crse": "4510",
    "description": "This course explores the principles of distributed systems, emphasizing fundamental issues underlying the design of such systems: communication, coordination, synchronization, and fault-tolerance. Key algorithms and theoretical results will be studied and students will explore how these foundations play out in modern systems and applications.",
    "name": "Distributed Systems and Algorithms",
    "subj": "CSCI"
  },
  "CSCI-4530": {
    "crse": "4530",
    "description": "This course will survey classic papers and current research in computer graphics. Topics include: advanced ray tracing, global illumination, photon mapping, subsurface scattering, mesh generation and simplification, subdivision surfaces, volumetric modeling, procedural modeling and texturing, weathering, physical simulation, appearance models. Course activities include programming assignments, oral presentations, and a term project.",
    "name": "Advanced Computer Graphics",
    "subj": "CSCI"
  },
  "CSCI-4540": {
    "crse": "4540",
    "description": "This course follows Game Development I. Students work in interdisciplinary teams to create one large-scale 3D game, working from concept to public release. Projects may include games, educational games, serious games and simulations, and interactive artworks, and will focus on creative design, technical execution, and use of game design principles. The course builds on skills and knowledge in previous courses in the GSAS core, including game design, game mechanics, game programming, art, and narrative. Â",
    "name": "Game Development II",
    "subj": "CSCI"
  },
  "CSCI-4550": {
    "crse": "4550",
    "description": "Visualizing data is a key step in understanding many problems. This course is designed to introduce students to methods of visualizing many different types of data, such as images, three-dimensional surfaces, flow fields, and medical data. Both existing visualization software and program custom visualizations using C++ and OpenGL will be used. Course activities include discussion of recent and classic research papers, weekly homework assignments, in-class critiques of visualization artifacts, and a final project to explore creative uses of these techniques. This is a communication-intensive course.",
    "name": "Interactive Visualization",
    "subj": "CSCI"
  },
  "CSCI-4600": {
    "crse": "4600",
    "description": "The world at-large is confronted with increasingly larger and complex sets of structured/unstructured information; from cyber and human sources. Traditional enterprises are moving toward analytics-driven approaches for core business functions. Data and information analytics extends analysis (descriptive models of data) by using data mining and machine learning methods, with optimization and validation, to recommend action or guide and communicate decision-making. Thus, analytics is an entire methodology rather than individual analyses or analysis steps.",
    "name": "Data Analytics",
    "subj": "CSCI"
  },
  "CSCI-4700": {
    "crse": "4700",
    "description": "The course is intended to provide a computational perspective on one or more topics chosen from theory and algorithms; systems and software; artificial intelligence and data; or vision, graphics, robotics, and games.Â Students will read classic and recent research results in the field, write critical reviews of these publications, engage in in-class presentations and discussions, and/or write a publication-quality report on an innovative final project of their choice.",
    "name": "Technical Writing and Communication in Computer Science",
    "subj": "CSCI"
  },
  "CSCI-4800": {
    "crse": "4800",
    "description": "A survey of numerical methods for scientific and engineering problems. Topics include numerical solution of linear and nonlinear algebraic equations, interpolation and least squares approximations, numerical integration and differentiation, eigenvalue problems, and an introduction to the numerical solution of ordinary differential equations. Emphasis is placed on efficient computational procedures including the use of library and student written procedures using high-level software such as MATLAB.",
    "name": "Numerical Computing",
    "subj": "CSCI"
  },
  "CSCI-4820": {
    "crse": "4820",
    "description": "Derivation, analysis, and use of computational procedures for solving differential equations. Topics covered include ordinary differential equations (both initial value and boundary value problems) and partial differential equations. Runge-Kutta and multistep methods for initial value problems. Finite difference methods for partial differential equations including techniques for heat conduction, wave propagation, and potential problems. Basic convergence and stability theory.",
    "name": "Introduction to Numerical Methods for Differential Equations",
    "subj": "CSCI"
  },
  "CSCI-4940": {
    "crse": "4940",
    "description": "",
    "name": "Readings in Computer Science",
    "subj": "CSCI"
  },
  "CSCI-4960": {
    "crse": "4960",
    "description": "",
    "name": "Topics in Computer Science",
    "subj": "CSCI"
  },
  "CSCI-6040": {
    "crse": "6040",
    "description": "Algorithms with provable guarantees on the quality of their solutions are a powerful way of dealing with intractable problems. This course covers fundamental techniques for designing approximation algorithms. Possible topics include: semi-definite and linear programming, inapproximability and the PCP theorem, randomized rounding, metrics and cuts, primal-dual methods, and online algorithms.",
    "name": "Approximation Algorithms",
    "subj": "CSCI"
  },
  "CSCI-6100": {
    "crse": "6100",
    "description": "Introduction to the theory, algorithms, and applications of machine learning (supervised, reinforcement, and unsupervised) from data: What is learning? Is learning feasible? How can it be done? How can it be done well? The course offers a mix of theory, technique, and application with additional selected topics chosen from Pattern Recognition,Â Decision Trees, Neural Networks, RBF's, Bayesian Learning, PAC Learning, Support Vector Machines, Gaussian processes, and Hidden Markov Models.",
    "name": "Machine Learning from Data",
    "subj": "CSCI"
  },
  "CSCI-6110": {
    "crse": "6110",
    "description": "Introduction to the computational and algorithmic aspects of social processes. Topics covered will be selected to illustrate the diverse challenges in algorithmic social process analysis: social networks and their dynamics; information flow; hidden networks. Algorithms involving social and selfish agents, social choice theory, voting, and auctions. Ranking actors in networks, recommendation systems, peer-review, and aggregation of rankings/reviews. Students cannot receive credit for both CSCIÂ 4110 and CSCIÂ 6110.",
    "name": "Computational Social Processes",
    "subj": "CSCI"
  },
  "CSCI-6120": {
    "crse": "6120",
    "description": "Introduction to the computational and mathematical techniques for practical financial applications. The course will emphasize the algorithmic side of finance. Topics will be selected from pricing (options and derivatives), trading, risk-evaluation, selfish agents, sequential decisions, and portfolio optimization. Examples of the mathematical and algorithmic techniques covered are martingale measures, risk-neutral pricing and Monte Carlo, dynamic programing, and stochastic processes. Students cannot receive credit for both CSCI 4120 and CSCI 6120.",
    "name": "Computational Finance",
    "subj": "CSCI"
  },
  "CSCI-6220": {
    "crse": "6220",
    "description": "State-of-the-art in contemporary algorithm design, randomized algorithms are algorithms that use randomness as part of their functioning. They are typically simple, often easy to analyze, and work well in practice. They have numerous applications in many fields of computer science and mathematics. Randomized algorithms represent an active and vibrant research area with many exciting new results contributed every year. Students cannot receive credit for both CSCI 4030 and CSCI 6220.",
    "name": "Randomized Algorithms",
    "subj": "CSCI"
  },
  "CSCI-6230": {
    "crse": "6230",
    "description": "A self-contained course that includes topics from number theory, basic cryptography, and protocol security.Â This is a hybrid course with sufficient depth in both theory and hands-on experience with network protocols. Topics include: Classical Cryptography, Block Ciphers (DES, AES), Information Theoretical Cryptography, Randomness, RNG and Stream Ciphers, Hash and MAC Algorithms, Public-Key Cryptography, Elliptic Curve Cryptography, Digital Signatures and Identification, Internet Attacks, Web Security, SSL and PGP.",
    "name": "Cryptography and Network Security I",
    "subj": "CSCI"
  },
  "CSCI-6250": {
    "crse": "6250",
    "description": "This course will offer an introduction to network science and a review of current research in this area. Classes will interchangeably present chapters from the textbook andÂ related current research. The emphasis will be on the mathematical background of network science: graphs and networks; random networks and various types of scale-free networks; network properties such as assortativity, mobility, robustness, social networks, and communities; and dynamics of spreading in networks.",
    "name": "Frontiers of Network Science",
    "subj": "CSCI"
  },
  "CSCI-6270": {
    "crse": "6270",
    "description": "The goal of this course is to introduce students to the problems, challenges, and applications of computer vision from a computational perspective.Â Topics include camera modeling and image formation, feature extraction, object and face recognition, image mosaic construction, stereo and three-dimensional imaging, motion, and tracking.Â Machine learning methods, including deep convolutional neural networks, will be studied and applied throughout the course.Â",
    "name": "Computational Vision",
    "subj": "CSCI"
  },
  "CSCI-6310": {
    "crse": "6310",
    "description": "This course introduces Linux kernel programming basics and starts by examining how Berkeley sockets bridge the user-kernel gap. The remainder of the course is spent looking into transport layer (e.g., TCP) and network layer (e.g., IP) implementations. Students do both individual and group programming projects. In addition to coding, there are detailed write-ups and peer reviews in this course.",
    "name": "Networking in the Linux Kernel",
    "subj": "CSCI"
  },
  "CSCI-6340": {
    "crse": "6340",
    "description": "This course provides an introduction to ontologies, their uses, and an overview of their application in semantically enabled systems. Ontologies encode term meanings and are used to improve communication and enable computer programs to function more effectively. Class participants learn how to use ontologies in web-based applications and evaluate ontologies for reuse. Participants read relevant papers, learn how to critically review ontology papers and ontologies, and participate in group project(s) designing, using, and evaluating ontologies.",
    "name": "Ontologies",
    "subj": "CSCI"
  },
  "CSCI-6350": {
    "crse": "6350",
    "description": "Data science is advancing the inductive conduct of science and is driven by the greater volumes, complexity, and heterogeneity of data being made available over the Internet. It combines aspects of data management, library science, computer science, and physical science. It is changing the way all of these disciplines do both their individual and collaborative work. Key methodologies in application areas based on real research experience are taught.",
    "name": "Data Science",
    "subj": "CSCI"
  },
  "CSCI-6360": {
    "crse": "6360",
    "description": "A survey of fundamental issues in design of efficient programs for parallel computers. The topics discussed include models of parallel machines and programs, efficiency of parallel algorithms, programming styles for shared memory, message passing, data parallelism, and using MPI in scientific parallel programs. Parallel programming project required.",
    "name": "Parallel Computing",
    "subj": "CSCI"
  },
  "CSCI-6370": {
    "crse": "6370",
    "description": "Data and Society provides a broad overview of how society is leveraging and responding to the social, organizational, policy, and technical opportunities and challenges of a data-driven world. Course themes focus on various aspects of the data ecosystem, data and innovation, and data and the broader community. Assignments build writing, presentation, and critical thinking and assessment skills, all of which are important for professional success.Â This is a communication-intensive course.",
    "name": "Data and Society",
    "subj": "CSCI"
  },
  "CSCI-6390": {
    "crse": "6390",
    "description": "This course will provide an introductory survey of the main topics in data mining and knowledge discovery in databases (KDD), including: classification, clustering, association rules, sequence mining, similarity search, deviation detection, and so on. Emphasis will be on the algorithmic and system issues in KDD, as well as on applications such as Web mining, multimedia mining, bioinformatics, geographical information systems, etc.",
    "name": "Data Mining",
    "subj": "CSCI"
  },
  "CSCI-6400": {
    "crse": "6400",
    "description": "Informatics covers a broad range of disciplines addressing challenges in the explosion of data and information resources. Xinformatics provides commonality for implementations in specific disciplines, e.g. X=astro, geo. Informatics' theoretical bases are information and computer science, cognitive science, social science, library science, aggregating these studies and adding the practice of information processing, and the engineering of information systems. This course grounds the material that students will learn in discipline areas by coursework and project assignments.Â",
    "name": "X-informatics",
    "subj": "CSCI"
  },
  "CSCI-6450": {
    "crse": "6450",
    "description": "The goal of this course is to introduce students to program analysis and its many applications in software engineering, particularly in improving software quality and software productivity. Concretely, students who successfully complete this course should be able to: (1) understand and apply program analysis techniques, such as dataflow analysis and type-based analysis; (2) implement program analysis; (3) understand and apply software testing techniques, such as black-box testing and white-box testing; and (4) understand and apply refactoring techniques.",
    "name": "Principles of Program Analysis",
    "subj": "CSCI"
  },
  "CSCI-6460": {
    "crse": "6460",
    "description": "This course focuses on software development techniques in support of large-scale software projects and maintenance. Specific topics include various programming paradigms and techniques, approaches to testing and automation, debugging, refactoring, and inheriting code. Individual and team assignments are required, including programming assignments. Project topics include text processing, building a search engine, and the like.",
    "name": "Large-Scale Programming and Testing",
    "subj": "CSCI"
  },
  "CSCI-6500": {
    "crse": "6500",
    "description": "This course will enable students to understand and apply theoretical foundations of programming concurrent, distributed, and mobile computing systems, namely process calculi, actors, join calculus, and mobile ambients. In the practical part, students will compare communication and synchronization aspects in concurrent programming languages following these theoretical models. Students will also review current research on distributed computing over the Internet, on topics including but not limited to coordination, mobility, heterogeneity, security, fault tolerance, scalability, programmability, and verification.",
    "name": "Distributed Computing Over The Internet",
    "subj": "CSCI"
  },
  "CSCI-6510": {
    "crse": "6510",
    "description": "This course explores the principles of distributed systems, emphasizing fundamental issues underlying the design of such systems: communication, coordination, synchronization, and fault-tolerance. Key algorithms and theoretical results will be studied and students will explore how these foundations play out in modern systems and applications.",
    "name": "Distributed Systems and Algorithms",
    "subj": "CSCI"
  },
  "CSCI-6530": {
    "crse": "6530",
    "description": "In this course, there will be a survey of classic papers and current research in computer graphics. Topics include: advanced ray tracing, global illumination, photon mapping, subsurface scattering, mesh generation and simplification, subdivision surfaces, volumetric modeling, procedural modeling and texturing, weathering, physical simulation, appearance models. Course activities include programming assignments, oral presentations, and a term project.Â This is a communication-intensive course.",
    "name": "Advanced Computer Graphics",
    "subj": "CSCI"
  },
  "CSCI-6550": {
    "crse": "6550",
    "description": "Visualizing data is a key step in understanding many problems. This course is designed to introduce students to methods of visualizing many different types of data, such as images, three-dimensional surfaces, flow fields, and medical data. Both existing visualization software and program custom visualizations using C++ and OpenGL will be used. Course activities include discussion of recent and classic research papers, weekly homework assignments, in-class critiques of visualization artifacts, and a final project to explore creative uses of these techniques. This is a communication-intensive course.",
    "name": "Interactive Visualization",
    "subj": "CSCI"
  },
  "CSCI-6800": {
    "crse": "6800",
    "description": "Gaussian elimination, special linear systems (such as positive definite, banded, or sparse), introduction to parallel computing, iterative methods for linear systems (such as conjugate gradient and preconditioning), QR factorization and least squares problems, and eigenvalue problems.",
    "name": "Computational Linear Algebra",
    "subj": "CSCI"
  },
  "CSCI-6820": {
    "crse": "6820",
    "description": "Numerical methods and analysis for ODEs with applications from mechanics, optics, and chaotic dynamics. Numerical methods for dynamic systems include Runge-Kutta, multistep and extrapolation techniques, methods for conservative and Hamiltonian systems, methods for stiff differential equations and for differential-algebraic systems. Methods for boundary value problems include shooting and orthogonalization, finite difference and collocation techniques, and special methods for problems with boundary or shock layers.",
    "name": "Numerical Solution of Ordinary Differential Equations",
    "subj": "CSCI"
  },
  "CSCI-6840": {
    "crse": "6840",
    "description": "Numerical methods and analysis for linear and nonlinear PDEs with applications from heat conduction, wave propagation, solid and fluid mechanics, and other areas. Basic concepts of stability and convergence (Lax equivalence theorem, CFL condition, energy methods). Methods for parabolic problems (finite differences, method of lines, ADI, operator splitting), methods for hyperbolic problems (vector systems and characteristics, dissipation and dispersion, shocks capturing and tracking schemes), methods for elliptic problems (finite difference and finite volume methods).Â",
    "name": "Numerical Solution of Partial Differential Equations",
    "subj": "CSCI"
  },
  "CSCI-6860": {
    "crse": "6860",
    "description": "Galerkin's method and extremal principles, finite element approximations (Lagrange, hierarchical and 3-D approximations, interpolation errors), mesh generation and assembly, adaptivity (h-, p-, hp-refinement). Error analysis and convergence rates. Perturbations resulting from boundary approximation, numerical integration, etc. Time dependent problems including parabolic and hyperbolic PDEs. Applications will be selected from several areas including heat conduction, wave propagation, potential theory, and solid and fluid mechanics.",
    "name": "Finite Element Analysis",
    "subj": "CSCI"
  },
  "CSCI-6900": {
    "crse": "6900",
    "description": "Presentation of current developments in computer science. Reports by students.",
    "name": "Computer Science Seminar",
    "subj": "CSCI"
  },
  "CSCI-6940": {
    "crse": "6940",
    "description": "",
    "name": "Readings in Computer Science",
    "subj": "CSCI"
  },
  "CSCI-6960": {
    "crse": "6960",
    "description": "",
    "name": "Topics in Computer Science",
    "subj": "CSCI"
  },
  "CSCI-6970": {
    "crse": "6970",
    "description": "Active participation in a semester-long project, under the supervision of a faculty adviser. A Professional Project often serves as a culminating experience for a Professional Master's program but, with departmental or school approval, can be used to fulfill other program requirements. With approval, students may register for more than one Professional Project. Professional Projects must result in documentation established by each department or school, but are not submitted to theÂ Office of Graduate EducationÂ and are not archived in the library. Grades of A, B, C, or F are assigned by the faculty adviser at the end of the semester. If not completed on time, a formal Incomplete grade may be assigned by the faculty adviser, listing the work remaining to be completed and the time limit for completing this work.",
    "name": "Professional Project",
    "subj": "CSCI"
  },
  "CSCI-6980": {
    "crse": "6980",
    "description": "Active participation in a master's-level project, under the supervision of a faculty adviser, leading to a master's project report. Grades S or U are assigned at the end of the semester.Â If recommended by the adviser, the master's project may be accepted by the Office of Graduate Education to be archived in the library.",
    "name": "Master's Project",
    "subj": "CSCI"
  },
  "CSCI-6990": {
    "crse": "6990",
    "description": "Active participation in research, under the supervision of a faculty adviser, leading to a masterâs thesis. Grades of S or U are assigned by the adviser each term to reflect the student's research progress for the given semester. Once the thesis has been presentend, approved by the adviser, and accepted by the Office of Graduate Education, it will be archived in a standard format in the library.",
    "name": "Masterâs Thesis",
    "subj": "CSCI"
  },
  "CSCI-9990": {
    "crse": "9990",
    "description": "Active participation in research, under the supervision of a faculty adviser, leading to a doctoral dissertation. Grades of IP are assigned until the dissertation has been publicly defended, approved by the doctoral committee, and accepted by the Office of Graduate Education to be archived in a standard format in the library. Grades will then be listed as S.",
    "name": "Dissertation",
    "subj": "CSCI"
  },
  "ECON-1200": {
    "crse": "1200",
    "description": "This course is designed to introduce a wide variety of concepts and applications in the broad subject of economics, economics being the study of people's choices. Traditionally, these choices have been framed as how to best employ scarce resources to produce goods and services and distribute them for consumption. To describe these choices the cause will introduce the concepts of opportunity cost, demand and supply theory, and market structures. It will consider the role of government in making resource allocation choices. Students will also study important macroeconomic data such as gross domestic product, economic growth rates, inflation, and unemployment. Additionally, studied will be the role of money and banking in the economy and short-run events such as recessions and expansions. Overall, the course will provide the student with an encompassing view of how economic principles and concepts relate to the broader economy and society. Â Credit cannot be obtained for both IHSS 1200 and ECON 1200 Â",
    "name": "Introductory Economics",
    "subj": "ECON"
  },
  "ECON-2010": {
    "crse": "2010",
    "description": "This course combines demand, derived from consumer preferences, and supply, based on firms' production functions, to establish market prices for goods and services. Calculus-based techniques are used to minimize costs and maximize utility and profits across differing industry structures. Product pricing strategies are examined. The course also provides an introduction to topics such asÂ the pricing of stocks and bonds, game theory, positive and negative externalities, asymmetric information, and behavioral economics. Applies the microeconomic theory of the firm to price, cost, and output decisions of business enterprises under different market structures. Regression analysis of demand and cost, linear programming of production and simulation analysis of risk, and capital budgeting are also presented.",
    "name": "Intermediate Microeconomic Theory",
    "subj": "ECON"
  },
  "ECON-2020": {
    "crse": "2020",
    "description": "Attention is directed primarily to variations in the aggregate volume of output, income, and employment. Cyclical fluctuations and long-term economic trends are examined and the interrelations of business and government policies are analyzed. The applicability of economic theory to the problems of business forecasting is discussed.",
    "name": "Intermediate Macroeconomic Theory",
    "subj": "ECON"
  },
  "ECON-2940": {
    "crse": "2940",
    "description": "",
    "name": "Readings in Economics",
    "subj": "ECON"
  },
  "ECON-2960": {
    "crse": "2960",
    "description": "Selected topics in economics designed to acquaint students with modern economic problems and analysis in special areas beyond the introductory level.",
    "name": "Topics in Economics",
    "subj": "ECON"
  },
  "ECON-4010": {
    "crse": "4010",
    "description": "Core topics of microeconomic theory are covered: consumer demand, firm production, decisions under uncertainty, game theory, markets for goods with perfect and imperfect competition, and market failures. Microeconomic theory is applied to real cases. Examples include product pricing, technological innovation, firm growth, consumer and producer welfare, social welfare impacts of government policy, monopoly and oligopoly, and resource allocation.",
    "name": "Applied Microeconomics",
    "subj": "ECON"
  },
  "ECON-4110": {
    "crse": "4110",
    "description": "Technological innovation is responsible for most economic growth and is crucial to deal with major societal concerns. This course examines the economics of innovation and new technologies. It shows how technologies are created and put to use, from basic science through invention and development to diffusion and practical use. Additional topics include R&D determinants, sources of innovation, product improvement, cost reduction, incentivizing and stimulating innovation, patents, evolution of innovation and technology, innovative competition in industry, and the national innovation environment. Â",
    "name": "Economics of Innovation and New Technologies",
    "subj": "ECON"
  },
  "ECON-4120": {
    "crse": "4120",
    "description": "Application of mathematical techniques to economic modeling and analysis. Construction of models to describe aspects of the economy and to analyze potential policies. Solution methods for issues including optimal choice with and without constraints, equilibria among multiple actors, marginal effects of policies, and dynamic economic models. Some mathematical maturity is assumed, and mathematical skills are taught throughout the course.",
    "name": "Mathematical Methods in Economics",
    "subj": "ECON"
  },
  "ECON-4130": {
    "crse": "4130",
    "description": "Financial institutions, especially commercial banking and the Federal Reserve System, are considered from three perspectives: their monetary roles; trends in the economic, organizational, and technological aspects of their operations; and their other economic roles-a critical view. Also, the role of money in macroeconomic theory is considered along with the role of monetary policies in relation to the problems of inflation and unemployment.",
    "name": "Money and Banking",
    "subj": "ECON"
  },
  "ECON-4140": {
    "crse": "4140",
    "description": "Acquaints students with the structural characteristics and philosophical foundations of enterprise and industry. Several important industries are considered from the viewpoint of market structure, conduct, and performance. Such concepts as the corporation, entrepreneurial outcomes, technological innovation, private property, andÂ public policy toward business are examined to orient the student to contemporaryÂ industrial activity.",
    "name": "Structure of Industry:  Competition, Innovation, Entrepreneurship, Policy",
    "subj": "ECON"
  },
  "ECON-4150": {
    "crse": "4150",
    "description": "Examine regulations related to the environment, intellectual property rights, healthcare, and antitrust. Examine the interaction between regulatory policies and how businesses respond to them with respect to innovation, production, and pricing. Some of the industries and markets examined to highlight the regulatory policy issues include automobiles, information technology, telecommunications and media, healthcare services, pharmaceuticals, medical devices, retail sector, high-speed rail, and taxi and ridesharing. Â",
    "name": "Economics of Government Regulation and Firm Strategy",
    "subj": "ECON"
  },
  "ECON-4160": {
    "crse": "4160",
    "description": "Emphasis is placed on the analysis of efficient resource use in the public sector at the federal level. Expenditure theory, tax incidence, and income distribution policies are discussed. The effects of personal income, corporation, sales, payroll, and property taxes on resource allocation, equity, and growth are considered.",
    "name": "Public Finance",
    "subj": "ECON"
  },
  "ECON-4170": {
    "crse": "4170",
    "description": "Examine various facets of the healthcare industry. Application of microeconomic theory and tools will be used to: analyze healthcare demand and supply; examine the impact of public policies; study market segments such as health insurance and pharmaceuticals; explore economic choices of healthcare professionals; identify potential socioeconomic and demographic determinants of health status and healthcare; and gain insights into issues related to the ongoing healthcare policy reform. Â",
    "name": "Health Economics and Policy",
    "subj": "ECON"
  },
  "ECON-4180": {
    "crse": "4180",
    "description": "A critical examination in which comparisons are made and contrasts emphasized between different schools of economic thinking such as classicism, marginalism, socialism, institutionalism, neoclassicism, and Keynesianism. Special attention is given to historical theories and attitudes of economists toward technological change and its impact on human welfare.",
    "name": "Development of Economic Thought",
    "subj": "ECON"
  },
  "ECON-4190": {
    "crse": "4190",
    "description": "This course investigates the significance of economic globalization, covering the following topics: international trade and financial flows, technological innovation and intellectual property, technology transfer, national government and transnational corporations, natural resources, health and the environment, impacts on selected industries and countries, and roles of the world trade organization and international monetary fund. The major controversies surrounding globalization are identified, and alternative arguments are evaluated based on available evidence.",
    "name": "International Economics and Globalization",
    "subj": "ECON"
  },
  "ECON-4200": {
    "crse": "4200",
    "description": "This course is an introduction to open economy macroeconomics and international finance. The core objective of the course is to teach students macroeconomic models and enable them to analyze international economic phenomena. Topics covered include theories of intertemporal trade, sources of global imbalances and their adjustment mechanisms, the determination of exchange rates, the effect of fiscal and monetary policies under different exchange rate regimes, balance of payment crisis, consequences of financial globalization. Â",
    "name": "Open Economy Macroeconomics",
    "subj": "ECON"
  },
  "ECON-4210": {
    "crse": "4210",
    "description": "The techniques necessary to appraise the economic desirability and private-sector impact of various public projects and policies are studied. Concepts such as discounting, capital rationing, project selection, shadow pricing, risk assessment, unpriced goods, and economic surplus are developed. Among the topics from which illustrative case studies are drawn are urban and transport planning, energy, water resources, government regulation, and the environment. Â",
    "name": "Cost-Benefit Analysis",
    "subj": "ECON"
  },
  "ECON-4220": {
    "crse": "4220",
    "description": "Game theory has been emerging as a branch of mathematical economics and applied to analyze situations where each decision-maker needs to think strategically about others' perspectives and actions in order to determine ones' own optimal choice. This course provides an introduction and presents selected topics in game theory. It will look into basic definitions and equilibrium concepts and develop a wide range of applications in Economics, Biology, sports, health care, and various fields. The goal of the lecture is to improve understanding of strategic interaction in economic, business, and social situations.",
    "name": "Applied Game Theory",
    "subj": "ECON"
  },
  "ECON-4230": {
    "crse": "4230",
    "description": "Develops a critical understanding of environmental issues and policy from an interdisciplinary economics perspective. Covers the economics of environmental quality including the links between the economy and the environment, the causes of environmental problems, evaluation of environmental projects and policies, and policies to address environmental issues with an emphasis on efficiency, equity, and sustainability, and the international dimensions of environmental issues.",
    "name": "Environmental Economics",
    "subj": "ECON"
  },
  "ECON-4240": {
    "crse": "4240",
    "description": "Addresses the allocation of natural resources through applied study of fisheries, forestry, oil, minerals, water, and biodiversity resources. Mathematical analysis will be done using Microsoft Excel with Solver. Social and policy dynamics of allocation decisions will be explored through case studies. Field trips will address ecological and physical aspects of resource management. The intent is to develop a balanced perspective and tools to address resource management decisions across their diverse economic, social, and environmental dimensions.",
    "name": "Natural Resource Economics",
    "subj": "ECON"
  },
  "ECON-4250": {
    "crse": "4250",
    "description": "This course explores the relationships between the economy and the material world. It identifies the most critical challenges to sustainable economic development on local to global scales and ways of addressing them. The course examines options surrounding material and energy flows, technological alternatives, livelihoods, consumption behavior, public policy, civil society institutions, and social movements as avenues for meeting the major challenges to sustainability.",
    "name": "Economy, Technology, and Sustainability",
    "subj": "ECON"
  },
  "ECON-4260": {
    "crse": "4260",
    "description": "Introduces students to the basic analytical approaches to environmental issues and natural resource use. Emphasis is on economic valuation and public policy. Covers traditional approaches based on assumptions of economic rationality and market efficiency as well as current approaches from the fields of environmental science behavioral economics. Emphasis is on active student participation and examination of current environmental controversies.",
    "name": "Environmental and Resource Economics",
    "subj": "ECON"
  },
  "ECON-4270": {
    "crse": "4270",
    "description": "Integrates theory from psychology, neuroscience, and other social sciences into traditional economic models of human behavior. By relaxing the standard assumptions of perfect rationality and selfishness, more realistic modeling features such as loss aversion, present-bias, social norms, and habit formation improve economic analyses. These techniques are used to analyze individuals' health behaviors, health insurance markets, and healthcare policy. Â",
    "name": "Behavioral Economics",
    "subj": "ECON"
  },
  "ECON-4280": {
    "crse": "4280",
    "description": "Examine advanced econometric and statistical methods for the analysis of high-dimensional data, otherwise known as \"Big Data.\" In this setting, detailed information for each unit of observation informs machine learning techniques such as classification and regression trees; random forests; penalized regressions; and boosted estimation. These prediction methods are then utilized to improve causal modeling, with applications in the study of healthcare demand and supply modeling, and behavior of consumers and businesses. Â",
    "name": "Econometric Methods for Big Data",
    "subj": "ECON"
  },
  "ECON-4290": {
    "crse": "4290",
    "description": "Students will learn about markets related to healthcare, insurance, biopharmaceuticals, and medical devices. Examine economic issues, models and quantitative analysis related to firms' activities in areas such as innovation, R&D expenditures, patenting, pricing, mergers and acquisitions, and competition in markets. Examine the role played by health insurance systems. Study the economic implications of regulations, such as those by the U.S. FDA. Economic and policy aspects will be examined within the context of the U.S. healthcare sector, along with selected comparisons to European national healthcare systems.",
    "name": "Economics of Biotech and Medical Innovations",
    "subj": "ECON"
  },
  "ECON-4310": {
    "crse": "4310",
    "description": "Market-based economies depend upon legal systems that establish and protect property rights. In this and many other instances the law is designed to encourage and support economic activity; in others it is designed to restrain certain types of otherwise rational economic behavior. This course will apply fundamental economic concepts, such as supply and demand, competition, monopoly, externalities, and Pareto efficiency to a range of legal topics, including contracts, torts, criminal, and intellectual property law to explain the economic motivation and consequences of the legal framework. For those students considering law school, this course offers an exposure to many of the legal concepts found in the first year law school curriculum. Â",
    "name": "Law and Economics",
    "subj": "ECON"
  },
  "ECON-4320": {
    "crse": "4320",
    "description": "An exploration of models of decision-making under alternative assumptions, expanding on \"rational\" models of introductory economics. The course will discuss the assumptions of these standard models and their shortcomings. The shortcomings will be addressed through the exploration of limited attention and considerations of fairness, uncertainty, and strategic interaction. Applications in areas such as consumer and household finance, marketing, and public policy will be emphasized throughout. Â",
    "name": "Economic Models of Decision-Making",
    "subj": "ECON"
  },
  "ECON-4330": {
    "crse": "4330",
    "description": "This course will examine a wide range of financial markets and institutions and the micro-and macroeconomic forces that relate to them. Topics include the use of derivative securities such as future, options, and swap agreements, and their roles in distributing financial risk. The course will be driven by textbook readings, supplemented by current news stories, articles from the financial press, and research articles.Â Â Â",
    "name": "Economics of Financial Institutions and Markets",
    "subj": "ECON"
  },
  "ECON-4340": {
    "crse": "4340",
    "description": "This course describes how individuals and firms make financial decisions, and how those decisions might deviate from those predicted by traditional financial or economic theory. The course examines how the insights of behavioral economics complement the traditional finance paradigm by introducing some of the main psychological biases in financial decision-making and examining the impacts of these biases in financial markets and other financial settings. It will also introduce students to behavioral and experimental methodologies in finance, economics, and other disciplines.",
    "name": "Behavioral Financial Economics",
    "subj": "ECON"
  },
  "ECON-4350": {
    "crse": "4350",
    "description": "This course will examine alternative models of economic and non-economic decision-making. The course will cover models of rational decision-making under certainty and uncertainty, bounded rationality, preference-based approaches (e.g., loss aversion, ambiguity aversion, disappointment aversion), and heuristic decision-making. The emphasis throughout will be on the proper interpretation of more general models of decision-making as well as real-world applications.",
    "name": "Microeconomics of Decision-Making",
    "subj": "ECON"
  },
  "ECON-4360": {
    "crse": "4360",
    "description": "This course explores human motivation and behavior across different settings and experimental paradigms. The course familiarizes students with previous work in selected topics in behavioral and experimental economics such as charitable giving, individual decision making and preferences, health, scarcity, and worker motivation. It also prepares students to design, implement and analyze their own economics experiments.Â Â",
    "name": "Experimental Economics",
    "subj": "ECON"
  },
  "ECON-4430": {
    "crse": "4430",
    "description": "Dynamic models of national and international economic growth are introduced and analyzed.Â Technological innovation is central to growth, and models consider the endogenous determinants of technological innovation and diffusion.Â National institutions that affect growth, such as law, education, and infrastructure, are considered. Variation in intellectual property rights across countries are examined, together with their effects on economic growth and development. Theories of growth are compared to empirical fact. Â",
    "name": "Economics of Growth & Innovation",
    "subj": "ECON"
  },
  "ECON-4570": {
    "crse": "4570",
    "description": "This course is an introduction to econometric data analysis. The statistical methods covered enable analysis of relationships between variables in data, with special attention to identification of true casual effects. Topics covered include linear and simple nonlinear regression models, internal and external validity, methods for panel data and binary dependent variables, instrumental variable methods, use of experimental and quasi-experimental data, and basic time series methods. The course included hands-on data analysis and report writing.Â",
    "name": "Econometrics",
    "subj": "ECON"
  },
  "ECON-4580": {
    "crse": "4580",
    "description": "This course provides skills to apply econometrics to diverse economic topics. Mathematical methods of econometrics are developed for tools such as alternative estimation strategies, instrumental variables, regression discontinuity, nonparametric and quantile estimators, and simultaneous equation models. Methods to identify causal effects are emphasized. Students do hands-on data work that puts to use these econometric tools.",
    "name": "Data Analysis in Economics and Finance",
    "subj": "ECON"
  },
  "ECON-4590": {
    "crse": "4590",
    "description": "Covers advanced estimation and inference techniques for data analysis and policy evaluation. Topics will vary from year to year to introduce advanced statistical methods used in recent literature. Topics may include visualization techniques to summarize and display high dimensional data, selected topics in discrete choice models, spatial analysis, and analysis of panel data. Particularly, methods for panel data will be emphasized. This includes fixed, random, mixed, and multi-level effects models to control for or account for variation from individual characteristics. Dynamic panel data models consider lagged dependent variables as regressors. Â",
    "name": "Advanced Data Analytics & Policy Evaluation",
    "subj": "ECON"
  },
  "ECON-4940": {
    "crse": "4940",
    "description": "",
    "name": "Readings in Economics",
    "subj": "ECON"
  },
  "ECON-4960": {
    "crse": "4960",
    "description": "Selected topics in economic analysis and problems to meet the special needs of upper-division students in various curricula throughout the Institute. This allows students to pursue more in-depth work in their areas of study.",
    "name": "Topics in Economics",
    "subj": "ECON"
  },
  "ECON-6010": {
    "crse": "6010",
    "description": "Core topics of microeconomic theory are covered: consumer demand, firm production, decisions under uncertainty, game theory, markets for goods with perfect and imperfect competition, and market failures. Microeconomic theory is applied to real cases. Examples include product pricing, technological innovation, firm growth, consumer and producer welfare, social welfare impacts of government policy, monopoly and oligopoly, and resource allocation.Â Â",
    "name": "Applied Microeconomics",
    "subj": "ECON"
  },
  "ECON-6030": {
    "crse": "6030",
    "description": "This course provides skills to apply econometrics to diverse economic topics. Mathematical methods of econometrics are developed for tools such as alternative estimation strategies, instrumental variables, regression discontinuity, nonparametric and quantile estimators, and simultaneous equation models. Methods to identify causal effects are emphasized. Students do hands-on data work that puts to use these econometric tools.Â Â",
    "name": "Data Analysis in Economics and Finance",
    "subj": "ECON"
  },
  "ECON-6040": {
    "crse": "6040",
    "description": "Covers advanced estimation and inference techniques for data analysis and policy evaluation. Topics will vary from year to year to introduce advanced statistical methods used in recent literature. Topics may include visualization techniques to summarize and display high dimensional data, selected topics in discrete choice models, spatial analysis, and analysis of panel data. Particularly, methods for panel data will be emphasized. This includes fixed, random, mixed, and multi-level effects models to control for or account for variation from individual characteristics. Dynamic panel data models consider lagged dependent variables as regressors.....",
    "name": "Advanced Data Analytics and Policy Evaluation",
    "subj": "ECON"
  },
  "ECON-6110": {
    "crse": "6110",
    "description": "Technological innovation is responsible for most economic growth and is crucial to deal with major societal concerns. This course examines the economics of innovation and new technologies. It shows how technologies are created and put to use, from basic science through invention and development to diffusion and practical use. Additional topics include R&D determinants, sources of innovation, product improvement, cost reduction, incentivizing and stimulating innovation, patents, evolution of innovation and technology, innovative competition in industry, and the national innovation environment.Â Â",
    "name": "Economics of Innovation and New Technologies",
    "subj": "ECON"
  },
  "ECON-6120": {
    "crse": "6120",
    "description": "Mathematical techniques applied to theoretical models in economics. Reviews and introduces core mathematical topics at the graduate economics level, applied to topics such as optimal behaviors of economics agents, equilibria among multiple interacting agents, economics growth processes and inter-temporal decision making, decision making in stochastic environments, and techniques to develop and work with economic models. Assumes thorough knowledge of calculus and some familiarity with linear algebra and probability theory.",
    "name": "Advanced Mathematical Methods in Economics",
    "subj": "ECON"
  },
  "ECON-6130": {
    "crse": "6130",
    "description": "Dynamic models of national and international economic growth are introduced and analyzed. Technological innovation is central to growth, and models consider the endogenous determinants of technological innovation and diffusion. National institutions that affect growth, such as law, education, and infrastructure, are considered. Variation in intellectual property rights across countries are examined, together with their effects on economic growth and development. Theories of growth are compared to empirical fact. Â",
    "name": "Economics of Growth and Innovation",
    "subj": "ECON"
  },
  "ECON-6140": {
    "crse": "6140",
    "description": "An advanced analysis of current problems confronting major American industries, regulated and unregulated. Recent changes in growth patterns, market structures, and pricing policies are examined. Considerable emphasis is placed on emerging trends in technology and public policy, which are likely to affect significantly the future of these industries.",
    "name": "Advanced Structure of Industry",
    "subj": "ECON"
  },
  "ECON-6150": {
    "crse": "6150",
    "description": "Can government intervention improve the performance of private markets and if so, when and how? How is regulatory policy actually made, and what effects has it had? These questions are applied to the experience in the U.S. and elsewhere with telecommunications, electricity, transportation, financial services, job safety, health, and environmental regulation.",
    "name": "Advanced Economics of Government Regulation and Firm Strategy",
    "subj": "ECON"
  },
  "ECON-6160": {
    "crse": "6160",
    "description": "Emphasis is placed on the analysis of efficient resource use in the public sector at the federal level. Expenditure theory and tax incidence are discussed. The effects of personal income, corporation, sales, payroll, and property taxes on resource allocation, equity, growth, and technological change are considered.",
    "name": "Advanced Public Finance",
    "subj": "ECON"
  },
  "ECON-6170": {
    "crse": "6170",
    "description": "Examine various facets of the healthcare industry. Application of microeconomic theory and tools will be used to: analyze healthcare demand and supply; examine the impact of public policies; study market segments such as health insurance and pharmaceuticals; explore economic choices of healthcare professionals; identify potential socioeconomic and demographic determinants of health status and healthcare; and gain insights into issues related to the ongoing healthcare policy reform. Â",
    "name": "Health Economics and Policy",
    "subj": "ECON"
  },
  "ECON-6190": {
    "crse": "6190",
    "description": "This course investigates the significance of economic globalization, covering the following topics: international trade and financial flows, technological innovation and intellectual property, technology transfer, national governments and transnational corporations, natural resources, health and the environment, impacts on selected industries and countries, and roles of the World Trade Organization and International Monetary Fund.Â The major controversies surrounding globalization are identified, and alternative arguments are evaluated based on available evidence.",
    "name": "Advanced International Economics and Globalization",
    "subj": "ECON"
  },
  "ECON-6210": {
    "crse": "6210",
    "description": "The techniques necessary to appraise the economic desirability and private-sector impact of various public projects and policies are studied. Concepts such as discounting, capital rationing, project selection, shadow pricing, risk assessment, unpriced goods, and economic surplus are developed. Among the topics from which illustrative case studies are drawn are urban and transport planning, energy, water resources, government regulation, and the environment. Suitable for graduate students in professional programs.",
    "name": "Advanced Cost-Benefit Analysis",
    "subj": "ECON"
  },
  "ECON-6220": {
    "crse": "6220",
    "description": "Game theory has been emerging as a branch of mathematical economics and applied to analyze situations where each decision-maker needs to think strategically about others' perspectives and actions in order to determine ones' own optimal choice. This course provides an introduction and presents selected topics in game theory. Students will look into basic definitions and equilibrium concepts and develop a wide range of applications in Economics, Biology, sports, health care, and various fields. The goal of the lecture is to improve understanding of strategic interaction in economic, business, and social situations.",
    "name": "Applied Game Theory",
    "subj": "ECON"
  },
  "ECON-6240": {
    "crse": "6240",
    "description": "Addresses the allocation of natural resources through applied study of fisheries, forestry, oil, minerals, water, and biodiversity resources. Mathematical analysis will be done using Microsoft Excel with Solver. Social and policy dynamics of allocation decisions will be explored through case studies. Field trips will address ecological and physical aspects of resource management. The intent is to develop a balanced perspective and tools to address resource management decisions across their diverse economic, social, and environmental dimensions.",
    "name": "Advanced Natural Resource Economics",
    "subj": "ECON"
  },
  "ECON-6270": {
    "crse": "6270",
    "description": "Integrates theory from psychology, neuroscience, and other social sciences into traditional economic models of human behavior. By relaxing the standard assumptions of perfect rationality and selfishness, more realistic modeling features such as loss aversion, present-bias, social norms, and habit formation improve economic analyses. These techniques are used to analyze individuals' health behaviors, health insurance markets, and healthcare policy. Â",
    "name": "Behavioral Economics",
    "subj": "ECON"
  },
  "ECON-6280": {
    "crse": "6280",
    "description": "Examine advanced econometric and statistical methods for the analysis of high-dimensional data, otherwise known as \"Big Data.\" In this setting, detailed information for each unit of observation informs machine learning techniques such as classification and regression trees; rECandom forests; penalized regressions; and boosted estimation. These prediction methods are then utilized to improve causal modeling, with applications in the study of healthcare demand and supply modeling, and behavior of consumers and businesses. Â",
    "name": "Econometric Methods for Big Data",
    "subj": "ECON"
  },
  "ECON-6290": {
    "crse": "6290",
    "description": "Students will learn about markets related to healthcare, insurance, biopharmaceuticals, and medical devices. Examine economic issues, models and quantitative analysis related to firms' activities in areas such as innovation, R&D expenditures, patenting, pricing, mergers and acquisitions, and competition in markets. Examine the role played by health insurance systems. Study the economic implications of regulations, such as those by the U.S. FDA. Economic and policy aspects will be examined within the context of the U.S. healthcare sector, along with selected comparisons to European national healthcare systems.",
    "name": "Economics of Biotech and Medical Innovations",
    "subj": "ECON"
  },
  "ECON-6320": {
    "crse": "6320",
    "description": "An exploration of models of decision-making under alternative assumptions, expanding on \"rational\" models of introductory economics. The course will discuss the assumptions of these standard models and their shortcomings. The shortcomings will be addressed through exploration of limited attention and considerations of fairness, uncertainty, and strategic interaction. Applications in areas such as consumer and household finance, marketing, and public policy will be emphasized throughout.",
    "name": "Economic Models of Decision-Making",
    "subj": "ECON"
  },
  "ECON-6340": {
    "crse": "6340",
    "description": "This course describes how individuals and firms make financial decisions, and how those decisions might deviate from those predicted by traditional financial or economic theory. The course examines how the insights of behavioral economics complement the traditional finance paradigm by introducing some of the main psychological biases in financial decision-making and examining the impacts of these biases in financial markets and other financial settings. It will also introduce students to behavioral and experimental methodologies in finance, economics, and other disciplines.",
    "name": "Behavioral Financial Economics",
    "subj": "ECON"
  },
  "ECON-6350": {
    "crse": "6350",
    "description": "This course will examine alternative models of economic and non-economic decision-making. The course will cover models of rational decision-making under certainty and uncertainty, bounded rationality, preference-based approaches (e.g., loss aversion, ambiguity aversion, disappointment aversion), and heuristic decision-making. The emphasis throughout will be on the proper interpretation of more general models of decision-making as well as real-world applications.",
    "name": "Microeconomics of Decision-Making",
    "subj": "ECON"
  },
  "ECON-6360": {
    "crse": "6360",
    "description": "This course explores human motivation and behavior across different settings and experimental paradigms. The course familiarizes students with previous work in selected topics in behavioral and experimental economics such as charitable giving, individual decision making and preferences, health, scarcity, and worker motivation. It also prepares students to design, implement and analyze their own economics experiments.",
    "name": "Experimental Economics",
    "subj": "ECON"
  },
  "ECON-6490": {
    "crse": "6490",
    "description": "The course examines the basic concepts and techniques of economic analysis and their applications to economics problems at the level of the firm, industry, and economy as a whole. Topics include theory of product and factor pricing, national income and employment theory, monetary and fiscal theories, economic growth and fluctuations.",
    "name": "Introduction to Economic Theory",
    "subj": "ECON"
  },
  "ECON-6550": {
    "crse": "6550",
    "description": "The central propositions of contemporary economic analysis are discussed. Topics include individual decision-making, consumption, production, the interaction of firms and households, competitive equilibrium, general equilibrium theory, welfare theorems, externalities, uncertainty, and the implications for economic policy.",
    "name": "Microeconomics I",
    "subj": "ECON"
  },
  "ECON-6580": {
    "crse": "6580",
    "description": "Applications of advanced econometric techniques such as two-and three-stage least squares, maximum likelihood, seemingly unrelated regression, full information likelihood, distributed lags, and autocorrelation correction to a variety of business and economic problems, including the capital asset pricing model, learning curve, economies of scale, hedonic price indexes, investment, production, and limited dependent variable models.",
    "name": "Topics in Applied Econometrics",
    "subj": "ECON"
  },
  "ECON-6590": {
    "crse": "6590",
    "description": "This course examines theory of national income determination, the role of monetary and nonmonetary factors in this economic system as described by various schools of macroeconomics. Alternative perspectives on monetary and fiscal policies are critically examined.",
    "name": "Advanced Macroeconomic Analysis",
    "subj": "ECON"
  },
  "ECON-6720": {
    "crse": "6720",
    "description": "Topics include market power, adverse selection, moral hazard, signaling, screening, mechanism design, externalities, public goods, information economics, and principal-agent problems. Implications for economic policy are also considered.",
    "name": "Microeconomics II",
    "subj": "ECON"
  },
  "ECON-6730": {
    "crse": "6730",
    "description": "Theoretical treatment of economic statistics. Topics include a rigorous treatment of set theory and fundamentals of probability theory, statistical estimation and hypothesis testing, analysis of variance, and regression. Also includes advanced topics such as maximum likelihood, generalized method of moments, empirical likelihood, and bootstrap, as well as finite-sample analysis and large-sample asymptotics.",
    "name": "Econometrics I",
    "subj": "ECON"
  },
  "ECON-6740": {
    "crse": "6740",
    "description": "Statistical methods are developed for classic linear and non-linear regression analysis. Econometric tools such as instrumental variables, regression discontinuity, and difference-in-differences are emphasized for causal identification. Extensions are made to new topics such as simulation-based methods including bootstrap, nonparametric and semiparametricestimators, and quantileregression methods.",
    "name": "Econometrics II",
    "subj": "ECON"
  },
  "ECON-6750": {
    "crse": "6750",
    "description": "Develops econometric models for causal inference using tools for big data. Machine learning and other resource-intensive modeling techniques are integrated into traditional economic approaches. Also covers procedures for the development, processing, and combination of novel data sources; methods to process extremely large datasets; data exploration and development tools; nonparametric methods. Economics applications are considered throughout.",
    "name": "Economic Data Analytics and Modeling I",
    "subj": "ECON"
  },
  "ECON-6760": {
    "crse": "6760",
    "description": "Covers advanced topics in the theory and application of econometrics and data modeling. Topics emphasized include causal identification, advanced instrumental variable models, dynamic models, panel data models, model selection, simulation-based inference methods, survival analysis models, censoring, quantile regression, non-linear models, and discrete choice models.",
    "name": "Economic Data Analytics and Modeling II",
    "subj": "ECON"
  },
  "ECON-6770": {
    "crse": "6770",
    "description": "Core issues in the economics of technology and innovation are covered along with policy ramifications. Topics include models of strategic R&D and patenting, quality and price measures, drivers of innovation in firms and fields of knowledge, technology adoption and diffusion, and regional innovation.",
    "name": "Economics of Innovation I",
    "subj": "ECON"
  },
  "ECON-6780": {
    "crse": "6780",
    "description": "Analyzes theories and findings on how regional and national economic growth relates to innovation. Contrasting theories and empirical evidence regarding agglomeration impacts on innovation, local effects of universities and government laboratories, employment, and trade flows. Regional impacts of corporations, entrepreneurship, labor force, education, and policy.",
    "name": "Economics of Innovation II",
    "subj": "ECON"
  },
  "ECON-6800": {
    "crse": "6800",
    "description": "Study economic behavior as it departs from perfectly rational, complete-information models. This course presents the main theories and findings from the behavioral economics literature as they relate to individuals' choices over time, risk, and uncertainty. Additional topics include individuals' use of decision heuristics and models of social preferences, such as altruism, fairness, reciprocity, and inequality aversion. Experimental methods are developed.",
    "name": "Behavioral and Experimental Economics I",
    "subj": "ECON"
  },
  "ECON-6810": {
    "crse": "6810",
    "description": "This course expands on material covered in Behavioral Economics I by studying the latest and more advanced modeling and experimental approaches for individuals' decision-making and empirical applications. Specific advanced topics include the role of habit formation on intertemporal choice and limited attention models for complex decisions. The course will additionally cover recent literature and findings from cognitive and computational psychology.",
    "name": "Behavioral and Experimental Economics II",
    "subj": "ECON"
  },
  "ECON-6820": {
    "crse": "6820",
    "description": "Study the economic theory of health and health care, and its applications. Topics include the measurement and determinants of health; economics of uncertainty, adverse selection, and moral hazard; economic models of demand for healthcare and demand for insurance; key markets in the healthcare sector such as physicians, hospitals, and insurance companies; policy effects on the matching between health care demand and supply; and political economy and organizational reform in medical care.",
    "name": "Health Economics and Policy I",
    "subj": "ECON"
  },
  "ECON-6830": {
    "crse": "6830",
    "description": "Study topics such as markets for pharmaceuticals, medical devices, medical technology, and health innovation; FDA and other types of regulations in pharmaceuticals and medical devices; models of hospital competition and provider incentives; health information technologies and their adoption and diffusion; advances in personalized healthcare; and externalities in health.",
    "name": "Health Economics and Policy II",
    "subj": "ECON"
  },
  "ECON-6840": {
    "crse": "6840",
    "description": "Study classical models of international trade that consider factor endowments, comparative advantage, labor capabilities, strategic use of trade barriers, and multilateral trade agreements. Examine contemporary models which explore increasing returns, heterogeneity in firm productivity and products, product mix, firm size distributions, globalization, multinationals, and offshoring.",
    "name": "International Economics and Development I",
    "subj": "ECON"
  },
  "ECON-6850": {
    "crse": "6850",
    "description": "Covers topics such as the impact of foreign trade and investment on labor markets, job creation and destruction, income inequality, production location and agglomeration, international technology transfer, and regional economic development.",
    "name": "International Economics and Development II",
    "subj": "ECON"
  },
  "ECON-6860": {
    "crse": "6860",
    "description": "Covers the economics of conventional and alternative energy sources. Topics in energy economics such as the demand for energy, supply of energy, evolving alternative energy sources, consumption, efficiency, adoption, and diffusion of new energy technologies, externalities, and the economics of climate change. The course will examine environmental impacts and their analysis, and introduce models and methods of analysis including cost-benefit analysis, discounting, the value of a statistical life, and health as human capital.",
    "name": "Energy and Environmental Economics I",
    "subj": "ECON"
  },
  "ECON-6870": {
    "crse": "6870",
    "description": "Study environmental economics and its relation to energy systems. Analyzes environmental externalities and regulatory solutions through theoretical models and empirical evidence. Study government responses related to regulations, taxes, and subsidies to address problems of market failure, and tools to evaluate the costs and benefits of environmental policies. Examine optimal environmental regulations and the trade-offs between market and regulatory imperfections. Methods are developed with applications to topics including health and climate impacts of emissions and their regulatory policies.",
    "name": "Energy and Environmental Economics II",
    "subj": "ECON"
  },
  "ECON-6940": {
    "crse": "6940",
    "description": "",
    "name": "Readings in Economics",
    "subj": "ECON"
  },
  "ECON-6960": {
    "crse": "6960",
    "description": "Selected topics in economic analysis and problems to meet the special needs of graduate students in various curricula throughout the Institute. This allows students to pursue more in-depth work in their areas of study.",
    "name": "Topics in Economic Theory",
    "subj": "ECON"
  },
  "ECON-6970": {
    "crse": "6970",
    "description": "Active participation in a semester-long project, under the supervision of a faculty adviser. A Professional Project often serves as a culminating experience for a Professional Masterâs program but, with departmental or school approval, can be used to fulfill other program requirements. With approval, students may register for more than one Professional Project. Professional Projects must result in documentation established by each department or school, but are not submitted to theÂ Office of Graduate EducationÂ and are not archived in the library. Grades of A,B,C, or F are assigned by the faculty adviser at the end of the semester. If not completed on time, a formal Incomplete grade may be assigned by the faculty adviser, listing the work remaining to be completed and the time limit for completing this work.",
    "name": "Professional Project",
    "subj": "ECON"
  },
  "ECON-6990": {
    "crse": "6990",
    "description": "Active participation in research, under the supervision of a faculty adviser, leading to a master's thesis. Grades of S or U are assigned by the adviser each term to reflect the student's research progress for the given semester. Once the thesis has been presented, approved by the adviser, and accepted by the Office of Graduate Education, it will be archived in a standard format in the library.",
    "name": "Master's Thesis",
    "subj": "ECON"
  },
  "ECON-9990": {
    "crse": "9990",
    "description": "Active participation in research, under the supervision of a faculty adviser, leading to a doctoral dissertation. Grades of IP are assigned until the dissertation has been publicly defended, approved by the doctoral committee, and accepted by theÂ Office of Graduate EducationÂ to be archived in a standard format in the library. Grades will then be listed as S.",
    "name": "Dissertation",
    "subj": "ECON"
  },
  "ECSE-1010": {
    "crse": "1010",
    "description": "An experiment-centric development of the basic analysis tools of Electrical, Computer, and Systems Engineering, emphasizing the concepts and mathematics of analog and digital circuits and electronics, programming, data generation and analysis, and system model development using paper and pencil analysis, simulation, and experiment. Problems, applications, and projects are chosen to lay a solid foundation for core EE and CSE courses.",
    "name": "Introduction to Electrical, Computer, and Systems Engineering",
    "subj": "ECSE"
  },
  "ECSE-1090": {
    "crse": "1090",
    "description": "A laboratory introduction to simulation and hardware programming with MATLAB and Simulink. Course covers: fundamental theory and programming tools for common sensors and actuators: gyroscopes, accelerometers, magnetometers, encoders, analog sensors, DC Motors, and motor drivers. Including: Â discretization, sampling, integration, differentiation, delays, saturation, and control. Material covered in a hands on, observable, and application specific way. Weekly one-hour lab/lectures introduce basic topics. Labs reinforce covered topics and are performed at home with provided hardware kits.Â Â",
    "name": "Introduction to Mechatronics Hardware and Software",
    "subj": "ECSE"
  },
  "ECSE-2010": {
    "crse": "2010",
    "description": "Techniques for the analysis and simulation of linear electric circuits and measurements of their properties. Topics include resistive and energy-storage elements, controlled sources and operational amplifiers, systematic analysis methods, AC steady state, power and three-phase systems, magnetic coupling and transformers, transients, s-plane representation and analysis, frequency response, and Laplace transform and computer-aided methods.",
    "name": "Electric Circuits",
    "subj": "ECSE"
  },
  "ECSE-2050": {
    "crse": "2050",
    "description": "The physics and operation of semiconductor diodes, bipolar junction transistors, and field-effect transistors in elementary analog circuits. Non-ideal operational amplifier characteristics. Amplifier biasing, small-signal analysis, and frequency response. Elementary bipolar and MOSFET digital circuits.",
    "name": "Introduction to Electronics",
    "subj": "ECSE"
  },
  "ECSE-2100": {
    "crse": "2100",
    "description": "Development and application of Maxwell's equations in free space and within materials. Introduction to vector calculus and computer-aided analysis and design methods in electromagnetics. Applications include calculation of lumped circuit elements from field theory, plane wave propagation in various materials, and reflection from boundaries. Transmission line concepts, Smith charts, and other design tools for distributed circuits.",
    "name": "Fields and Waves I",
    "subj": "ECSE"
  },
  "ECSE-2110": {
    "crse": "2110",
    "description": "This course introduces the major components of today's power system such as transformers, electric machines, and transmission lines. Renewable energy sources and systems are discussed, including wind and solar energy. Integration of energy sources with the grid is addressed.",
    "name": "Electrical Energy Systems",
    "subj": "ECSE"
  },
  "ECSE-2210": {
    "crse": "2210",
    "description": "An introductory survey of microelectronics technology emphasizing physical properties of semiconductors, device and circuit fabrication, semiconductor device operation. Topics include semiconductor crystals; energy bands; electrons and holes; dopant impurities; fabrication and operation of diodes, bipolar junction transistors, and field-effect transistors.",
    "name": "Microelectronics Technology",
    "subj": "ECSE"
  },
  "ECSE-2410": {
    "crse": "2410",
    "description": "Time and frequency-domain representation of continuous- and discrete-time signals and systems. Â Response of linear, time-invariant systems. Convolution, Fourier series, Fourier transform, Laplace transform, and z-transform. Applications in communication, feedback control, and filtering. Â Â",
    "name": "Signals and Systems",
    "subj": "ECSE"
  },
  "ECSE-2500": {
    "crse": "2500",
    "description": "Axioms of probability, joint and conditional probability, random variables, probability density, mass, and distribution functions, functions of one and two random variables, characteristic functions, sequences of independent random variables, central limit theorem, and laws of large numbers. Applications to electrical and computer engineering problems.",
    "name": "Engineering Probability",
    "subj": "ECSE"
  },
  "ECSE-2610": {
    "crse": "2610",
    "description": "Design-oriented introduction to computer components and operations. Standard codes, number systems, base conversions, and computer arithmetic. Boolean algebra, minimization and synthesis techniques for combinational and sequential logic. Races, hazards, and asynchronous behavior. Registers, arithmetic logic units, memory structure, buses, and control units. Machine language programming, instruction fetch and execution, input-output devices, interrupts, and microprogram sequencers. Software and hardware tools.",
    "name": "Computer Components and Operations",
    "subj": "ECSE"
  },
  "ECSE-2660": {
    "crse": "2660",
    "description": "Quantitative basis of modern computer architecture, processor design, memory hierarchy, and input/output methods. Layered operating system structures, process and storage management. Layered network organization, network protocols, switching, local and wide area networks. Examples from Unix and the Internet.",
    "name": "Computer Architecture, Networks, and Operating Systems",
    "subj": "ECSE"
  },
  "ECSE-2900": {
    "crse": "2900",
    "description": "This seminar course addresses a range of issues involving engineering and public policy, innovation systems and economic development, and the National Academy's Engineering Grand Challenges for the 21st Century.",
    "name": "ECSE Enrichment Seminar",
    "subj": "ECSE"
  },
  "ECSE-4030": {
    "crse": "4030",
    "description": "The modeling, analysis, and design of analog integrated circuits using CMOS technology. Topics include basic integrated circuit components, basic amplifier stages, operational amplifiers, frequency compensation and stability, and bandgap references. Emphasis is placed on the design of the fundamental circuits required for analog signal processing. Students undertake several design projects, including a sizeable project that comprises a significant percentage of the final grade. Â",
    "name": "Analog IC Design",
    "subj": "ECSE"
  },
  "ECSE-4040": {
    "crse": "4040",
    "description": "Analysis and design of switching-mode circuits: NMOS, CMOS, RTL, DTL, TTL, and ECL digital-logic families. Topics include: basic logic gates (voltage-transfer characteristics, noise margin, fan out, propagation delay, power dissipation), flip flops, Schmitt triggers, oscillators, timers, memories, A/D and D/A converters, and optional advanced topics.",
    "name": "Digital Electronics",
    "subj": "ECSE"
  },
  "ECSE-4050": {
    "crse": "4050",
    "description": "Linear and non-linear applications of operational amplifiers, with an emphasis on circuit design. Non-ideal operational amplifier behavior, including both static and dynamic characteristics.Â Amplifier stability and frequency compensation techniques.Â Operational amplifier-based oscillators. Circuit noise.",
    "name": "Advanced Electronic Circuits",
    "subj": "ECSE"
  },
  "ECSE-4080": {
    "crse": "4080",
    "description": "The application of power semiconductor devices to the efficient conversion of electrical energy. Circuit analysis, signal analysis, and energy concepts are integrated to develop steady-state and dynamic models of generic power converters. Specific topics include AC/DC conversion, DC/DC conversion, DC/AC conversion, and AC/AC conversion. These generic converters are applied as controlled rectifiers, switching power supplies, motor drives, HVDC transmission, induction heating, and others. Ancillary circuits needed for the proper operation and control of power semiconductor devices are also discussed.",
    "name": "Semiconductor Power Electronics",
    "subj": "ECSE"
  },
  "ECSE-4090": {
    "crse": "4090",
    "description": "The synergistic combination of mechanical engineering, electronics, control engineering, and computer science in the design process. The key areas of mechatronics studied in depth are control sensors and actuators, interfacing sensors and actuators to a microcomputer, discrete controller design, and real-time programming for control using the C programming language. The unifying theme for this heavily laboratory-based course is the integration of the key areas into a successful mechatronic design.",
    "name": "Mechatronics",
    "subj": "ECSE"
  },
  "ECSE-4110": {
    "crse": "4110",
    "description": "AC steady-state analysis, three-phase networks, and complex power (brief review). Per-unit system. Practical transformer equivalent circuits. AC power transmission-lines: parameters; equivalent circuits; and steady-state operation. Power flow with transfer limits in balanced three-phase systems. Network power flow problem with solution by numerical methods. Symmetrical components: analysis including sequence networks for three-phase systems. Fault analysis.Â Â",
    "name": "Power Engineering Analysis",
    "subj": "ECSE"
  },
  "ECSE-4120": {
    "crse": "4120",
    "description": "This course studies electromechanical interactions in lumped-parameter systems. These interactions describe the operation of electric machines, electromechanical actuators, and transducers. The fundamental laws of Faraday, Ampere, and Gauss are considered to develop physical models of magnetic circuits, including those which use permanent magnets. These models are then expanded to include equations of motion and the thermodynamics of electromechanical coupling. Applications include transformers, induction machines, synchronous machines, DC machines, and reluctance machines.",
    "name": "Electromechanics",
    "subj": "ECSE"
  },
  "ECSE-4130": {
    "crse": "4130",
    "description": "A laboratory based examination of static and rotating energy conversion equipment. Topics include the experimental study of the physical phenomena and characteristics of magnetic circuits, transformers, electric machines, rectifiers, DC/DC converters, and inverters. The interaction between static power converters and electric machines is emphasized.",
    "name": "EPE Laboratory",
    "subj": "ECSE"
  },
  "ECSE-4170": {
    "crse": "4170",
    "description": "Modeling and simulation of cyber-physical systems through object-oriented equation-based computer languages and software tools. Describes formalisms for continuous, discrete, timed-clocked synchronous systems and finite state machines; and applies simulation methods through numerical solution of differential-and-algebraic higher-and-varying index systems of equations with time and state event event handling. Composing reusable model architectures, templates, interfaces and data management for model variants. Applies model deployment in heterogeneous environments using model exchange, co-simulation and real-time simulation techniques. Co-listed: ECSE 4170 and ECSE 6170. Â Students cannot obtain credit for both this course and the co-listed course . Â",
    "name": "Modeling and Simulation for Cyber-Physical Systems",
    "subj": "ECSE"
  },
  "ECSE-4180": {
    "crse": "4180",
    "description": "Industrial power system design considerations: planning (safety, reliability, simplicity, maintenance, flexibility, cost), voltages (control, selection, effects of variation), protection (devices, limitations, requirements, coordination, testing), fault calculations, grounding (static and lightning protection, earth connections), power factor control and effects, switching and voltage transformation, instruments and meters, cable construction and installation, busways.",
    "name": "Industrial Power System Design",
    "subj": "ECSE"
  },
  "ECSE-4220": {
    "crse": "4220",
    "description": "Introduction to VLSI design. The fabrication, device, circuit, and system aspects of VLSI design are covered in an integrated fashion. Emphasis is placed on NMOS and CMOS technology. Laboratory experiments focus on layout analysis, computer-aided layout, and logic and timing simulation. Project on digital design with standard cells.",
    "name": "VLSI Design",
    "subj": "ECSE"
  },
  "ECSE-4250": {
    "crse": "4250",
    "description": "The theoretical and practical aspects of techniques utilized in the fabrication of silicon-based microcircuits. Imperfections in semiconductors, crystal growth, solid solubility, alloying and diffusion, ion implantation, oxide masking, epitaxy, metallization, etching, and photolithography. Fabrication techniques for bipolar and MOS-microcircuits, and the electrical performance of devices based on these techniques. Microcircuit design and layout. Students cannot receive credit for both this course and MTLE 4160.",
    "name": "Integrated Circuit Processes and Design",
    "subj": "ECSE"
  },
  "ECSE-4370": {
    "crse": "4370",
    "description": "The nature of optics, physics, and operation principles of optoelectronic devices and systems for communication, display, lighting, and computing. Topics include optics fundamentals, waveguide and fibers, LEDs, laser diode, photodetectors, solar cells, liquid crystal devices, modulators, optical display, and light detection and ranging (LiDAR) systems.",
    "name": "Introduction to Optoelectronics Technology",
    "subj": "ECSE"
  },
  "ECSE-4380": {
    "crse": "4380",
    "description": "The design and operation of Solid State Lighting Systems including basic design and fabrication methods of light emitting diode (LED), LED thermal management, optical characterization of lighting, LED drivers, lighting sensors/control systems and selected emerging applications.",
    "name": "Fundamentals of Solid State Lighting Systems",
    "subj": "ECSE"
  },
  "ECSE-4440": {
    "crse": "4440",
    "description": "Application of linear feedback theory to the design of large-scale, integrated control systems. Derivation of complex mathematical models of physical systems. Synthesis of appropriate control laws to provide stability. Simulation of complex control systems on digital computers.",
    "name": "Control Systems Engineering",
    "subj": "ECSE"
  },
  "ECSE-4480": {
    "crse": "4480",
    "description": "A survey of the fundamental issues necessary for the design, analysis, control, and implementation of robotic systems. The mathematical description of robot manipulators in terms of kinematics and dynamics. Hardware components of a typical robot arm. Path following, control, and sensing. Examples of several currently available manipulators.",
    "name": "Robotics I",
    "subj": "ECSE"
  },
  "ECSE-4490": {
    "crse": "4490",
    "description": "This course introduces methods that leverage the basic analysis techniques learned in Robotics I to develop numerical and algorithmic techniques needed to endow robots with the \"intelligence\" to devise strategies to solve problems they will encounter. Once these abilities are sufficiently well developed, robots will become safe and autonomous, thus paving the way for pervasive personal robots. Topics include: configuration space representation, cell decomposition, roadmap methods, rapidly-exploring random trees, simultaneous localization and mapping, contact modeling, grasping, and dexterous manipulation.",
    "name": "Robotics II",
    "subj": "ECSE"
  },
  "ECSE-4500": {
    "crse": "4500",
    "description": "Recent developments in systems, sensors, communications, and networking technologies enable the development of large-scale distributed systems incorporating many individual nodes. This course takes an algorithmic approach to distributed systems for sensor fusion, localization and tracking, distributed robotics and sensor-based control. It also presents the basic principles of sensor node architectures and wireless sensor networks. Applications include environmental monitoring, biomedical systems, and security-related tracking problems.",
    "name": "Distributed Systems and Sensor Networks",
    "subj": "ECSE"
  },
  "ECSE-4510": {
    "crse": "4510",
    "description": "Sampling, quantization, and reconstruction of signals. Mathematical tools used in the modeling, analysis, and synthesis of discrete-time control systems. Analysis tools includeÂ z-transforms, difference equation solutions, state variables, and transfer function techniques. Design tools digital PID controller, root locus, bilinear transformations, compensation techniques and full-state feedback. Applications to sampled-data control.",
    "name": "Digital Control Systems",
    "subj": "ECSE"
  },
  "ECSE-4520": {
    "crse": "4520",
    "description": "An introduction to analog and digital communication signals and systems. Representation of analog and digital signals and their spectra. Baseband pulse and digital signaling, including PAM, PCM, DM, and DPCM. Bandlimited signaling without inter-symbol interference. Analog and digital bandpass signaling, including AM, FM, PM, OOK, PSK, FSK, MSK, QAM, and OFDM. Transmitter and receiver operations and systems. Performance in the presence of noise. Â",
    "name": "Communication Systems",
    "subj": "ECSE"
  },
  "ECSE-4530": {
    "crse": "4530",
    "description": "This course provides a comprehensive treatment of the theory, design, and implementation of digital signal processing algorithms. The first half of the course emphasizes frequency-domain and Z-transform analysis. The second half of the course investigates advanced topics in signal processing, including FFT algorithms, multi-rate signal processing, filter design, adaptive filtering, and quantizer design. The course provides a strong theoretical foundation for future study in communications, control, or image processing.",
    "name": "Digital Signal Processing",
    "subj": "ECSE"
  },
  "ECSE-4540": {
    "crse": "4540",
    "description": "An introduction to the field of image processing, covering both analytical and implementation aspects. Topics include the human visual system, cameras and image formation, image sampling and quantization, spatial- and frequency-domain image enhancement, filter design, image restoration, image coding and compression, morphological image processing, color image processing, image segmentation, and image reconstruction. Real-world examples and assignments drawn from consumer digital imaging, security and surveillance, and medical image processing.",
    "name": "Introduction to Image Processing",
    "subj": "ECSE"
  },
  "ECSE-4560": {
    "crse": "4560",
    "description": "An introduction to digital communications, including signal generation, signal detection, synchronization, channel modeling, and coding. Baseband pulse modulation. Signal space representation of signals and optimal receiver structures.Â Bandpass modulation techniques including PSK, QAM and FSK.Â Carrier, symbol, and frame synchronization.Â Channel characterization and modeling, including terrestrial channels.Â Error control coding. Â",
    "name": "Digital Communications",
    "subj": "ECSE"
  },
  "ECSE-4620": {
    "crse": "4620",
    "description": "This course describes the computer vision problems that underlie modern visual effects in movies, in which original video footage is transformed or augmented to create fantastic, yet plausible environments. The course provides a critical overview of the important literature for several problem categories, describing \"under-the-hood\" concepts and algorithms in mathematical detail. In many cases, the relevant academic research is only a few years old and has only recently been applied to movies, TV shows, and commercials.",
    "name": "Computer Vision for Visual Effects",
    "subj": "ECSE"
  },
  "ECSE-4630": {
    "crse": "4630",
    "description": "Optical physics and applications of lasers. Design of optical systems. Topics include: wave optics and beam propagation, Gaussian beams, resonators, optical properties of atoms and laser gain media, laser amplifiers, pulsed laser systems, applications of lasers, nonlinear optics.",
    "name": "Lasers and Optical Systems",
    "subj": "ECSE"
  },
  "ECSE-4640": {
    "crse": "4640",
    "description": "Phenomena, materials, and devices for optical communications and computing. Topics include: guided wave and fiber optics, integrated optics, electro-optic and nonlinear optical switching, pulse and soliton propagation, sources, and detectors.",
    "name": "Optical Communications and Integrated Optics",
    "subj": "ECSE"
  },
  "ECSE-4660": {
    "crse": "4660",
    "description": "In-depth hands-on study of the technologies and protocols involved in building the Internet-of-Things (IoT), with specific focus on networking at the edge of the Internet. Topics include wireless communication and link layer technologies, multi-access and scheduling mechanisms, mobility models, routing in disconnected networks, energy-efficient edge networking, loss tolerant transport protocols, IoT security, data aggregation, and their applications to emerging areas such as vehicular networks, RFID systems and smart buildings. C o-listed: ECSE 4660 and ECSE 6660. Â Students cannot obtain credit for both this course and the co-listed course. Â",
    "name": "Internetworking of Things",
    "subj": "ECSE"
  },
  "ECSE-4670": {
    "crse": "4670",
    "description": "Introduction to the basic concepts of computer and communication networks, like flow control, congestion control, end-to-end reliability, routing,Â framing, error-recovery, multiple access, and statistical multiplexing.Â In-depth presentation of the different networking layers, with emphasis on the Internet reference model. Protocols and architectures such as TCP, IP, Ethernet, wireless networks, etc. are described in order to illustrate important networking concepts. Introduction to quantitative analysis and modeling of networks.",
    "name": "Computer Communication Networks",
    "subj": "ECSE"
  },
  "ECSE-4720": {
    "crse": "4720",
    "description": "An introduction to theoretical and experimental solid-state physics. Wave mechanics in the perfect crystal. X-rays, electrons, and phonons. Electrical properties of metals and semiconductors. Qualitative treatment of lattice defects.",
    "name": "Solid-State Physics",
    "subj": "ECSE"
  },
  "ECSE-4740": {
    "crse": "4740",
    "description": "Engineering techniques for parallel processing. Knowledge and hands-on experience in developing applications software for processors on inexpensive widely-available computers with massively parallel computing resources. Multi-thread shared memory programming with OpenMP and NVIDIA GPU multicore programming with CUDA and Thrust. The use of NVIDIA gaming and graphics cards on current laptops and desktops for general purpose parallel computing using Linux.",
    "name": "Applied Parallel Computing for Engineers",
    "subj": "ECSE"
  },
  "ECSE-4750": {
    "crse": "4750",
    "description": "Introduction to Interactive Computer Graphics, with an emphasis on applications programming. Objects and viewers, and the synthetic camera model. Graphics architectures, the graphics pipeline, clipping, rasterization, and programmable shaders. Input and interaction. Geometric objects, homogeneous coordinates, and transformations. Viewing, hidden surface removal, frame and depth buffers, compositing, and anti-aliasing. Shading, light and materials, texture mapping, ray tracing, and radiosity. Intellectual property concerns. Extensive programming with the OpenGL API and C++.",
    "name": "Computer Graphics",
    "subj": "ECSE"
  },
  "ECSE-4760": {
    "crse": "4760",
    "description": "Experiments and lectures demonstrate the design and use of microcomputers as both decision tools and on-line real-time system components in control and communications. Topics include the basic operations of microcomputers, data I/O, analog and digital process control, voice processing, digital filter design, digital communication, and optimal LQR control.",
    "name": "Real-Time Applications in Control and Communications",
    "subj": "ECSE"
  },
  "ECSE-4770": {
    "crse": "4770",
    "description": "Digital design methodologies including timing chain and counter based \"hardwired\" microprogram design, modules, and modular design. The course bridges LSI and MSI design treating microprocessors, and I/O interfacing. Bus protocol standards, interrupts, direct memory access, priority arbitration, asynchronous timing, and overlap or double buffering. Specific examples of design include controllers for disks, cassettes, video systems, and stepping motors. Course includes a laboratory with access to FPGAs and microprocessors.",
    "name": "Computer Hardware Design",
    "subj": "ECSE"
  },
  "ECSE-4780": {
    "crse": "4780",
    "description": "Design methodologies include register transfer modules and firmware microprogrammed design. \"Bit-slice\" philosophy of design. LSI microprocessors as design elements in larger digital systems such as high-speed channels and special purpose computers. Detailed discussion of the structure of several computers at the chip and board level. Specification of custom IC digital systems. FPGA based design implementation using VHDL. Students cannot receive credit for both this course and ECSE 6700.",
    "name": "Advanced Computer Hardware Design",
    "subj": "ECSE"
  },
  "ECSE-4790": {
    "crse": "4790",
    "description": "Hardware and software for real-time microprocessor-based digital systems. Basic concepts and operations of on-chip components related to digital system functionality. Architectures, instructions sets, and interfacing with peripherals through serial or parallel ports. Introduction to 32-bit machines with in-depth treatment of 16- and 8-bit machines. Emphasis on C language cross-compilers. Laboratory exercises are included to demonstrate hardware and software development techniques practiced in industry.",
    "name": "Microprocessor Systems",
    "subj": "ECSE"
  },
  "ECSE-4810": {
    "crse": "4810",
    "description": "This course covers topics related to learning and inference with different types of Probabilistic Graphical Models (PGMs). It also demonstrates the application of PGMs to different fields. The course covers both directed and undirected graphical models, both parameter and structure learning, and both exact and approximated inference methods.",
    "name": "Introduction to Probabilistic Graphical Models",
    "subj": "ECSE"
  },
  "ECSE-4850": {
    "crse": "4850",
    "description": "Deep learning fundamentals and applications in artificial intelligence. Topics include machine learning foundation, linear regression and classification, deep neural networks, convolutional neural networks, recurrent neural networks, generative adversary neural networks,Â Bayesian neural networks, deep Boltzmann machine, deep Bayesian networks, and deep reinforcement learning.",
    "name": "Introduction to Deep Learning",
    "subj": "ECSE"
  },
  "ECSE-4900": {
    "crse": "4900",
    "description": "A capstone design experience that engages students from biomedical, computer and systems, electrical, industrial, materials, and mechanical engineering on teams in an open-ended engineering design problem in preparation for professional practice. With the guidance of a multidisciplinary team of faculty members and instructional support staff, students apply knowledge and skills from prior coursework. This is a communication-intensive course.",
    "name": "Multidisciplinary Capstone Design",
    "subj": "ECSE"
  },
  "ECSE-4940": {
    "crse": "4940",
    "description": "Supervised reading and research.",
    "name": "Independent Studies in Electrical, Computer, and Systems Engineering",
    "subj": "ECSE"
  },
  "ECSE-4960": {
    "crse": "4960",
    "description": "",
    "name": "Topics in Electrical, Computer, and Systems Engineering",
    "subj": "ECSE"
  },
  "ECSE-6050": {
    "crse": "6050",
    "description": "Linear and non-linear applications of operational amplifiers, with an emphasis on circuit design. Non-ideal operational amplifier behavior, including both static and dynamic characteristics.Â Amplifier stability and frequency compensation techniques.Â Operational amplifier-based oscillators. Circuit noise.",
    "name": "Advanced Electronic Circuits",
    "subj": "ECSE"
  },
  "ECSE-6090": {
    "crse": "6090",
    "description": "Advanced power electronic circuits and systems, as well as their modeling and control. Topics include advanced dc-dc converters, modeling by averaging and sampled-data methods, discontinuous conduction modes, linear and nonlinear current control methods and design, spectral and dynamic characteristics of pulse-width modulation, ac-dc converters with active power factor correction, resonant and soft-switching converters, and EMI filter design, as well as autonomous and distributed power systems. Course assignments include laboratory projects involving simulation, hardware design, and measurement.",
    "name": "Advanced Power Electronics",
    "subj": "ECSE"
  },
  "ECSE-6110": {
    "crse": "6110",
    "description": "AC steady-state analysis, three-phase networks, and complex power (brief review). Per-unit system. Practical transformer equivalent circuits. AC power transmission-lines: parameters; equivalent circuits; and steady-state operation. Power flow with transfer limits in balanced three-phase systems. Network power flow problem with solution by numerical methods. Symmetrical components: analysis including sequence networks for three-phase systems. Fault analysis.Â Â",
    "name": "Power Engineering Analysis",
    "subj": "ECSE"
  },
  "ECSE-6120": {
    "crse": "6120",
    "description": "Power quality examines the causes of and solutions to electric power quality problems. Topics range from utility issues such as voltage sags, swells, and outages to consumer issues, such as harmonic distortion, and bus reliability at the equipment level. Solution methods such as implementing surge suppressors, the UPS, active filtering, and proper grounding techniques will be discussed.",
    "name": "Power Quality",
    "subj": "ECSE"
  },
  "ECSE-6130": {
    "crse": "6130",
    "description": "Basic relaying philosophy. Current and potential transformers. Operating principles of electromagnetic, electronic, and digital relays. Application of relays to protect generators, busses, transformers, and transmission lines.",
    "name": "Protective Relaying",
    "subj": "ECSE"
  },
  "ECSE-6140": {
    "crse": "6140",
    "description": "Economics of the operation of power systems. Control of hydro and thermal generating units. Aspects of interconnected operation. Transmission losses and techniques for optimum economic generation. Hydrothermal coordination problems. Modern power markets. State estimation.",
    "name": "Power Generation Operation and Control",
    "subj": "ECSE"
  },
  "ECSE-6150": {
    "crse": "6150",
    "description": "Review of electromagnetic theory required to undertake analysis and design of power equipment. Experimental, analog, and digital field estimation techniques. Case studies in electric and magnetic fields such as cable and bushing design, problems of gas bus systems, electrostatic precipitation, magnetic flux penetration, eddy currents, losses, shielding, generation of torque.",
    "name": "Electric and Magnetic Fields in Electric Power Engineering",
    "subj": "ECSE"
  },
  "ECSE-6160": {
    "crse": "6160",
    "description": "Analysis and computation of electrical transients in lumpy and distributed power circuits; switching surges, lightning surges, traveling waves. Impact of surges on terminal equipment. Insulation coordination; system protection; design of electric power apparatus and systems to operate reliably and economically in a transient environment.",
    "name": "Surge Phenomena in Electric Power Engineering",
    "subj": "ECSE"
  },
  "ECSE-6170": {
    "crse": "6170",
    "description": "Modeling and simulation of cyber-physical systems through object-oriented equation-based computer languages and software tools. Describes formalisms for continuous, discrete, timed-clocked synchronous systems and finite state machines; and applies simulation methods through numerical solution of differential-and-algebraic higher-and-varying index systems of equations with time and state event event handling. Composing reusable model architectures, templates, interfaces and data management for model variants. Applies model deployment in heterogeneous environments using model exchange, co-simulation and real-time simulation techniques. Co-listed: ECSE 4170 and ECSE 6170. Â Students cannot obtain credit for both this course and the co-listed course.",
    "name": "Modeling and Simulation for Cyber-Physical Systems",
    "subj": "ECSE"
  },
  "ECSE-6180": {
    "crse": "6180",
    "description": "Modeling of power system components including HVDC systems, flexible AC transmission systems, and wind turbines. Analysis and control techniques such as reactive power control, coherency, and model reduction. Synchrophasor technology â measurement, communication, and control.Â",
    "name": "Advanced Power System Modeling and Control",
    "subj": "ECSE"
  },
  "ECSE-6190": {
    "crse": "6190",
    "description": "Applies the student's knowledge of power engineering to the solution of large problems by computer methods. Treats matrix techniques, load-flow analysis, network building, short circuit studies, numerical integration, and finite element analysis as it applies to power systems and power apparatus.",
    "name": "Computer Methods in Electric Power Engineering",
    "subj": "ECSE"
  },
  "ECSE-6200": {
    "crse": "6200",
    "description": "This graduate-level course is designed to give students a hands-on experience in the characterization of basic semiconductor devices (diffused resistors, pn junction diodes, Schottky diodes, MOS capacitors, bipolar junction transistors, MOSFETs) in wafer and/or packaged forms. The final project involves the students in a detailed characterization of devices in a specific application (e.g. high-voltage power electronics, submicron ULSI, microwave and wireless).",
    "name": "Semiconductor Device Characterization",
    "subj": "ECSE"
  },
  "ECSE-6210": {
    "crse": "6210",
    "description": "An introduction to emerging electronic and optoelectronics technology. Topics cover cutting edge technologies and novel device concepts, such as quantum devices, silicon-on-insulators (SOI), compound semiconductor devices and technologies, thin film transistors (TFTs), wide band gap semiconductor devices and technologies, Si-Ge devices, solar cells, photodetectors, semiconductor lasers, opto-electronic ICs, optical interconnects, and display technologies.",
    "name": "Advanced Device Concepts",
    "subj": "ECSE"
  },
  "ECSE-6220": {
    "crse": "6220",
    "description": "Physical foundations underlying the operation of modern electronic and photonic solid-state devices. Quantum mechanical foundations are emphasized, including the postulates of quantum mechanics, wave-particle duality, uncertainty relation, the Kronig-Penney model, and perturbation theory. In addition, the course covers areas such as semiconductor statistics, doping, heterostructures, transport, and tunneling.",
    "name": "Physical Foundations of Solid-State Devices",
    "subj": "ECSE"
  },
  "ECSE-6230": {
    "crse": "6230",
    "description": "The physical operation of basic modern semiconductor devices and the determination of their internal parameters are discussed in detail. A review of semiconductor physics, including incomplete ionization, carrier lifetimes, and carrier transport, and solutions of continuity equation are presented. Devices include pn junction diodes, metal-oxide-semiconductor capacitors and field-effect transistors. Emphasis is placed on the fundamental mechanisms that contribute to device performance. The interrelationship between device parameters and circuit performance is also discussed.",
    "name": "Semiconductor Devices and Models I",
    "subj": "ECSE"
  },
  "ECSE-6240": {
    "crse": "6240",
    "description": "Fabrication technology for silicon and gallium arsenide integrated circuits with emphasis on sub-micron structures. Topics include epitaxy, diffusion, binary and ternary phase diagrams, grown and deposited oxides and nitrides, polysilicon and silicide technology, single-and multi-metal systems, plasma and chemical etching, ion milling photo, e-beam and X-ray lithography.",
    "name": "VLSI Fabrication Technology",
    "subj": "ECSE"
  },
  "ECSE-6250": {
    "crse": "6250",
    "description": "Physical properties of operation, modeling, and application of selected semiconductor microwave devices. Devices considered include varactors, p-i-n diodes, Schottky barrier diodes, avalanche transit time devices, transferred electron devices, and field effect transistors. Terminal behavior of these devices, their noise characteristics, and their use in microwave circuits.",
    "name": "Solid-State Microwave Devices",
    "subj": "ECSE"
  },
  "ECSE-6260": {
    "crse": "6260",
    "description": "Special problems of semiconductor devices operating at high voltage and high current levels. Devices include p-i-n and Schottky diodes, bipolar junction transistors, power MOSFETs and thyristors. Topics include space charge limited current flow, micro plasmas, avalanche breakdown, junction termination, high-level injection, emitter crowding, double injection, second breakdown, triggering mechanisms, plasma propagation, switching and recovery characteristics. Introduction to the Insulated-Gate Bipolar Transistor.",
    "name": "Semiconductor Power Devices",
    "subj": "ECSE"
  },
  "ECSE-6270": {
    "crse": "6270",
    "description": "A brief review of interaction of light with matter. Operating principles, basic designs, and applications of optoelectronic devices such as Light Emitting Diodes, Laser Diodes, Photodetectors, and Solar Cells. Electro-optic, Acousto-optic and Non-linear optic based optical components such as Modulators, Switches, Couplers, Multiplexers, and Amplifiers. Optical Waveguides and Fibers. Optoelectronic Applications such as Fiber Optic and Free Space Optical Communication, Photovoltaics, Thermophotovoltaics, and Solid-State Lighting.",
    "name": "Optoelectronics",
    "subj": "ECSE"
  },
  "ECSE-6280": {
    "crse": "6280",
    "description": "This course offers a comprehensive explanation of the technology and physics of light-emitting diodes (LEDs) such as infrared, visible-spectrum, ultraviolet, and white LEDs made from IIIâV semiconductors. The elementary properties of LEDs and material on device structure, packaging, reflectors, phosphor materials, light extraction, and junction temperature are discussed. Applications of the LED focus on illumination, fiber, and free-space communication.Â",
    "name": "Light Emitting Diodes",
    "subj": "ECSE"
  },
  "ECSE-6290": {
    "crse": "6290",
    "description": "A continuation of ECSE 6230. Physical operation and modeling of charge-coupled devices, junction field-effect transistors, bipolar junction transistors and heterojunction devices. Studies of heterojunction devices emphasize the exploitation of particular quantum-mechanical phenomena to achieve unique device behavior. Â",
    "name": "Semiconductor Devices and Models II",
    "subj": "ECSE"
  },
  "ECSE-6300": {
    "crse": "6300",
    "description": "Theory and practice of IC fabrication in a research laboratory environment. Test chips are fabricated and the resulting devices and circuits evaluated. Processes and fabrication equipment studied and used include oxidation/diffusion, CVD reactors, photolithography, plasma etching, vacuum evaporator, ion implantation, etc. Instruments used in process monitoring and final testing include thin film profilometer, ellipsometer, resistivity probe, scanning electron microscope, capacitance-voltage system, etc. The fundamentals of hazardous material handling and clean room procedures are studied.",
    "name": "Integrated Circuit Fabrication Laboratory",
    "subj": "ECSE"
  },
  "ECSE-6400": {
    "crse": "6400",
    "description": "Methods of analysis for continuous and discrete-time linear systems. Convolution, classical solution of dynamic equations, transforms, and matrices are reviewed. Emphasis is on the concept of state space. Linear spaces, concept of state, modes, controllability, observability, state transition matrix. State variable feedback, compensation, decoupling.",
    "name": "Systems Analysis Techniques",
    "subj": "ECSE"
  },
  "ECSE-6420": {
    "crse": "6420",
    "description": "Phenomena peculiar to nonlinear systems. Linearization, iteration, and perturbation procedures. Describing function stability analysis. Phase plane methods. Relaxation oscillations and limit cycles. Stability analysis by Lyapunov's method. Popov's theorem. Adaptive control systems. Sensitivity analysis.",
    "name": "Nonlinear Control Systems",
    "subj": "ECSE"
  },
  "ECSE-6430": {
    "crse": "6430",
    "description": "Linear programming, nonlinear programming, iterative methods, and dynamic programming are presented, especially as they relate to optimal control problems. Discrete and continuous optimal regulators are derived from dynamic programming approach, which also leads to the Hamilton-Jacobi-Bellman Equation and the Minimum Principle. Linear quadratic regulators, linear tracking problems, and output regulators are treated. Linear observer and the separation theorem are developed for feedback controller implementation.",
    "name": "Optimization Methods",
    "subj": "ECSE"
  },
  "ECSE-6440": {
    "crse": "6440",
    "description": "The concepts, techniques, and tools related to optimal control for dynamical systems. Major topics include calculus of variation, minimum principle, dynamic programming, optimal estimation, and differential games. Both discrete time systems and continuous times are addressed. Particular consideration is given to linear time invariant systems in terms of linear quadratic regulator and Kalman filter.",
    "name": "Optimal Control Theory",
    "subj": "ECSE"
  },
  "ECSE-6460": {
    "crse": "6460",
    "description": "Tools and methods for the analysis and design of linear multivariable feedback systems. Topics include the connection between frequency domain and state space models and methods, model identification, model reduction, model uncertainty and closed loop performance, convex analysis and design methods, optimal controller synthesis using H2, H-infinity, and structured singular value criteria.",
    "name": "Multivariable Control Systems",
    "subj": "ECSE"
  },
  "ECSE-6470": {
    "crse": "6470",
    "description": "A survey of the fundamental issues necessary for the design, analysis, control, and implementation of robotic systems. The mathematical description of robot manipulators in terms of kinematics and dynamics. Hardware components of a typical robot arm. Path following, control, and sensing. Examples of several currently available manipulators. Â",
    "name": "Robotics I",
    "subj": "ECSE"
  },
  "ECSE-6480": {
    "crse": "6480",
    "description": "This course contains the fundamental theory required to design adaptive systems. Topics include parameter identification, ARMA modeling, model reference systems, model algorithmic control, self-tuning systems, and adaptive filtering. Applications to physical and physiological systems are introduced.",
    "name": "Adaptive Systems",
    "subj": "ECSE"
  },
  "ECSE-6490": {
    "crse": "6490",
    "description": "This course introduces methods that leverage the basic analysis techniques learned in Robotics I to develop numerical and algorithmic techniques needed to endow robots with the \"intelligence\" to devise strategies to solve problems they will encounter. Once these abilities are sufficiently well developed, robots will become safe and autonomous, thus paving the way for pervasive personal robots. Topics include: configuration space representation, cell decomposition, roadmap methods, rapidly-exploring random trees, simultaneous localization and mapping, contact modeling, grasping, and dexterous manipulation.",
    "name": "Robotics II",
    "subj": "ECSE"
  },
  "ECSE-6500": {
    "crse": "6500",
    "description": "Recent developments in systems, sensors, communications, and networking technologies enable the development of large-scale distributed systems incorporating many individual nodes. This course takes an algorithmic approach to distributed systems for sensor fusion, localization and tracking, distributed robotics and sensor-based control. It also presents the basic principles of sensor node architectures and wireless sensor networks. Applications include environmental monitoring, biomedical systems, and security-related tracking problems.",
    "name": "Distributed Systems and Sensor Networks",
    "subj": "ECSE"
  },
  "ECSE-6510": {
    "crse": "6510",
    "description": "Deterministic signal representations and analysis, introduction to random processes and spectral analysis, correlation function and power spectral density of stationary processes, noise mechanisms, the Gaussian and Poisson processes. Markov processes, the analysis of linear and nonlinear systems with random inputs, stochastic signal representations, orthogonal expansions, the Karhunen-Loeve series, channel characterization, introduction to signal detection, linear mean-square filtering, the orthogonality principle, optimum Wiener and Kalman filtering, modulation theory, and systems analysis.",
    "name": "Introduction to Stochastic Signals and Systems",
    "subj": "ECSE"
  },
  "ECSE-6520": {
    "crse": "6520",
    "description": "Classical statistical decision theory, decision criteria, binary and composite hypothesis tests. Statistical models of signals and noise. Detection of known signals in Gaussian noise. Receiver operating characteristics and error probability. Applications to radar and communications. Detection of signals with unknown or random parameters, detection of stochastic signals, nonparametric detection techniques. Statistical estimation theory, performance measures. Cramer-Rao bounds, estimation of unknown signal parameters, optimum demodulation, signal design.",
    "name": "Detection and Estimation Theory",
    "subj": "ECSE"
  },
  "ECSE-6530": {
    "crse": "6530",
    "description": "Information measures, characterization of information sources, coding for discrete sources, the noiseless coding theorems, construction of Huffman codes. Discrete channel characterization, channel capacity, noisy-channel coding theorems, reliability exponents. Various error-control coding and decoding techniques, including block and convolutional codes. Introduction to waveform channels and rate distortion theory.",
    "name": "Information Theory and Coding",
    "subj": "ECSE"
  },
  "ECSE-6550": {
    "crse": "6550",
    "description": "Review of measure and integration theory, elements of probability, random variables, conditional probability, and expectations. Stochastic processes, stationarity, and ergodicity. Gaussian processes and Brownian motion, the Poisson process. Markov processes, wide-sense stationary processes, spectral representations, linear prediction and filtering. Stochastic integrals and differential equations, white noise and the stochastic calculus, the Fokker-Planck equation, diffusion processes, recursive filtering and estimation, evaluation of likelihood ratios. Applications in communication, information processing, and control.",
    "name": "Stochastic Processes in Communication and Control",
    "subj": "ECSE"
  },
  "ECSE-6560": {
    "crse": "6560",
    "description": "Â An introduction to digital communications, including signal generation, signal detection, synchronization, channel modeling, and coding. Baseband pulse modulation. Signal space representation of signals and optimal receiver structures.Â Bandpass modulation techniques including PSK, QAM and FSK.Â Carrier, symbol and frame synchronization.Â Channel characterization and modeling, including terrestrial channels.Â Error control coding. Â Â Â",
    "name": "Digital Communications",
    "subj": "ECSE"
  },
  "ECSE-6600": {
    "crse": "6600",
    "description": "This course will cover concepts and protocols which enable heterogeneous computer networks to work with each other, including transport (TCP, UDP), network (IP, IPng), routing (RIP, OSPF), network management (SNMP, SNMPv2, RMON), and other important protocols like ARP, ICMP, DNS, BOOTP, DHCP, and HTTP. Advanced topics like Mobile IP, Real-time and reservation protocols (RTP, RSVP), IP multicast (IGMP, MBONE) and network security will also be examined. Emphasis will be on breadth of coverage, as well as hands-on programming experiences.",
    "name": "Internet Protocols",
    "subj": "ECSE"
  },
  "ECSE-6610": {
    "crse": "6610",
    "description": "Structure of pattern classification problems. Mathematics of statistical decision theory: random vectors, multivariate probability functions, discriminants, parametric and nonparametric techniques, Bayesian and maximum likelihood estimation, feature selection, dimensionality reduction, whitening transformations. Adaptive methods and clustering. Five programming assignments and a term paper.",
    "name": "Pattern Recognition",
    "subj": "ECSE"
  },
  "ECSE-6620": {
    "crse": "6620",
    "description": "This course describes the computer vision problems that underlie modern visual effects in movies, in which original video footage is transformed or augmented to create fantastic, yet plausible environments. The course provides a critical overview of the important literature for several problem categories, describing \"under-the-hood\" concepts and algorithms in mathematical detail. In many cases, the relevant academic research is only a few years old and has only recently been applied to movies, TV shows, and commercials.",
    "name": "Computer Vision for Visual Effects",
    "subj": "ECSE"
  },
  "ECSE-6630": {
    "crse": "6630",
    "description": "Theory of multidimensional signal processing and its application to digital image and video processing. The first half will cover signals and systems, Fourier transform, z-transform, discrete Fourier transform, FIR and IIR filters and their design. The emphasis will be on the unexpected and important differences from the one-dimensional case. The second half consists of applications in image and video signal processing, e.g., compression coding, noise reduction, motion estimation, deblurring, and restoration.",
    "name": "Digital Image and Video Processing",
    "subj": "ECSE"
  },
  "ECSE-6640": {
    "crse": "6640",
    "description": "Practice of picture processing with emphasis on the differences between techniques appropriate for symbolic and natural images. Image acquisition: digitization, coding, photometric and geometric transformations. Image processing: morphology, registration and differencing. Image interpretation: color, size, distance, directionality, layout, connectivity, and shape. File formats, document compression, image processing languages and software. Applications to documents, remote sensing, and biomedicine.",
    "name": "Digital Picture Processing",
    "subj": "ECSE"
  },
  "ECSE-6650": {
    "crse": "6650",
    "description": "Image formation and visual perception. Images, line structures, and line drawings. Preprocessing, boundary detection, texture, and region growing. Image representation in terms of boundaries, regions, and shape. Three-dimensional structures and their projections. Analysis, manipulation, and classification of image data. Knowledge-based approaches to image understanding. Applications from fields of robot vision, biomedical-image analysis, and satellite and aerial image interpretation.",
    "name": "Computer Vision",
    "subj": "ECSE"
  },
  "ECSE-6660": {
    "crse": "6660",
    "description": "In-depth hands-on study of the technologies and protocols involved in building the Internet-of-Things (IoT), with specific focus on networking at the edge of the Internet. Topics include wireless communication and link layer technologies, multi-access and scheduling mechanisms, mobility models, routing in disconnected networks, energy-efficient edge networking, loss tolerant transport protocols, IoT security, data aggregation, and their applications to emerging areas such as vehicular networks, RFID systems and smart buildings. Co-listed: ECSE 4660 and ECSE 6660. Â Students cannot obtain credit for both this course and the co-listed course.",
    "name": "Internetworking of Things",
    "subj": "ECSE"
  },
  "ECSE-6670": {
    "crse": "6670",
    "description": "Review of fundamental concepts and protocols of broadband and optical networking. Convergence of telephone, Internet, and cable networks lead to new architectural and protocol concepts. Concepts and architectures covered in this course include: high-speed switching and router-design, traffic engineering, fiber optical communications, optical networking concepts, protection/restoration/survivability, optical link layers, quality of service, and broadband last-mile technologies.",
    "name": "Broadband and Optical Networking",
    "subj": "ECSE"
  },
  "ECSE-6680": {
    "crse": "6680",
    "description": "Introduction to VLSI architecture design approaches and methodologies for digital signal processing systems, digital memory circuits and architectures, and computer VLSI arithmetic. Topics include: pipelining, parallel processing, timing and clocking, systolic architectures, digital filter architectures, Viterbi decoder architectures, SRAM, DRAM, flash memory, high-speed adder and multiplier architectures. Laboratory experiments involve the use of commercial EDA tools with hardware description language (HDL).",
    "name": "Advanced VLSI Design",
    "subj": "ECSE"
  },
  "ECSE-6690": {
    "crse": "6690",
    "description": "Software design aids for specifying IC design. Covers a spectrum of logic entry, simulation, placement, routing, network extraction, verification, PG tape generation, and testing. Use of a tool set for 2 micron CMOS gate array design using an industrial foundry. Designs are actually fabricated.",
    "name": "VLSI Design Automation",
    "subj": "ECSE"
  },
  "ECSE-6700": {
    "crse": "6700",
    "description": "An advanced design and laboratory course. Design methodologies include register transfer modules and firmware microprogrammed design. Advanced microprocessor topics. \"Bit-slice\" philosophy of design. LSI microprocessors as design elements in larger digital systems such as high-speed channels and special purpose computers. Detailed discussion of the structure of several computers at the chip and board level. Emphasis on high-speed ECL and Schottky circuits. Specification of custom IC digital systems. FPGA based design implementation using VHDL. Students cannot receive credit for both this course and ECSE 4780.",
    "name": "Computer Architecture Prototyping with FPGA's",
    "subj": "ECSE"
  },
  "ECSE-6710": {
    "crse": "6710",
    "description": "Introduction to fuzzy set theory and fuzzy logics: basic concepts, fuzzy logics operations. Semantic manipulation applied to case studies in approximate reasoning, linguistic modeling, decision theory, and cluster analysis. Expert systems architecture and applications. Symbolic manipulation knowledge representation, control structure, and explanation capabilities. Analysis of expert systems such as MYCIN, PROSPECTOR, OPS5, DELTA.",
    "name": "Fuzzy Sets and Expert Systems",
    "subj": "ECSE"
  },
  "ECSE-6720": {
    "crse": "6720",
    "description": "The theoretical background for learning using neural networks and important issues in the applications of neural networks. Topics include perception, associative memory, multilayer networks, recurrent networks, learning and generalization capabilities, training algorithms, learning with prior knowledge, and examples in applications.",
    "name": "Neural Network Computing",
    "subj": "ECSE"
  },
  "ECSE-6730": {
    "crse": "6730",
    "description": "Theory and techniques for the diagnosis of hardware faults in digital systems and the design of fault-tolerant systems. Fault detection and diagnosis in logic networks. Static and dynamic redundancy to achieve error detection and error correction.",
    "name": "Fault-Tolerant Digital Systems",
    "subj": "ECSE"
  },
  "ECSE-6750": {
    "crse": "6750",
    "description": "Topics vary from year to year and may include methods of representation for finite-state machines, state assignments, machine decomposition theory. Experiments on finite-state machines, finite-memory machines, information-lossless machines. Linear machines, probabilistic machines, cellular arrays.",
    "name": "Finite-State Machine Theory",
    "subj": "ECSE"
  },
  "ECSE-6790": {
    "crse": "6790",
    "description": "Literature survey of current research in computational geometry and theoretical computer graphics showing recent efficient algorithms useful in graphics and CAD. Algorithms such as Voronoi networks, geometric searching, convex hulls, divide and conquer in multidimensional space, repeated rotation, preprocessing scenes to draw back to front from any viewpoint, new hidden surface algorithms, haloed line elimination, polyhedron intersection, and algorithms for scenes with thousands of faces are discussed. Major research paper required.",
    "name": "Computational Geometry",
    "subj": "ECSE"
  },
  "ECSE-6800": {
    "crse": "6800",
    "description": "This course will cover 3D graphical application programmer interfaces (APIs) and advanced rendering techniques, visulation pipelines, creating simulations, and visualization packages. Also covered will be algorithms for extracting visual information from data sets, such as determining iso-surfaces, contours, and cut planes. A programming emphasis will be on object-oriented design and systems. Term project required.",
    "name": "Advanced 3D Computer Graphics and Visualization",
    "subj": "ECSE"
  },
  "ECSE-6810": {
    "crse": "6810",
    "description": "This course covers topics related to learning and inference with different types of Probabilistic Graphical Models (PGMs). It also demonstrates the application of PGMs to different fields. The course covers both directed and undirected graphical models, both parameter and structure learning, and both exact and approximated inference methods.",
    "name": "Introduction to Probabilistic Graphical Models",
    "subj": "ECSE"
  },
  "ECSE-6820": {
    "crse": "6820",
    "description": "A course on fundamentals of stochastic processes and queuing theory emphasizing applications. Poisson processes, renewal processes, Markov chains, general methods in the study of Markovian and non-Markovian systems, tandem queues, networks of queues, priority and bulk queues, computational methods, and simulation. Focus of the course is the application of these tools in the performance evaluation and design of computer systems, communication networks, manufacturing systems, and service systems.",
    "name": "Queuing Systems and Applications",
    "subj": "ECSE"
  },
  "ECSE-6850": {
    "crse": "6850",
    "description": "Deep learning fundamentals and applications in artificial intelligence. Topics include machine learning foundation, linear regression and classification, deep neural networks, convolutional neural networks, recurrent neural networks, generative adversary neural networks,Â Bayesian neural networks, deep Boltzmann machine, deep Bayesian networks, and deep reinforcement learning.",
    "name": "Introduction to Deep Learning",
    "subj": "ECSE"
  },
  "ECSE-6860": {
    "crse": "6860",
    "description": "Evaluation provides structured information for policy-relevant decision making based on a purposeful analysis of the identified measures. Topics include test hypotheses, randomization/control schemes, measures framework, measurement methods, and pertinent analytic techniques. Emphasis is on the application of evaluation methods (including systems engineering and operations research techniques) to issues arising in criminal justice, education, health, housing, transportation, welfare, automated information systems, and military programs.",
    "name": "Evaluation Methods for Decision Making",
    "subj": "ECSE"
  },
  "ECSE-6900": {
    "crse": "6900",
    "description": "to be arranged",
    "name": "Seminar in Electrical, Computer, and Systems Engineering",
    "subj": "ECSE"
  },
  "ECSE-6910": {
    "crse": "6910",
    "description": "",
    "name": "Seminar in Electric Power Engineering",
    "subj": "ECSE"
  },
  "ECSE-6940": {
    "crse": "6940",
    "description": "Supervised reading and problems, by individual arrangement.",
    "name": "Readings in Electrical, Computer, and Systems Engineering",
    "subj": "ECSE"
  },
  "ECSE-6960": {
    "crse": "6960",
    "description": "New or special courses are presented under this listing from time to time.",
    "name": "Topics in Electrical, Computer, and Systems Engineering",
    "subj": "ECSE"
  },
  "ECSE-6970": {
    "crse": "6970",
    "description": "Active participation in a semester-long project, under the supervision of a faculty adviser. A Professional Project often serves as a culminating experience for a Professional Master's program but, with departmental or school approval, can be used to fulfill other program requirements. With approval, students may register for more than one Professional Project. Professional Projects must result in documentation established by each department or school, but are not submitted to the Office of Graduate Education and are not archived in the library. Grades of A, B, C, or F are assigned by the faculty adviser at the end of the semester. If not completed on time, a formal Incomplete grade may be assigned by the faculty adviser, listing the work remaining to be completed and the time limit for completing this work.",
    "name": "Professional Project",
    "subj": "ECSE"
  },
  "ECSE-6980": {
    "crse": "6980",
    "description": "Active participation in a master's-level project, under the supervision of a faculty adviser, leading to a master's project report. Grades S or U are assigned at the end of the semester. If recommended by the adviser, the master's project may be accepted by the Office of Graduate Education to be archived in the library.",
    "name": "Master's Project",
    "subj": "ECSE"
  },
  "ECSE-6990": {
    "crse": "6990",
    "description": "Active participation in research, under the supervision of a faculty adviser, leading to a master's thesis. Grades of S or U are assigned by the adviser each term to reflect the student's research progress for the given semester. Once the thesis has been presented, approved by the adviser, and accepted by the Office of Graduate Education, it will be archived in a standard format in the library.",
    "name": "Master's Thesis",
    "subj": "ECSE"
  },
  "ECSE-7010": {
    "crse": "7010",
    "description": "Review of the state of the art in optical fibers, light sources, and photodetectors. Topics include: propagation, coupling, dispersion, loss and cut-off characteristics of guided wave models in optical fibers, structural and operating parameters of various types of heterostructure lasers and light-emitting diodes and quantum efficiency, response time and noise characteristics of silicon PAD and PIN diodes. Also includes applications of optical fibers in optical communications, in data processing, and in control systems.",
    "name": "Optical Fiber Communications",
    "subj": "ECSE"
  },
  "ECSE-7020": {
    "crse": "7020",
    "description": "Computer control and estimation algorithms including deterministic and stochastic models. Markov sequence and Bayes decision rules, linear Kalman filtering, predicting, and smoothing. Parameter identification, combined state and parameter estimation. Adaptive filters and on-line rapid estimation schemes, extended and nonlinear filters. Optimal digital control of deterministic and stochastic systems. Separation theorems.",
    "name": "Digital Control and Estimation",
    "subj": "ECSE"
  },
  "ECSE-7100": {
    "crse": "7100",
    "description": "Hardware and software characteristics of real-time systems for analysis and control. Real-time programming techniques, standard interfaces and busses, sensors, data smoothing, digital filtering, and digital control.",
    "name": "Real-Time Programming and Applications",
    "subj": "ECSE"
  },
  "ECSE-9990": {
    "crse": "9990",
    "description": "",
    "name": "Dissertation",
    "subj": "ECSE"
  },
  "ENGR-1010": {
    "crse": "1010",
    "description": "An introduction to the issues related to working in team settings. Topics explored include: communications in teams, public speaking and self awareness, stages of group development, building a team, group decision making, and conflict resolution. The course format will include small and large group discussions, case studies, experiential exercises, and participation from industry guests.",
    "name": "Professional Development: Group Dynamics",
    "subj": "ENGR"
  },
  "ENGR-1100": {
    "crse": "1100",
    "description": "An integrated development of linear algebra and statics emphasizing engineering applications and also incorporating computer exercises involving matrix techniques and calculations using available software packages.",
    "name": "Introduction to Engineering Analysis",
    "subj": "ENGR"
  },
  "ENGR-1200": {
    "crse": "1200",
    "description": "An introduction to the techniques for creating solid models of engineering designs. Topics include three-dimensional modeling of parts and assemblies, visualization, orthographic and isometric free-hand sketching, and computer-generated design documentation.",
    "name": "Engineering Graphics and CAD",
    "subj": "ENGR"
  },
  "ENGR-1300": {
    "crse": "1300",
    "description": "The use of basic machine tools such as lathes, milling machines, drill presses, band saws, and grinders, including micrometers, vernier calipers, and other devices of use in a machine shop or laboratory. Welding techniques and tool making are also considered.",
    "name": "Engineering Processes",
    "subj": "ENGR"
  },
  "ENGR-1400": {
    "crse": "1400",
    "description": "This is an undergraduate introductory course covering basic concepts and skills in engineering communication. Topics include technical writing, project planning and proposal writing, data visualization, system modeling and simulation, engineering graphics and CAD, and effective uses of software tools. Note: This course is recommended as an alternative to ENGR 1200 for the following disciplines only: biomedical, chemical, industrial and systems, materials, electrical and computer systems, and nuclear engineering.",
    "name": "Engineering Communications",
    "subj": "ENGR"
  },
  "ENGR-1600": {
    "crse": "1600",
    "description": "Introduction to the scientific principles that dictate the structure and properties of engineering materials, including metals, ceramics, semiconductors, and polymers. Physical properties of materials (mechanical, electrical, thermal, optical) are discussed in terms of the underlying bonding and structure, spanning multiple length scales from atomic packing to micron scale defects, in practical engineering materials. Throughout the course, the material behaviors are understood from the viewpoint of thermodynamics and kinetics.",
    "name": "Materials Science",
    "subj": "ENGR"
  },
  "ENGR-1700": {
    "crse": "1700",
    "description": "This seminar-based course introduces students to the roles the different engineering disciplines play in addressing modern engineering challenges. This course conveys that design is a principal aspect of engineering, often involving multiple disciplines simultaneously and that the associated engineering solutions often have ethical, cultural, social, economic, and environmental consequences. As such these issues must be considered in determining the appropriateness of an engineering solution.",
    "name": "Introduction to Better World Engineering",
    "subj": "ENGR"
  },
  "ENGR-2020": {
    "crse": "2020",
    "description": "This design studio introduces students to the first semester-long design project. We introduce students to more formal engineering design methods. This includes problem formulation, structured ideation, rapid prototyping, evaluation, functional modeling, and iteration. Studio III will also continue to draw on social science methods of ethnographic observation, background research, stakeholder analysis, and also a critical deconstruction of engineering design methods in a way that builds agility in ways more appropriate for those in DIS. Development of individual skills in design development, presentation, and portfolio building are also emphasized.",
    "name": "Design and Innovation Studio III",
    "subj": "ENGR"
  },
  "ENGR-2050": {
    "crse": "2050",
    "description": "A first course in engineering design which emphasizes creativity, teamwork, communication, and work across engineering disciplines. Students are introduced to the design process through a semester-long project which provides a design-build-test experience. Oral and written communication are important elements of the course. The course meets with ENGR 1010.",
    "name": "Introduction to Engineering Design",
    "subj": "ENGR"
  },
  "ENGR-2090": {
    "crse": "2090",
    "description": "An integrated development of modeling-and problem-solving techniques for particles and rigid bodies emphasizing the use of free-body diagrams, vector algebra, and computer simulation. Topics covered include the kinematics and kinetics of translational, rotational, and general plane motion, energy and momentum methods.",
    "name": "Engineering Dynamics",
    "subj": "ENGR"
  },
  "ENGR-2250": {
    "crse": "2250",
    "description": "Application of control volume balances of mass, momentum, energy, and entropy in systems of practical importance to all engineers. Identification of control volumes, properties of pure materials, mass and energy conservation for closed and open systems, second law of thermodynamics, Bernoulli equation, fluid statics, forces and heat transfer in external and internal flows, conduction, and radiative heat transfer.",
    "name": "Thermal and Fluids Engineering I",
    "subj": "ENGR"
  },
  "ENGR-2300": {
    "crse": "2300",
    "description": "A survey, application-oriented course for engineering and science majors. Transducers and measurement devices. DC and AC analog circuits including impedance, power, frequency response, and resonance. Diodes, transistors, and operational amplifiers. Signal conditioning, noise, and shielding. Digital electronics, A/D and D/A conversation. Power supplies, rectifiers, and electromagnetic devices.",
    "name": "Electronic Instrumentation",
    "subj": "ENGR"
  },
  "ENGR-2350": {
    "crse": "2350",
    "description": "Engineering laboratory introduction to the microprocessor as an embedded element of engineering systems. Students simultaneously develop the hardware and software of one or more target systems during the semester. Topics include concepts and practices of microcontroller hardware and software for command, sensing, control, and display. Specifically, this includes control of dynamic systems and sensor interfaces; analog-digital conversion; parallel input/output; driver circuits, modular programming, and subsystem integration.",
    "name": "Embedded Control",
    "subj": "ENGR"
  },
  "ENGR-2530": {
    "crse": "2530",
    "description": "Concept of stress and strain, generalized Hooke's law, axial load, torsion, pure bending, transverse loading, transformation of stress and strain components in 2D, design of beams and shafts for strength, deflection of beams, work and energy, columns.",
    "name": "Strength of Materials",
    "subj": "ENGR"
  },
  "ENGR-2600": {
    "crse": "2600",
    "description": "Appreciation and understanding of uncertainties and the conditions under which they occur, within the context of the engineering problem-solving pedagogy of measurements, models, validation, and analysis. Problems and concerns in obtaining measurements; tabular and graphical organization of data to minimize misinformation and maximize information; and development and evaluation of models. Concepts will be supported with computer demonstration. Applications to problems in engineering are emphasized.",
    "name": "Modeling and Analysis of Uncertainty",
    "subj": "ENGR"
  },
  "ENGR-2700": {
    "crse": "2700",
    "description": "Overview of methods used in the design and operation of production and service systems and basic cost accounting. Topics include forecasting, capacity planning, line balancing, production scheduling, staff scheduling, inventory control, just in time, time study, project planning, and discrete item cost accounting. Goal of course is to educate students in basic operations management principles and models and in discrete goods cost accounting. Students cannot receive credit for this course and ISYE 2210.",
    "name": "Production and Operations Management",
    "subj": "ENGR"
  },
  "ENGR-2710": {
    "crse": "2710",
    "description": "A classroom study of the basic theory and methods of traditional and nontraditional machining, metal joining, material working, and foundry processes, and the variety of functions performed by the primary machine tools employed by the modern manufacturing community. A basic first course or terminal course for all students who are interested in manufacturing processes.",
    "name": "General Manufacturing Processes",
    "subj": "ENGR"
  },
  "ENGR-2720": {
    "crse": "2720",
    "description": "This course will introduce students to the basic concepts associated with computer numerical controlled (CNC) machining. Specifically, the student will be introduced to the processes and operations associated with CNC milling, drilling, and turning. All of these processes will be controlled by code written by the students. Students are expected to apply their knowledge of computer-aided engineering as well as manufacturing processes to class exercises, homework assignments, tests, and a final project.",
    "name": "Computer Aided Machining",
    "subj": "ENGR"
  },
  "ENGR-2940": {
    "crse": "2940",
    "description": "",
    "name": "Engineering Project",
    "subj": "ENGR"
  },
  "ENGR-2960": {
    "crse": "2960",
    "description": "",
    "name": "Topics in Engineering",
    "subj": "ENGR"
  },
  "ENGR-4010": {
    "crse": "4010",
    "description": "Students will study issues associated with working in teams in a modern work environment. Various styles of leadership, the definitions of power and empowerment and their applications in industry and team settings will be studied. Additionally, other topics to be explored include vision, values and attitudes, and organizational culture. The course format will include small and large group discussions, case studies, experiential exercises, and participation from industry guests.",
    "name": "Professional Development: Leadership Competencies",
    "subj": "ENGR"
  },
  "ENGR-4100": {
    "crse": "4100",
    "description": "Investigates business-related considerations in successfully commercializing new technology in a new venture or within an existing enterprise: market and customer analysis, beating the competition, planning and managing for profitability, high-tech marketing and sales, and business partnerships and acquisitions. Not a general management course; focuses explicitly on what is relevant for engineers and scientists working in a commercial environment. For junior/senior undergraduate or graduate students.",
    "name": "Business Issues for Engineers and Scientists",
    "subj": "ENGR"
  },
  "ENGR-4200": {
    "crse": "4200",
    "description": "This course provides a practical introduction to computer programming in ClassicalÂ Fortran, emphasizing selected language features that are useful in performing numerical calculations. It is intended mainly for graduate students in engineering and science who need to use Fortran in research projects and in courses that assume a knowledge of the language or of programming. Grading is based primarily on the student's use of Fortran in a significant project, which may be for thesis research or for another course. Required reading (about 17 pages per week) is assigned from the textbook \"Classical Fortran Second Edition\" and there might be short in-class quizzes on the reading.",
    "name": "Fortran Programming",
    "subj": "ENGR"
  },
  "ENGR-4610": {
    "crse": "4610",
    "description": "DIS Studio C focuses on the co-production of products, organizations, and problem-solving strategies. Students will explore how to facilitate communication across multiple disciplinary and audience modalities, including stakeholders, designers, and users. Projects and course discussions will train students to translate social scientific and engineering problem-solving judgments and to evaluate how complex problems come to be defined. This course is required for DIS students who are dual-majoring with the School of Engineering.",
    "name": "Design and Innovation Studio C",
    "subj": "ENGR"
  },
  "ENGR-4710": {
    "crse": "4710",
    "description": "Manufacturing theory, laboratory experimentation, and manufacturing systems design and development comprised of selected modern manufacturing technologies. Technologies include robotics and automation, injection molding, computer numerically controlled (CNC) machining, metal forming, inspection, rapid prototyping, and advanced manufacturing topics. Student teams apply lessons to develop a proposal to produce a product requiring multiple coordinated manufacturing processes. Students prepare technical documentation for communicating key engineering and management aspects of the developed manufacturing system to a separate fabrication group. Â",
    "name": "Manufacturing Processes and Systems Laboratory I",
    "subj": "ENGR"
  },
  "ENGR-4720": {
    "crse": "4720",
    "description": "Student teams finalize manufacturing system plans from select ENGR 4710 projects, build a manufacturing system to complete several hundred units of a product, optimize the system, manage a project budget, modify manufacturing and packaging plans, and conform to a project schedule as proposed in the associated project Technical Data Packages produced by ENGR 4710 teams. In addition, students will learn new advanced manufacturing topics to increase their breath and depth of manufacturing.",
    "name": "Manufacturing Processes and Systems Laboratory II",
    "subj": "ENGR"
  },
  "ENGR-4750": {
    "crse": "4750",
    "description": "This course deals with cost analysis in engineering decision making and the management and control of complex projects. Engineering economics topics include interest formulas and equivalence calculations, inflation, measures of investment worth, after tax analysis, depreciation accounting and replacement analyses, life-cycle costing and design economics, risk analysis and cost-benefit analysis. Engineering project management topics include methods for planning, evaluation, organization, budgeting, cost estimating, scheduling, expediting, reporting, monitoring, and implementation of projects. Students cannot obtain credit for both this course and either ENGR 4760 or ISYE 4240.",
    "name": "Engineering Economics and Project Management",
    "subj": "ENGR"
  },
  "ENGR-4760": {
    "crse": "4760",
    "description": "The objective is to help engineering students recognize and understand the importance of cost factors that are inherent in all engineering decisions. Development of ability to handle engineering problems that involve economic factors. The course includes economic environment, selections in present economy, value analysis, critical path economy, interest and money-time relationships, depreciation and valuation, capital financing and budgeting, basic methods for undertaking economic studies, risk, uncertainty and sensitivity, selections between alternatives, fixed, increment, and sunk costs, the effects of income taxes in economic studies, replacement studies, minimum cost formulas, economic studies of public projects, economic studies in public utilities. Effects of inflation are considered at each step. Students cannot obtain credit for both this course and ENGR 4750.",
    "name": "Engineering Economics",
    "subj": "ENGR"
  },
  "ENGR-6100": {
    "crse": "6100",
    "description": "Investigates business-related considerations in successfully commercializing new technology in a new venture or within an existing enterprise: market and customer analysis, beating the competition, planning and managing for profitability, high-tech marketing and sales, and business partnerships and acquisitions. Not a general management course; focuses explicitly on what is relevant for engineers and scientists working in a commercial environment. For junior/senior undergraduate or graduate students.",
    "name": "Business Issues for Engineers and Scientists",
    "subj": "ENGR"
  },
  "ENGR-6120": {
    "crse": "6120",
    "description": "Advanced Manufacturing Processes and Systems (AMP) is a project-based lecture/laboratory course that teaches graduate engineering students how to develop new manufacturing processes and systems.",
    "name": "Advanced Manufacturing Processes and Systems",
    "subj": "ENGR"
  },
  "ENGR-6200": {
    "crse": "6200",
    "description": "Students frame questions and problems in forms that can be analyzed using data analytic tools. Students use data wrangling and preparation methods to prepare for analysis. Students use analytical tools to evaluate analytic models using linear/nonlinear multivariate methodologies. Students validate results and develop algorithms that can be used to make recommendations and forecasts. Students work with stakeholders to scope and frame questions and problems so that actionable results can be achieved.",
    "name": "Data-driven Decision Making",
    "subj": "ENGR"
  },
  "ENGR-6205": {
    "crse": "6205",
    "description": "Students use visualization and cluster analysis tools to gain deeper insights into production and logistic relationships. Students apply data analytic process to real-world production problems and questions, including evaluating production throughput, factor isolation and output risk analysis, modeling production changes, forecasting environmental control factor changes, and minimization of defects and shortages. Students tune models to represent current-state and adjust models as underlying assumptions change. Students cannot receive credit for both this course and ENGR 6210 or ENGR 6215.",
    "name": "Production and Logistic Analysis",
    "subj": "ENGR"
  },
  "ENGR-6206": {
    "crse": "6206",
    "description": "Working with a faculty member, students develop a big data inquiry model for a production related issue, question, or problem of their choosing. Over the semester, the student frames the question to be analyzed, collects and prepares data for analysis, performs the analysis and presents actionable results and recommendations back to the organization. Students cannot receive credit for both this course and ENGR 6211 or ENGR 6216.",
    "name": "Modeling Production Decisions",
    "subj": "ENGR"
  },
  "ENGR-6210": {
    "crse": "6210",
    "description": "Students use visualization and cluster analysis tools to gain deeper insight into health industry relationships. Students apply data analytic process to real-world health care problems and questions, including resources scheduling optimization, therapeutic effectiveness analysis, population intervention studies, demographically-related health trends, and benchmark setting for standard of care dashboard development. Students tune models to represent current-state and adjust models as underlying assumptions change. Students cannot receive credit for both this course and ENGR 6205 or ENGR 6215.",
    "name": "Health Industry Analytics",
    "subj": "ENGR"
  },
  "ENGR-6211": {
    "crse": "6211",
    "description": "Working with a faculty member, students develop a big data health industry model for an issue, question, or problem of their choosing. Over the semester, the student frames the question to be analyzed, collects and prepares business data for analysis, performs the analysis, and presents actionable results and recommendations back to the organization. Students cannot receive credit for both this course and ENGR 6206 or ENGR 6216. Â",
    "name": "Modeling Health Decisions",
    "subj": "ENGR"
  },
  "ENGR-6215": {
    "crse": "6215",
    "description": "Students use visualization and cluster analysis tools to gain deeper insights into complex business relationships. Students apply data analytic process to real-world business problems and questions, including pricing decisions, customer analysis, competitive analysis, financial forecasts, customer decision models, organizational performance dashboards. Students tune models to represent current-state and adjust models as underlying assumptions change. Students cannot receive credit for both this course and ENGR 6205 or ENGR 6210.",
    "name": "Business Intelligence Analysis",
    "subj": "ENGR"
  },
  "ENGR-6216": {
    "crse": "6216",
    "description": "Working with a faculty member, students develop a big data inquiry model for a complex business issue, question, or problem of their choosing. Over the semester, the student frames the question to be analyzed, collects and prepares business data for analysis, performs the analysis, and presents actionable results and recommendations back to the organization. Students cannot receive credit for both this course and ENGR 6206 or ENGR 6211.",
    "name": "Modeling Business Decisions",
    "subj": "ENGR"
  },
  "ENGR-6220": {
    "crse": "6220",
    "description": "Students design and deploy analytical systems that serve as the basis for the analysis, processing, storage, and interface of the machine learing process. Students choose learning models appropriate to the result desired using decision tree, Bayesian, neural net, and vector machine approaches. Students use multiple statistical approaches to evaluate results that lead to best results.",
    "name": "Data Architecture",
    "subj": "ENGR"
  },
  "ENGR-6221": {
    "crse": "6221",
    "description": "Students develop predictive models that lead to the least likelihood of unintended variance and build natural language and recommendation engines for common applications such as enhancement engines. Students observe results and tune recommendation models to achieve more accurate predictions and recommendations.",
    "name": "Machine Learning Frameworks",
    "subj": "ENGR"
  },
  "ENGR-6222": {
    "crse": "6222",
    "description": "Working directly with a faculty member, students build machine learning systems that can be used as the foundation for decision-making intelligences, where learning systems transition from recommendations to decision capacities. Over the semester, the student proposes the model, develops the model, and trains the system to improve performance.",
    "name": "Deep Learning in AI Systems",
    "subj": "ENGR"
  },
  "ENGR-6230": {
    "crse": "6230",
    "description": "Learn the fundamentals of lean and six sigma philosophies and gain experience with a toolkit to improve existing processes by applying them to relevant workplace process. The Define, Measure, Analyze, Improve, and Control (DMAIC) improvement cycle is used, in which students learn and gain experience using multiple tools for each step of the improvement cycle, including voice of customer (VOC), quality functional deployment (QFD), 5S, Kaizens, and plan-do-check-act (PDCA).",
    "name": "Lean Six Sigma I",
    "subj": "ENGR"
  },
  "ENGR-6231": {
    "crse": "6231",
    "description": "Building on the experience with DMAIC, students learn to identify the need for a new process, quantify its value and create it so that the quality of the results meet a predefined quality standard. To do so, the Define, Measure, Analyze, Design, Optimize, and Verify (DMADOV) is used. The first three phases of DMAIC lay the foundation, but new tools and skills are learned in the context of new process creation. These include: developing an elevator speech, data collection and statistical methods for design of experiments (DOE), root cause analysis, and developing key performance indicators (KPIs) and dashboards.",
    "name": "Lean Six Sigma II",
    "subj": "ENGR"
  },
  "ENGR-6970": {
    "crse": "6970",
    "description": "Active participation in a semester-long project, under the supervision of a faculty adviser. A Professional Project often serves as a culminating experience for a Professional Master's program but, with departmental or school approval, can be used to fulfill other program requirements. With approval, students may register for more than one Professional Project. Professional Projects must result in documentation established by each department or school, but are not submitted to the Office of Graduate Education and are not archived in the library. Grades of A, B, C, or F are assigned by the faculty adviser at the end of the semester. If not completed on time, a formal Incomplete grade may be assigned by the faculty adviser, listing the work remaining to be completed and the time limit for completing this work.",
    "name": "Professional Project",
    "subj": "ENGR"
  },
  "ENVE-2110": {
    "crse": "2110",
    "description": "Classes of pollutants and standards that define water, air and soil quality. Risk concepts and regulations to protect public health and ecosystems. Application of physics, chemistry and biology to describe and assessÂ environmental systems. Application of mass and energy balances to design and analyze processes that purify water, air and land. Selected topics in water resources and management of solid and hazardous wastes.",
    "name": "Introduction to Environmental Engineering",
    "subj": "ENVE"
  },
  "ENVE-2940": {
    "crse": "2940",
    "description": "",
    "name": "Readings in Environmental Engineering",
    "subj": "ENVE"
  },
  "ENVE-4110": {
    "crse": "4110",
    "description": "Fundamentals of aqueous chemistry as applied to the evolution of natural waters. The course covers principles of chemical equilibrium, activity models for solutes, pH as a master variable, concentration and Eh-pH diagrams, mineral solubility, aqueous complexes, ion exchange, and stable isotopes. The carbonate system, weathering reactions, and acid rain are examined in detail. Emphasis is on the chemical reactions that control surface and groundwater evolution in natural and engineered (treatment process) settings. Students learn theory, computation methods, and the use of computer programs for calculation of speciation and mass balance.",
    "name": "Aqueous Geochemistry",
    "subj": "ENVE"
  },
  "ENVE-4180": {
    "crse": "4180",
    "description": "The design of equipment, processes, and systems of interest in environmental engineering through application of scientific, technological, and economic principles. Emphasis is placed on problem formulation and conceptual, analytical, and decision aspects of open-ended design situations. Students will integrate knowledge and skills gained in previous and concurrent courses, and learn research techniques to find and use resources from the technical literature. Health and safety issues are presented. Professional development topics are presented including professional ethics and registration. Students will develop communication skills through proposal preparation, report writing, oral presentation. This is a communication-intensive course.",
    "name": "Environmental Process Design",
    "subj": "ENVE"
  },
  "ENVE-4200": {
    "crse": "4200",
    "description": "Classification and characteristics of solid and hazardous wastes; appropriate waste management systems; design of collection and transfer systems; methods of destruction and disposal, including landfills; recycle methods; and salvage and conversion operations for resource recovery.",
    "name": "Solid and Hazardous Waste Engineering",
    "subj": "ENVE"
  }
}