{
  "CSCI-2800": {
    "crse": "2800",
    "description": "Introduction to computer architecture, assembler and C programming, and operating systems. Coverage includes numeric representations, processors, memory, I/O, digital logic gates, digital logic circuits, machine-level instruction formats, addressing modes, instruction types, and flow of control. Operating systems coverage includes memory management, processes, interprocess communication (IPC), system calls, synchronization, parallel programming, and network programming. Programming projects are required.",
    "name": "Computer Architecture And Operating Systems (Caos)",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-2960": {
    "crse": "2960",
    "description": "TBA",
    "name": "Introduction To Competitive Programming",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4700": {
    "crse": "4700",
    "description": "The mission of the Rensselaer Center for Open Source (RCOS) is to cultivate an inclusive, creative, and entrepreneurial community that seeks to empower students to develop open-source solutions to real-world problems. RCOS is a project-based course in which students join a project team and work primarily on one open-source project throughout the semester. Projects must be open source but can be existing external projects, internal (RCOS) projects, or new endeavors. Collaborative and cross-disciplinary projects are encouraged. Students are required to consistently contribute to their open source projects, in particular through multiple commits (commit early, commit often), presenting their work and/or specific technical talks, mentoring other projects, and generally contributing to the open source community.",
    "name": "Rcos Open Source Development",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4960": {
    "crse": "4960",
    "description": "TBA",
    "name": "Knowledge Graph-Powered Hybrid Ai",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4961": {
    "crse": "4961",
    "description": "This course covers network security and defense mechanisms to thwart a variety of attacks. Topics include packet sniffing and spoofing, attacks on the TCP/IP protocol, attacks on the ICMP, ARP protocol, firewall, DNS security: local DNS attack, remote DNS attack, virtual private networks, public key infrastructure, transport layer security, and CDN security.",
    "name": "Network Security And Defense",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4962": {
    "crse": "4962",
    "description": "This course is designed to introduce students to the key aspects of CSCI inter-domain research. The course's goal is to make students aware of the technicalities related to formal research and to assist students in overcoming any common misconceptions that may exist. By completing this course, students will be able to conduct research in a more systematic and formal manner from the start.",
    "name": "Introduction To Research [Communication-Intensive]",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4963": {
    "crse": "4963",
    "description": "TBD",
    "name": "Computer Architecture",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4964": {
    "crse": "4964",
    "description": "This course will enable students to understand and apply software verification techniques with a particular emphasis on fundamental proof methods. The course will cover proof methods including implication chaining, applied to equational reasoning, sentential logic, and first-order logic. The course will also cover proofs about fundamental data types and algorithms. The course will use the Athena dual computation/deduction language, and the MIT Press book \"Fundamental Proof Methods in Computer Science\" by Konstantine Arkoudas and David Musser. Students will also review current research on software verification on topics of their interest, for example: model checking, program analyses, symbolic testing, temporal logic, modal logics, formal programming language semantics, proof-carrying code, dependent types, and session types. Contingent on time availability, the course will study proofs at an abstract level for reusability and their application to proofs about concurrent actor programs.",
    "name": "Software Verification",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4965": {
    "crse": "4965",
    "description": "This course will study the application of artificial intelligence techniques to problems in environmental conservation. A variety of data modalities will be considered, including image and video, acoustic, satellite, etc. The entire sequence of activities will be discussed – problem formulation, data collection and curation, algorithm training and testing, and system deployment. Along the way, FAIR and CARE principles for AI and data will be discussed, and other societal impacts will be addressed. Conservation applications will also be used to examine the state-of-the-art in AI. Students enrolled in the course are expected to have a working knowledge of AI/ML techniques that includes having trained PyTorch (preferrable) or TensorFlow (optional) models. Review materials will be provided. Requirements include active class participation, short homework assignments, leading paper discussions, and a semester-long technical project.",
    "name": "Ai For Conservation",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4966": {
    "crse": "4966",
    "description": "This course is an interdisciplinary introduction to network resilience and its applications in both science and engineering. Classes will interchangeably present the chapters from these textbooks with an emphasis on the current active research papers related to network resilience, robustness, stability, and control. Topics to be covered include the network theory, dynamical systems, data analysis, and applications to biology, ecology, sociology, technology, and other fields. Students will learn about the ongoing research in the area and ultimately apply their knowledge to conduct their research by analyzing real network data set of their choosing as part of the final project.",
    "name": "Network Resilience",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4967": {
    "crse": "4967",
    "description": "TBD",
    "name": "Advanced Operating Systems",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4968": {
    "crse": "4968",
    "description": "In modern machine learning, we usually see more highlights of applications like GANs and deep neural networks. However, if we take a deeper look, the foundational connection between algorithm design and machine learning remains critical as ever. This course aims to explore the interplay between these two fields and demonstrate how they continue to drive innovation together. We will cover how algorithm design helps tackle major challenges in modern machine learning. You will learn the principles behind learning with efficiency to process very large datasets and techniques for learning from noisy, unreliable data. We will also explore how machine learning is facilitating algorithm design. We will examine how concepts originated from data science, e.g., differential privacy, are being integrated into general algorithms. We will also see how machine learning models can be used to dramatically boost the performance of algorithms. This is a rigorous, proof-based course focused on algorithm design. A solid foundation in algorithms, data structures, and mathematical maturity is required. Expect to spend most of your time with math and proofs in this course.",
    "name": "Algorithm Design & Modern Ml",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4969": {
    "crse": "4969",
    "description": "TBD",
    "name": "Software Analysis & Debugging",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4972": {
    "crse": "4972",
    "description": "Cross-listed from: COGS 4962/6962; PHIL 4961",
    "name": "Introduction To Logic-Based Ai",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-4975": {
    "crse": "4975",
    "description": "Deep Learning on Graphs is a course to explore state-of-the-art techniques in graph representation learning, with a particular emphasis on the emerging potential of Graph Neural Networks (GNNs). Graphs are widely used to represent data across various domains, including social science, linguistics, chemistry, biology, and physics, and GNNs have proven to be highly effective in facilitating computational tasks on these graphs. This course will cover topics such as network embedding, GNNs, properties of GNNs, and diverse applications of GNNs. In addition to lectures, students will be expected to read and discuss relevant literature, deliver presentations, and participate in research projects related to the subject matter.",
    "name": "Deep Learning On Graphs",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6960": {
    "crse": "6960",
    "description": "TBA",
    "name": "Knowledge Graph-Powered Hybrid Ai",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6961": {
    "crse": "6961",
    "description": "The course will explore advanced topics in machine learning, including current research and emerging techniques. The seminar will consist of both lectures and discussion sessions, where students will have the opportunity to explore current research papers and present on a research topic of their choice or their own findings. The seminar will also provide students with the opportunity to develop their research and presentation skills. By the end of the seminar, students will have gained a deeper understanding of advanced topics in machine learning and developed the skills necessary to contribute to ongoing research in the field.",
    "name": "Machine Learning Seminar",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6964": {
    "crse": "6964",
    "description": "This course will enable students to understand and apply software verification techniques with a particular emphasis on fundamental proof methods. The course will cover proof methods including implication chaining, applied to equational reasoning, sentential logic, and first-order logic. The course will also cover proofs about fundamental data types and algorithms. The course will use the Athena dual computation/deduction language, and the MIT Press book \"Fundamental Proof Methods in Computer Science\" by Konstantine Arkoudas and David Musser. Students will also review current research on software verification on topics of their interest, for example: model checking, program analyses, symbolic testing, temporal logic, modal logics, formal programming language semantics, proof-carrying code, dependent types, and session types. Contingent on time availability, the course will study proofs at an abstract level for reusability and their application to proofs about concurrent actor programs.",
    "name": "Software Verification",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6965": {
    "crse": "6965",
    "description": "This course will study the application of artificial intelligence techniques to problems in environmental conservation. A variety of data modalities will be considered, including image and video, acoustic, satellite, etc. The entire sequence of activities will be discussed – problem formulation, data collection and curation, algorithm training and testing, and system deployment. Along the way, FAIR and CARE principles for AI and data will be discussed, and other societal impacts will be addressed. Conservation applications will also be used to examine the state-of-the-art in AI. Students enrolled in the course are expected to have a working knowledge of AI/ML techniques that includes having trained PyTorch (preferrable) or TensorFlow (optional) models. Review materials will be provided. Requirements include active class participation, short homework assignments, leading paper discussions, and a semester-long technical project.",
    "name": "Ai For Conservation",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6966": {
    "crse": "6966",
    "description": "This course is an interdisciplinary introduction to network resilience and its applications in both science and engineering. Classes will interchangeably present the chapters from these textbooks with an emphasis on the current active research papers related to network resilience, robustness, stability, and control. Topics to be covered include the network theory, dynamical systems, data analysis, and applications to biology, ecology, sociology, technology, and other fields. Students will learn about the ongoing research in the area and ultimately apply their knowledge to conduct their research by analyzing real network data set of their choosing as part of the final project.",
    "name": "Network Resilience",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6968": {
    "crse": "6968",
    "description": "This course introduces methods for automating the process of decision-making. Starting with the concept of probabilistic reasoning, this course will provide a foundation for a sequential decision-making framework, which can be applied in various domains including autonomous driving, exploration, and robotics. The focus will specifically be on decision making problems under state uncertainty and finally multi-agent systems. Topics include: Bayesian networks, Markov decision process, partially observable Markov decision processes, multi-agent reasoning.",
    "name": "Decision Making Under Uncertainty",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6971": {
    "crse": "6971",
    "description": "In modern machine learning, we usually see more highlights of applications like GANs and deep neural networks. However, if we take a deeper look, the foundational connection between algorithm design and machine learning remains critical as ever. This course aims to explore the interplay between these two fields and demonstrate how they continue to drive innovation together. We will cover how algorithm design helps tackle major challenges in modern machine learning. You will learn the principles behind learning with efficiency to process very large datasets and techniques for learning from noisy, unreliable data. We will also explore how machine learning is facilitating algorithm design. We will examine how concepts originated from data science, e.g., differential privacy, are being integrated into general algorithms. We will also see how machine learning models can be used to dramatically boost the performance of algorithms. This is a rigorous, proof-based course focused on algorithm design. A solid foundation in algorithms, data structures, and mathematical maturity is required. Expect to spend most of your time with math and proofs in this course.",
    "name": "Algorithm Design & Modern Ml",
    "source": "CSCI topics",
    "subj": "CSCI"
  },
  "CSCI-6975": {
    "crse": "6975",
    "description": "Deep Learning on Graphs is a course to explore state-of-the-art techniques in graph representation learning, with a particular emphasis on the emerging potential of Graph Neural Networks (GNNs). Graphs are widely used to represent data across various domains, including social science, linguistics, chemistry, biology, and physics, and GNNs have proven to be highly effective in facilitating computational tasks on these graphs. This course will cover topics such as network embedding, GNNs, properties of GNNs, and diverse applications of GNNs. In addition to lectures, students will be expected to read and discuss relevant literature, deliver presentations, and participate in research projects related to the subject matter.",
    "name": "Deep Learning On Graphs",
    "source": "CSCI topics",
    "subj": "CSCI"
  }
}